{
  "url": "https://www.linkedin.com/in/abigail-karparis-57b940107/",
  "extracted": {
    "name": "Abigail Karparis",
    "headline": "Founder Imaginal Foundation, Regenerative Farmer using food to build thriving, resilient communities",
    "full_text": "0 notifications total\nSkip to search\nSkip to main content\nKeyboard shortcuts\nClose jump menu\nnew feed updates notifications\nHome\n1\n1 new network update notification\nMy Network\nJobs\nMessaging\n11\n11 new notifications\nNotifications\nMe\nFor Business\nAdvertise\ntest\nAbigail Karparis \n She/Her  \n1st degree connection\n1st\nFounder Imaginal Foundation, Regenerative Farmer using food to build thriving, resilient communities\nPortsmouth, New Hampshire, United States  Contact info\n153 connections\nEduard Müller, Bas van den Berg, and 10 other mutual connections\nEduard Müller, Bas van den Berg, and 10 other mutual connections\nMessage\nMore\nAbout\nAbout\nI see food as our most intimate connection with nature, and it is my mission to use this to reconnect people with the earth.\n\nMy passion is building empowered, sustainable, and resilient communities through food and agriculture.\n\nI have learned(and continue to learn) through a vast diversity of farming methods and philosophies, and through working with a plethora of different plants and animals. I have also had the opportunity to use farming as a means of travel, that has taken me across the United States, into the Pacific and New Zealand, and down to Costa Rica, further diversifying not only my agricultural experience, but also the people, ecosystems, and soil types, that I am working with and learning from.\n\nI have both a foundation rooted in science, data collection, and academic research and applied skills and experience working in the field and within communities. \n\nCommunity immersion has led me to value community-based solutions and local knowledge, especially that of indigenous populations, and I see this, as well as the associated sovereignty, as central to creating industry change and an agricultural system that allows both humans and nature to thrive in regenerative and abundant systems\n\nI believe in a locally intensive action, supported by a global network. I am always looking to connect with individuals, organizations, and communities around the world in our collaborative efforts towards global transformation.\nI see food as our most intimate connection with nature, and it is my mission to use this to reconnect people with the earth. My passion is building empowered, sustainable, and resilient communities through food and agriculture. I have learned(and continue to learn) through a vast diversity of farming methods and philosophies, and through working with a plethora of different plants and animals. I have also had the opportunity to use farming as a means of travel, that has taken me across the United States, into the Pacific and New Zealand, and down to Costa Rica, further diversifying not only my agricultural experience, but also the people, ecosystems, and soil types, that I am working with and learning from. I have both a foundation rooted in science, data collection, and academic research and applied skills and experience working in the field and within communities. Community immersion has led me to value community-based solutions and local knowledge, especially that of indigenous populations, and I see this, as well as the associated sovereignty, as central to creating industry change and an agricultural system that allows both humans and nature to thrive in regenerative and abundant systems I believe in a locally intensive action, supported by a global network. I am always looking to connect with individuals, organizations, and communities around the world in our collaborative efforts towards global transformation.\n…see more\nActivity\nActivity\n\n157 followers\n157 followers\n\nPosts\nComments\nLoaded 4 Posts posts\nAbigail Karparis reposted this\nJefta Bade\nJefta Bade\n   • 2nd\nVerified • 2nd\nCo-Founder Drawn Today ✍️ We help digital consultants translate complex plans into visuals that align, sell and scale 🖼️ Creator of the 9Field Method - Structure your thinking & message\nCo-Founder Drawn Today ✍️ We help digital consultants translate complex plans into visuals that align, sell and scale 🖼️ Creator of the 9Field Method - Structure your thinking & message\n3mo • \n \n3 months ago • Visible to anyone on or off LinkedIn\nDid you know I live & work in Costa Rica? 🌴 There I teamed up with an extraordinary group of talented professionals. Together we've launched the Mycelium Learning Network. A global platform to stimulate, support and grow the movement of REGENERATORS. \n\nWe're funded, work with existing projects and awesome people like researcher/ educator Abigail Karparis who published an exciting new article about our work. That's this link!\nBig shout out to Dr. Angie Holzer - founder of WikiCharities and Journal of Nonprofit Innovation. Thank you for the amazing work you're doing!\n\nAnd a special thank you to all the collaborators who worked on making the visual, that shows our story and work.\nMarty Bhatia\nDaniela Gómez C.\nArturo G. Montanaro\nTania Moreno Ramos\nEduard Müller\nStefan Fiedler Alvarado\nAbigail Karparis\n…more\nJournal of Nonprofit Innovation\nJournal of Nonprofit Innovation\n237 followers\n237 followers\nExciting New Article: Digital Infrastructure for the Regenerative Movement: A Case Study of the Mycelium Learning Network\n\nRead this insightful research article about a new study being done on the Regenerative Movement using a Digital Infrastructure. Thanks Abigail Karparis. for the article. And thanks Jefta Bade for this amazing illustration. \nhttps://lnkd.in/ejWjPPAP\n…more\nDigital Infrastructure for the Regenerative Movement: A Case Study of the Mycelium Learning Network\nscholarsarchive.byu.edu\n18\n2 comments\n4 reposts\nAbigail Karparis reposted this\nMarty Bhatia\nMarty Bhatia\n • 2nd\n2nd\nFractional CTO | Nonprofits (US & International) & SMBs\nFractional CTO | Nonprofits (US & International) & SMBs\n1yr • \n \n1 year ago • Visible to anyone on or off LinkedIn\nSo excited!\nActivate to view larger image,\nSee content credentials\nActivate to view larger image,\n14\n5 comments\n5 reposts\nShow all posts\nExperience\nExperience\nCo-Founder\nCo-Founder\nCo-Founder\nImaginal · Full-time\nImaginal · Full-time\nAug 2021 - Present · 4 yrs 3 mos\nAug 2021 to Present · 4 yrs 3 mos\nTransnational\nTransnational\n*Imaginal Foundation is a non-profit accelerator that seeks to energize, enable, and empower community level NGO's through mentorship, digital transformation and strategy, branding and narrative development, networking and partnerships, research and data collection, and project planning and campaigning. Through our work, we help to amplify the impact that these social/environmental organizations have in transforming their community into one that is sustainable, resilient, thriving, and operates in circular, abundant systems.\n*Imaginal Foundation is a non-profit accelerator that seeks to energize, enable, and empower community level NGO's through mentorship, digital transformation and strategy, branding and narrative development, networking and partnerships, research and data collection, and project planning and campaigning. Through our work, we help to amplify the impact that these social/environmental organizations have in transforming their community into one that is sustainable, resilient, thriving, and operates in circular, abundant systems.\nGrant Writing, Project Management and +3 skills\nAgriculture Specialist\nAgriculture Specialist\nDigital Divide Data (DDD) · Contract\nDigital Divide Data (DDD) · Contract\nDec 2021 - Oct 2024 · 2 yrs 11 mos\nDec 2021 to Oct 2024 · 2 yrs 11 mos\nRemote\nRemote\n*Compile extensive resources and documentation on current and developing agricultural technology and data collection in the industry including from AI, ML imaging, remote and proximity sensing, drones, automated technology, indoor systems like hydroponics, and IoT systems, and then present findings to the DDD team. \n*Advised on data processing in the development of Agricultural AI and ML, in order to extract agriculturally relevant information including that on pests, diseases, weeds, soil quality, plant nutrition, and yield estimates\n*Work with clients and the DDD team to ensure projects are both technologically possible and agriculturally relevant\n*Develop data annotation guidelines for projects in accordance with the client’s desired agricultural outcomes and then monitor project progress and accuracy through regular data audits\n*Compile extensive resources and documentation on current and developing agricultural technology and data collection in the industry including from AI, ML imaging, remote and proximity sensing, drones, automated technology, indoor systems like hydroponics, and IoT systems, and then present findings to the DDD team. *Advised on data processing in the development of Agricultural AI and ML, in order to extract agriculturally relevant information including that on pests, diseases, weeds, soil quality, plant nutrition, and yield estimates *Work with clients and the DDD team to ensure projects are both technologically possible and agriculturally relevant *Develop data annotation guidelines for projects in accordance with the client’s desired agricultural outcomes and then monitor project progress and accuracy through regular data audits\nQuality Auditing, Specialized Subject Communication and +2 skills\nCrooked Barn Flower Farm logo\nField Operations Manager\nField Operations Manager\nCrooked Barn Flower Farm · Part-time\nCrooked Barn Flower Farm · Part-time\nSep 2021 - Oct 2022 · 1 yr 2 mos\nSep 2021 to Oct 2022 · 1 yr 2 mos\nKingston, Massachusetts, United States\nKingston, Massachusetts, United States\n*Carry out all aspects of flower farm field work, from seed to harvest, and make decisions on crop wellbeing, harvesting, irrigation, pest management, and amending soil\n*Carry out all aspects of flower farm field work, from seed to harvest, and make decisions on crop wellbeing, harvesting, irrigation, pest management, and amending soil\nOrganic Farming, Botany and +2 skills\nFarm Worker\nFarm Worker\nFarm Worker\nThe HERB FARMacy · Full-time\nThe HERB FARMacy · Full-time\nFeb 2019 - Feb 2020 · 1 yr 1 mo\nFeb 2019 to Feb 2020 · 1 yr 1 mo\nSalisbury, Massachusetts, United States\nSalisbury, Massachusetts, United States\n*Farmed in accordance with USDA certified organic practices, seeding, planting, caring for, and harvesting specialty produce(including micro greens, rare heirloom varieties, ginger, and turmeric), perennials, herbs, and flowers\n*Carried out greenhouse sales of native plants, flowers, medicinal and culinary herbs, vegetables, and perennial food crops, and advised on the planting and care of all plants for sale\n*Carried out intensive record keeping and recording and seasonal market analyses and planning\n*Farmed in accordance with USDA certified organic practices, seeding, planting, caring for, and harvesting specialty produce(including micro greens, rare heirloom varieties, ginger, and turmeric), perennials, herbs, and flowers *Carried out greenhouse sales of native plants, flowers, medicinal and culinary herbs, vegetables, and perennial food crops, and advised on the planting and care of all plants for sale *Carried out intensive record keeping and recording and seasonal market analyses and planning\nOrganic Farming, Herbal Medicine and +3 skills\nFarm Worker\nFarm Worker\nFarm Worker\nPlato's Organic Harvest · Seasonal\nPlato's Organic Harvest · Seasonal\nMay 2017 - Sep 2018 · 1 yr 5 mos\nMay 2017 to Sep 2018 · 1 yr 5 mos\nMiddleborough, Massachusetts, United States\nMiddleborough, Massachusetts, United States\n*Farmed in accordance with USDA certified organic practices, planting, caring for, and harvesting produce and chickens\n*Farmed in accordance with USDA certified organic practices, planting, caring for, and harvesting produce and chickens\nOrganic Farming, Poultry and +1 skill\nShow all 7 experiences\nEducation\nEducation\nUniversity of New Hampshire\nUniversity of New Hampshire\nBachelor of Science - BS , Environmental Conservation and Sustainability, Magna Cum Laude with Honors, Minor in Anthropology\nBachelor of Science - BS , Environmental Conservation and Sustainability, Magna Cum Laude with Honors, Minor in Anthropology\nAug 2015 - Dec 2018\nAug 2015 - Dec 2018\nGrade: 3.77\nGrade: 3.77\nActivities and societies: Xi Sigma Pi (Honors Society; Vice President), Slow Foods, and the Rock Climbing Team (Captain)\nActivities and societies: Xi Sigma Pi (Honors Society; Vice President), Slow Foods, and the Rock Climbing Team (Captain)\nHighly interdisciplinary studies, including ecology, data and field methods, GIS, economics, women's and justice studies, sustainability, anthropology, systems thinking, community planning, political science, writing \nAreas of focus include sustainable food systems and sustainable agriculture.\nHighly interdisciplinary studies, including ecology, data and field methods, GIS, economics, women's and justice studies, sustainability, anthropology, systems thinking, community planning, political science, writing Areas of focus include sustainable food systems and sustainable agriculture.\nUniversity of Auckland\nUniversity of Auckland\nMaster of Arts - MA, Anthropology\nMaster of Arts - MA, Anthropology\nFeb 2020 - Dec 2020\nFeb 2020 - Dec 2020\nGrade: 3.71\nGrade: 3.71\n120/240 Credits completed\nAreas of focus include traditional Māori agriculture, landscape archaeology, ecodynamics, niche construction, and GIS.\n120/240 Credits completed Areas of focus include traditional Māori agriculture, landscape archaeology, ecodynamics, niche construction, and GIS.\nShow all 3 educations\nVolunteering\nVolunteering\nProject Manager and Researcher\nProject Manager and Researcher\nThe Clean Wave\nThe Clean Wave\nAug 2021 - Present · 4 yrs 3 mos\nAug 2021 - Present · 4 yrs 3 mos\nEnvironment\nEnvironment\n*This highly energized and connected, community based organization is working towards cleaning the beaches of Costa Rica, making the community of Tamarindo zero waste, and ensuring humans and nature can thrive together. This is done through beach clean ups, reforestation plantings, wildlife bridges, and waste-stream intervention projects(such as community composting) that are highly collaborative with our diverse community and partner businesses and organizations.\n*This highly energized and connected, community based organization is working towards cleaning the beaches of Costa Rica, making the community of Tamarindo zero waste, and ensuring humans and nature can thrive together. This is done through beach clean ups, reforestation plantings, wildlife bridges, and waste-stream intervention projects(such as community composting) that are highly collaborative with our diverse community and partner businesses and organizations.\nGarden Mentor and Volunteer\nGarden Mentor and Volunteer\nGarden Mentor and Volunteer\nOpen Homes\nOpen Homes\nMar 2020 - May 2021 · 1 yr 3 mos\nMar 2020 - May 2021 · 1 yr 3 mos\nCivil Rights and Social Action\nCivil Rights and Social Action\n*Open Homes is a highly collaborative backyard and urban gardening initiative with the goal of building community resilience and regenerating a culture of abundance, through growing and sharing food, knowledge and resources. It focuses on culturally relevant foods and crops in West Auckland, New Zealand.\n*Open Homes is a highly collaborative backyard and urban gardening initiative with the goal of building community resilience and regenerating a culture of abundance, through growing and sharing food, knowledge and resources. It focuses on culturally relevant foods and crops in West Auckland, New Zealand.\nShow all 5 volunteer experiences\nSkills\nSkills\nCommunity Organizing\nCommunity Organizing\nCo-Founder at Imaginal\nCo-Founder at Imaginal\nEndorse\nSustainable Agriculture\nSustainable Agriculture\nEndorse\nShow all 35 skills\nRecommendations\nRecommendations\nRecommend Abigail\nReceived\nReceived\nGiven\nGiven\nMarty Bhatia\nMarty Bhatia\n· 2nd\nSecond degree connection\nFractional CTO | Nonprofits (US & International) & SMBs\nFractional CTO | Nonprofits (US & International) & SMBs\nSeptember 12, 2022, Marty worked with Abigail on the same team\nSeptember 12, 2022, Marty worked with Abigail on the same team\nEvery now and then my career has me cross paths with someone extraordinary. Abby is one of those people who demonstrate living by one's value system. Her unwaivering stance on excellence and accuracy make her one of the most trustworthy people I know.\n\nI worked side by side with Abby for 11 months in NZ during lockdown. I learned so much from her and gained valuable understanding and skills from the work we did together.\n\nThrough the process we've repeated our work in Costa Rica and are developing Imaginal Foundation.\n\nI highly recommend Abby for any project. You would be lucky to have her.\nEvery now and then my career has me cross paths with someone extraordinary. Abby is one of those people who demonstrate living by one's value system. Her unwaivering stance on excellence and accuracy make her one of the most trustworthy people I know. I worked side by side with Abby for 11 months in NZ during lockdown. I learned so much from her and gained valuable understanding and skills from the work we did together. Through the process we've repeated our work in Costa Rica and are developing Imaginal Foundation. I highly recommend Abby for any project. You would be lucky to have her.\nInterests\nInterests\nTop Voices\nTop Voices\nCompanies\nCompanies\nGroups\nGroups\nNewsletters\nNewsletters\nSchools\nSchools\nDan Ariely\nDan Ariely\n· 2nd\nSecond degree connection\nI do research in behavioral economics and try to describe it in plain language. These findings have enriched my life, and my hope is that they will do the same for you.\nI do research in behavioral economics and try to describe it in plain language. These findings have enriched my life, and my hope is that they will do the same for you.\n445,066 followers\n445,066 followers\nFollow\nBrené Brown\nBrené Brown\n· 3rd\nThird degree connection\nUniversity of Houston + University of Texas at Austin | Researcher. Storyteller. Courage-builder. \nUniversity of Houston + University of Texas at Austin | Researcher. Storyteller. Courage-builder. \n4,760,141 followers\n4,760,141 followers\nFollowing\nMore profiles for you\nMore profiles for you\nPeter Mwangi\nPeter Mwangi\n· 3rd\nThird degree connection\nFounder/CEO, Green Pamoja Initiative\nFounder/CEO, Green Pamoja Initiative\nMessage\nJesse Palmer\nJesse Palmer\n· 3rd\nThird degree connection\nFounder & Head Haunt-cho of S.C.A.R.E.\nFounder & Head Haunt-cho of S.C.A.R.E.\nMessage\nPETER kingori\nPETER kingori\n· 2nd\nSecond degree connection\nTrainer in Forest Garden approach\nTrainer in Forest Garden approach\nMessage\nBrandon Duras\nBrandon Duras\n· 3rd\nThird degree connection\nDirector of Instrumental Music at Brunswick High School\nDirector of Instrumental Music at Brunswick High School\nMessage\nChanell Sosa\nChanell Sosa\n· 3rd\nThird degree connection\n I am a recent graduate from Weber State University. My degree is in Strategic Communication and Public Relations. I strive to collaborate in teams and be as creative as possible. I would love to connect with you! \n I am a recent graduate from Weber State University. My degree is in Strategic Communication and Public Relations. I strive to collaborate in teams and be as creative as possible. I would love to connect with you! \nMessage\nShow all\nExplore Premium profiles\nExplore Premium profiles\nM Vincent Miller\nM Vincent Miller\n· 2nd\nSecond degree connection\nbuilding before buzzwords\nbuilding before buzzwords\nFollow\nSally Letzer\nSally Letzer\n· 3rd\nThird degree connection\nSHE.E.O./Founder at C.H. Revitalization Group Inc.\nSHE.E.O./Founder at C.H. Revitalization Group Inc.\nFollow\nJuan Camilo Sanchez\nJuan Camilo Sanchez\n· 3rd\nThird degree connection\nFounder & CEO, Orphiq\nFounder & CEO, Orphiq\nMessage\nPeople you may know\nPeople you may know\n\nFrom Abigail's school\nFrom Abigail's school\n\nZack Angelini\nZack Angelini\nCo-Founder of Public Good Provisions\nCo-Founder of Public Good Provisions\nConnect\nPeter M.\nPeter M.\nPresident and CEO, U.S. Endowment for Forestry and Communities\nPresident and CEO, U.S. Endowment for Forestry and Communities\nConnect\nLee-Ann Perkins\nLee-Ann Perkins\nGroup Operations Director at Sustainable Ventures\nGroup Operations Director at Sustainable Ventures\nConnect\nCandice Chivilo\nCandice Chivilo\nFounder and Charter Specialist at Myst Yacht Charters\nFounder and Charter Specialist at Myst Yacht Charters\nConnect\nPhoebe McPherson\nPhoebe McPherson\nPhoebe McPherson\nmaking kanna + mushroom formulas to help you FEEL.\n✨do not contact me via linkedin✨\nmaking kanna + mushroom formulas to help you FEEL. ✨do not contact me via linkedin✨\nConnect\nShow all\nStatus is online\nMessaging\nYou are on the messaging overlay. Press enter to open the list of conversations.\nCompose message\nYou are on the messaging overlay. Press enter to open the list of conversations."
  }
}