{
  "url": "https://www.linkedin.com/in/allisoncywu/",
  "extracted": {
    "name": "Allison Chia-Yi Wu (吳家宜)",
    "headline": "Empowering Sustainable Startups with Cutting-Edge AI Solutions 🌍🌱| AI/ML Consultant at TerraMinds.ai | Terra.do Fellow | LLM, Gen AI, MLOps, Statistics | #OpenDoorClimate",
    "full_text": "0 notifications total\nSkip to search\nSkip to main content\nKeyboard shortcuts\nClose jump menu\nnew feed updates notifications\nHome\n1\n1 new network update notification\nMy Network\nJobs\nMessaging\n22\n22 new notifications\nNotifications\nMe\nFor Business\nAdvertise\ntest\nAllison Chia-Yi Wu (吳家宜) \n She/Her  \n1st degree connection\n1st\nEmpowering Sustainable Startups with Cutting-Edge AI Solutions 🌍🌱| AI/ML Consultant at TerraMinds.ai | Terra.do Fellow | LLM, Gen AI, MLOps, Statistics | #OpenDoorClimate\nNucleix Ltd.\nTerra.do\nSan Diego, California, United States  Contact info\n500+ connections\nDavid Hodgson, Ephi Banaynal dela Cruz, and 3 other mutual connections\nDavid Hodgson, Ephi Banaynal dela Cruz, and 3 other mutual connections\nMessage\nMore\nAbout\nAbout\nAs a data science and bioinformatics leader passionate about making societal impacts, I have dedicated my career to using data to drive meaningful change. My work at Juno Diagnostics and ResMed underscored the transformative power of data in healthcare, particularly in advancing health equity and enhancing patient care.\n\nA pivotal moment in my journey was participating in Terra.do's LFA program, which directed my expertise in AI/ML towards the critical field of Climate and Sustainability Tech. Now, as the founder of TerraMinds.ai, I am working as a fractional AI/ML tech lead for early-stage start-ups in biotech, healthcare, and climate tech, empowering them with innovative AI/ML solutions. This new chapter blends my experience and passion for technology with a commitment to creating a more sustainable future.\n\nI am eager to collaborate with professionals who share a vision of leveraging data-driven innovation for a better world. Let's connect to explore opportunities for impactful collaboration in climate and sustainability.\n\nI am eager to collaborate with professionals who share a vision of leveraging data-driven innovation for a better world. Let's connect to explore opportunities for impactful collaboration in the realm of climate and sustainability.\nAs a data science and bioinformatics leader passionate about making societal impacts, I have dedicated my career to using data to drive meaningful change. My work at Juno Diagnostics and ResMed underscored the transformative power of data in healthcare, particularly in advancing health equity and enhancing patient care. A pivotal moment in my journey was participating in Terra.do's LFA program, which directed my expertise in AI/ML towards the critical field of Climate and Sustainability Tech. Now, as the founder of TerraMinds.ai, I am working as a fractional AI/ML tech lead for early-stage start-ups in biotech, healthcare, and climate tech, empowering them with innovative AI/ML solutions. This new chapter blends my experience and passion for technology with a commitment to creating a more sustainable future. I am eager to collaborate with professionals who share a vision of leveraging data-driven innovation for a better world. Let's connect to explore opportunities for impactful collaboration in climate and sustainability. I am eager to collaborate with professionals who share a vision of leveraging data-driven innovation for a better world. Let's connect to explore opportunities for impactful collaboration in the realm of climate and sustainability.\nTop skills\nTop skills\nMachine Learning • Artificial Intelligence (AI) • Infrastructure as code (IaC) • Large Language Models (LLM) • Generative AI\nMachine Learning • Artificial Intelligence (AI) • Infrastructure as code (IaC) • Large Language Models (LLM) • Generative AI\nServices\nServices\nBusiness Analytics • Healthcare Consulting • Marketing Consulting • Cloud Management • Database Development • Cloud Application Development\nBusiness Analytics • Healthcare Consulting • Marketing Consulting • Cloud Management • Database Development • Cloud Application Development\nRequest services\nShow all services\nFeatured\nFeatured\nPost\nPost\n🌱 Exciting News on My New Venture in Climate Tech 🌍\nIn the last three months with Terra.do's LFA program (shout out to the Elephants🐘cohort!), I've embarked on an exhilarating journey through various fields of climate tech. My passion in AI/ML is now laser-focused on a new, vital mission: Climate and Sustainability Tech.\n\nWhy the shift from biotech, where I've built a strong network, to climate tech? Simple: I'm driven to harness innovative technologies for greater societal good. Throughout my career, my 'north star' has been using AI/ML to create a more equitable, sustainable world. Now, I'm thrilled to channel this expertise where it's urgently needed: combating climate change.\n\n🚀 Introducing TerraMinds.ai: My Leap into Climate-focused AI/ML Consulting 🚀\nI'm proud to announce the launch of TerraMinds.ai, a consultancy dedicated to empowering early-stage climate/sustainability tech startups with AI/ML solutions. My services include:\n🤖 AI/ML Solution Implementation: Customized AI/ML solutions to drive your innovation forward.\n🗺️ Project Scoping and Road-mapping: Strategic guidance for AI/ML project planning and execution.\n🧠 Senior-level Mentorship: Expert mentorship to steer your AI/ML projects towards success.\n\nAre you at the helm of an emerging climate tech startup? Do you have an idea that could flourish with AI/ML integration? Let's connect and explore how we can accelerate your impact for a better, sustainable future. 🌟\n\n\nhashtag\n#ClimateTech \nhashtag\n#AIML \nhashtag\n#Sustainability \nhashtag\n#Innovation \nhashtag\n#TerraMinds \nhashtag\n#ai \n176\n25 comments\nPost\nPost\n8 months ago, we launched a novel NIPS test that empowers women in health deserts through easy at-home collection and get accurate NIPS results without going to the doctor's office. Yesterday however we learned that we have become one of the startups that will dissolve in this wave of economy depression.\n\nTogether, in almost 2 years, we built state-of-the-art cloud infrastructures, bioinformatics algorithms, analysis pipelines that supported automated analysis of 5000+ samples within 8 months. Aside from this, we stood up the data infrastructures that enabled data visibility for the rest of the organization to pivot and respond to changes in the market. I am very proud with what we have achieved within this short amount of time.\n\nIf you're seeing this post and you're in need of any of the following talents for the specific positions. Please DM me as I have recommendations of great talents that just got back to the market now. I would work with these talents in a beat if I have a chance:\n- Bioinformatics scientist: NGS analysis, algorithm development, statistics, machine learning\n- Data scientist: specializing in production level machine learning modeling, deployment (MLOps), statistics, data visualization, data wrangling, data analytics\n- Bioinformatics/Data Engineer: AWS cloud infrastructure, bioinformatics/ML pipeline engineering (MLOps), DevOps, Serverless ETL\n\nObviously, now I'm back into the market as well and would love to catch some coffee with anyone. ;)\n\n\nhashtag\n#opentowork \nhashtag\n#opentoopportunities \nhashtag\n#startup \nhashtag\n#startuplife \n82\n11 comments\nPost\nPost\nFirst time getting featured by our great team!\n128\n3 comments\nPost\nPost\nUS biotech company launches ‘novel’ prenatal screening test\nfemtechworld.co.uk\n61\nLink\nLink\nSpark Summit 2020 Talk: Enabling Scalable Data Science Pipeline with Mlflow at Thermo Fisher Scientific\nSpark Summit 2020 Talk: Enabling Scalable Data Science Pipeline with Mlflow at Thermo Fisher Scientific\nDatabricks\nDatabricks\nThermo Fisher Scientific has one of the most extensive product portfolios in the industry, ranging from reagents to capital instruments across customers in biotechnology, pharmaceuticals, academic, and more. The amount of data needed to construct a comprehensive view of customer needs is massive and in order to build a data science ecosystem capable in dealing with this amount of data, each step from data engineering, model development, and delivery in the ecosystem has to be scalable.\nThermo Fisher Scientific has one of the most extensive product portfolios in the industry, ranging from reagents to capital instruments across customers in biotechnology, pharmaceuticals, academic, and more. The amount of data needed to construct a comprehensive view of customer needs is massive and in order to build a data science ecosystem capable in dealing with this amount of data, each step from data engineering, model development, and delivery in the ecosystem has to be scalable.\nActivity\nActivity\n\n1,763 followers\n1,763 followers\n\nPosts\nComments\nLoaded 9 Posts posts\nAllison Chia-Yi Wu (吳家宜)\nAllison Chia-Yi Wu (吳家宜)\n   • 1st\nVerified • 1st\nEmpowering Sustainable Startups with Cutting-Edge AI Solutions 🌍🌱| AI/ML Consultant at TerraMinds.ai | Terra.do Fellow | LLM, Gen AI, MLOps, Statistics | #OpenDoorClimate\nEmpowering Sustainable Startups with Cutting-Edge AI Solutions 🌍🌱| AI/ML Consultant at TerraMinds.ai | Terra.do Fellow | LLM, Gen AI, MLOps, Statistics | #OpenDoorClimate\n4mo • \n \n4 months ago • Visible to anyone on or off LinkedIn\nI'm currently leading the Data Science team at Nucleix, a cancer diagnostics company based in Sorrento Valley, San Diego. We are looking to hire a Bioinformatics Data Scientist to join our team, with an ideal start date before September.\n📍 Location: Hybrid (2–3 days onsite per week, San Diego)\n 🎓 Qualifications:\n – Ph.D. in a relevant field with 0–5 years of industry experience (title/level will be determined during the interview process)\n – OR Master’s degree with 3+ years of biotech industry experience\n🔍 Key Skills:\n – Machine learning and statistical modeling\n – Bioinformatics and NGS data analysis\n – Experience with cell-free DNA NGS analysis is a strong plus\nThis role is not yet publicly posted. If you or someone in your network may be a good fit, please feel free to reach out to me directly via DM. I'm happy to share more details. We'd love your help connecting with candidates passionate about building impactful technologies for early cancer detection.\n…more\n262\n18 comments\n31 reposts\nAllison Chia-Yi Wu (吳家宜)\nAllison Chia-Yi Wu (吳家宜)\n   • 1st\nVerified • 1st\nEmpowering Sustainable Startups with Cutting-Edge AI Solutions 🌍🌱| AI/ML Consultant at TerraMinds.ai | Terra.do Fellow | LLM, Gen AI, MLOps, Statistics | #OpenDoorClimate\nEmpowering Sustainable Startups with Cutting-Edge AI Solutions 🌍🌱| AI/ML Consultant at TerraMinds.ai | Terra.do Fellow | LLM, Gen AI, MLOps, Statistics | #OpenDoorClimate\n1yr • \n \n1 year ago • Visible to anyone on or off LinkedIn\nRecruiting a Senior Data Scientist, best with bioinformatics/NGS specialty! Strong experience in developing ML algorithms in the liquid biopsy realm is desired. Experience with MLOps and/or bioinformatics pipeline framework such as NextFlow or Dagster is a huge bonus.\n…more\nSenior Data Scientist\nJob by Nucleix Ltd.\nSan Diego, California, United States (Hybrid)\n\n1 connection works here\n\nView job\nView job\n54\n3 comments\n13 reposts\nShow all posts\nExperience\nExperience\nNucleix Ltd.\nNucleix Ltd.\n1 yr 10 mos\n1 yr 10 mos\nSan Diego, California, United States · Hybrid\nSan Diego, California, United States · Hybrid\nVP of Data Science\nVP of Data Science\nFull-time\nFull-time\nApr 2025 - Present · 7 mos\nApr 2025 to Present · 7 mos\nProject Planning, Project Management and +3 skills\nFractional Head of Data Science\nFractional Head of Data Science\nPart-time\nPart-time\nJan 2024 - Jun 2025 · 1 yr 6 mos\nJan 2024 to Jun 2025 · 1 yr 6 mos\n- Led the transformation of the analytics team into a highly collaborative data science team capable of training and deploying production-level machine learning models at scale.\n- Introduced and implemented modern bioinformatics and data science best practices, including Git, Docker, and Nextflow, for scalable and collaborative development.\n- Directed the machine learning model training for the Lung EpiCheck project, enhancing predictive accuracy and performance.\n- Established and fostered collaboration with the assay development team to drive data-driven assay development, improving research outcomes.\n- Led the transformation of the analytics team into a highly collaborative data science team capable of training and deploying production-level machine learning models at scale. - Introduced and implemented modern bioinformatics and data science best practices, including Git, Docker, and Nextflow, for scalable and collaborative development. - Directed the machine learning model training for the Lung EpiCheck project, enhancing predictive accuracy and performance. - Established and fostered collaboration with the assay development team to drive data-driven assay development, improving research outcomes.\nMLOps, Project Management and +1 skill\nAI/ML consultant \nAI/ML consultant \nTerraMinds.ai · Self-employed\nTerraMinds.ai · Self-employed\nDec 2023 - Present · 1 yr 11 mos\nDec 2023 to Present · 1 yr 11 mos\nSan Diego, California, United States · Remote\nSan Diego, California, United States · Remote\n- Senior AI leadership specialized for start-ups in climate tech, biotech and healthcare.\n- Deliver short-term (<6 months) end-to-end production level AI/ML solutions from algorithm development to production deployment\n- Consult on MLOps architecture, AI/ML strategic roadmapping and project scoping, data analytics\n- Senior AI leadership specialized for start-ups in climate tech, biotech and healthcare. - Deliver short-term (<6 months) end-to-end production level AI/ML solutions from algorithm development to production deployment - Consult on MLOps architecture, AI/ML strategic roadmapping and project scoping, data analytics\nLarge Language Models (LLM) and Generative AI\nHarnessing AI & DATA For a Sustainable Future\nHarnessing AI & DATA For a Sustainable Future\nFaculty Lecturer\nFaculty Lecturer\nUniversity of California, San Diego - Rady School of Management · Part-time\nUniversity of California, San Diego - Rady School of Management · Part-time\nApr 2024 - Present · 1 yr 7 mos\nApr 2024 to Present · 1 yr 7 mos\nSan Diego, California, United States · On-site\nSan Diego, California, United States · On-site\n- Supervised MSBA (Master of Business Analytics) Capstone Project, providing guidance and expertise to ensure successful project completion.\n- Instructed MSBA students in MGTA 415 (Summer 2024 & 2025) on NLP and large language models (LLMs), emphasizing interactive labs and applied group projects in prompt engineering, agentic AI, and responsible AI.\n- Supervised MSBA (Master of Business Analytics) Capstone Project, providing guidance and expertise to ensure successful project completion. - Instructed MSBA students in MGTA 415 (Summer 2024 & 2025) on NLP and large language models (LLMs), emphasizing interactive labs and applied group projects in prompt engineering, agentic AI, and responsible AI.\nData Science, University Lecturing and +1 skill\nFractional AI Tech Lead\nFractional AI Tech Lead\nContext Nature Public Benefit Corporation · Part-time\nContext Nature Public Benefit Corporation · Part-time\nDec 2023 - Aug 2025 · 1 yr 9 mos\nDec 2023 to Aug 2025 · 1 yr 9 mos\nSan Francisco Bay Area · Remote\nSan Francisco Bay Area · Remote\n- Led the development and execution of the AI strategy and AI initiatives, driving innovation and growth.\n- Utilized state-of-the-art large language models (LLM) and generative AI frameworks for nature-based compliance reporting, enhancing accuracy and efficiency.\n- Supervised and mentored junior analysts in software engineering and machine learning development, ensuring high-quality deliverables and professional growth.\n- Led the development and execution of the AI strategy and AI initiatives, driving innovation and growth. - Utilized state-of-the-art large language models (LLM) and generative AI frameworks for nature-based compliance reporting, enhancing accuracy and efficiency. - Supervised and mentored junior analysts in software engineering and machine learning development, ensuring high-quality deliverables and professional growth.\nLarge Language Models (LLM), Large Language Model Operations (LLMOps) and +1 skill\nJuno Diagnostics\nJuno Diagnostics\nFull-time · 2 yrs\nFull-time · 2 yrs\nSan Diego, California, United States\nSan Diego, California, United States\n helped me get this job\nLinkedIn helped me get this job\nHead of Data Science and Bioinformatics\nHead of Data Science and Bioinformatics\nDec 2022 - Aug 2023 · 9 mos\nDec 2022 to Aug 2023 · 9 mos\nHybrid\nHybrid\n- Led the implementation of automated pipelines and continuous algorithm improvements, resulting in significant cost and performance enhancements after product launch.\n- Successfully processed and reported out 5000+ samples in 8 months with exceptional accuracy and minimal pipeline errors, demonstrating operational efficiency and data reliability.\n- Enabled data visibility across the organization by architecting a centralized data lake with Snowflake, seamlessly combining data from multiple platforms. This empowered data-driven decision-making and fast strategic responses.\n- Optimized the ETL pipeline to Snowflake, achieving a remarkable 60% cost reduction, further demonstrating our expertise in driving cost-effective data operations.\n- Streamlined the bioinformatics pipeline and AWS S3 storage, leading to a 25% reduction in AWS costs while supporting a remarkable 20% month-to-month sample volume growth.\n- Led the implementation of automated pipelines and continuous algorithm improvements, resulting in significant cost and performance enhancements after product launch. - Successfully processed and reported out 5000+ samples in 8 months with exceptional accuracy and minimal pipeline errors, demonstrating operational efficiency and data reliability. - Enabled data visibility across the organization by architecting a centralized data lake with Snowflake, seamlessly combining data from multiple platforms. This empowered data-driven decision-making and fast strategic responses. - Optimized the ETL pipeline to Snowflake, achieving a remarkable 60% cost reduction, further demonstrating our expertise in driving cost-effective data operations. - Streamlined the bioinformatics pipeline and AWS S3 storage, leading to a 25% reduction in AWS costs while supporting a remarkable 20% month-to-month sample volume growth.\nInfrastructure as code (IaC), Research and Development (R&D) and +7 skills\nLead Data Scientist\nLead Data Scientist\nSep 2021 - Dec 2022 · 1 yr 4 mos\nSep 2021 to Dec 2022 · 1 yr 4 mos\n- Successfully built a high-performing 6-person team from scratch, recruiting and leading top talent in data science and bioinformatics.\n- Spearheaded the productionization of bioinformatics/ML pipelines for three product launches: fetal gender and two NIPS products in 2022, ensuring timely and accurate deliverables.\n- Developed novel bioinformatics and ML algorithms for at-home collections, NIPS anomaly calling, etc., contributing to the organization's innovation and technical excellence.\n- Established a robust MLops infrastructure, enabling model monitoring, reproducible ML models, and streamlined model development and deployment, ensuring efficiency and reliability throughout the production lifecycle.\n- Implemented AWS Batch, Lambda, and Step Functions, creating an entirely serverless pipeline that optimized efficiency and scalability while reducing operational overhead.\n- Utilized AWS CloudFormation to enforce infrastructure as code practices, ensuring consistent and reproducible deployments.\n- Successfully built a high-performing 6-person team from scratch, recruiting and leading top talent in data science and bioinformatics. - Spearheaded the productionization of bioinformatics/ML pipelines for three product launches: fetal gender and two NIPS products in 2022, ensuring timely and accurate deliverables. - Developed novel bioinformatics and ML algorithms for at-home collections, NIPS anomaly calling, etc., contributing to the organization's innovation and technical excellence. - Established a robust MLops infrastructure, enabling model monitoring, reproducible ML models, and streamlined model development and deployment, ensuring efficiency and reliability throughout the production lifecycle. - Implemented AWS Batch, Lambda, and Step Functions, creating an entirely serverless pipeline that optimized efficiency and scalability while reducing operational overhead. - Utilized AWS CloudFormation to enforce infrastructure as code practices, ensuring consistent and reproducible deployments.\nInfrastructure as code (IaC), Bioinformatics and +15 skills\nUS biotech company launches ‘novel’ prenatal screening test\nUS biotech company launches ‘novel’ prenatal screening test\nThe new Juno Hazel test and NIPS services which include educational resources and genetic counselling support will help the company to partner with physicians and genetic counsellors to facilitate a higher level of prenatal care.\nThe new Juno Hazel test and NIPS services which include educational resources and genetic counselling support will help the company to partner with physicians and genetic counsellors to facilitate a higher level of prenatal care.\nShow all 18 experiences\nEducation\nEducation\nTerra.do\nTerra.do\nLearning For Action Elephant Cohort\nLearning For Action Elephant Cohort\nSep 2023 - Nov 2023\nSep 2023 - Nov 2023\nLearning for Action is a 12-week climate education and solutions bootcamp that deep dives into the full climate change landscape.\nLearning for Action is a 12-week climate education and solutions bootcamp that deep dives into the full climate change landscape.\nUC San Diego\nUC San Diego\nDoctor of Philosophy (Ph.D.), Bioinformatics and Systems Biology\nDoctor of Philosophy (Ph.D.), Bioinformatics and Systems Biology\n2009 - 2015\n2009 - 2015\n- Studied gene expression variability in worm intestinal development in various Caenorhabditis speices.\n- Developed a ODE model for C. elegans skn-1 network.\n- Developed a machine learning-based algorithm for automatic image analysis. \n- Specialized in single-molecule FISH imaging and live fluorescence imaging.\n- Studied gene expression variability in worm intestinal development in various Caenorhabditis speices. - Developed a ODE model for C. elegans skn-1 network. - Developed a machine learning-based algorithm for automatic image analysis. - Specialized in single-molecule FISH imaging and live fluorescence imaging.\nShow all 3 educations\nLicenses & certifications\nLicenses & certifications\nIntroduction to Generative AI Learning Path\nIntroduction to Generative AI Learning Path\nGoogle Cloud Training Online\nGoogle Cloud Training Online\nIssued Dec 2023\nIssued Dec 2023\nShow credential\nLarge Language Models (LLM) and Artificial Intelligence (AI)\nGenerative AI with Large Language Models\nGenerative AI with Large Language Models\nGenerative AI with Large Language Models\nDeepLearning.AI, Amazon Web Services\nDeepLearning.AI, Amazon Web Services\nIssued Oct 2023\nIssued Oct 2023\nCredential ID U65V57QT4YM7\nCredential ID U65V57QT4YM7\nShow credential\nSkills\nSkills\nUniversity Lecturing\nUniversity Lecturing\nFaculty Lecturer at University of California, San Diego - Rady School of Management\nFaculty Lecturer at University of California, San Diego - Rady School of Management\nEndorse\nPublic Lectures\nPublic Lectures\nFaculty Lecturer at University of California, San Diego - Rady School of Management\nFaculty Lecturer at University of California, San Diego - Rady School of Management\nEndorse\nShow all 56 skills\nRecommendations\nRecommendations\nRecommend Allison Chia-Yi\nReceived\nReceived\nGiven\nGiven\nStephanie McClintock\nStephanie McClintock\n· 2nd\nSecond degree connection\nBrand | GTM | Demand Generation | Media Activation | Advocacy & Retention\nBrand | GTM | Demand Generation | Media Activation | Advocacy & Retention\nAugust 4, 2023, Stephanie worked with Allison Chia-Yi but on different teams\nAugust 4, 2023, Stephanie worked with Allison Chia-Yi but on different teams\nI worked alongside Allison and the Data Science team she led for two years at Juno Diagnostics, and was thoroughly impressed with her commitment and leadership abilities. \n\nAllison's poise under pressure allows her to meet tight deadlines without compromising quality or enthusiasm. Her dedication to achieving the best possible outcomes for the team and the organization is truly inspiring. Allison consistently sought ways to help her peers by implementing process efficiencies and truly going above and beyond. \n\nAs a head of function, she motivated her team and empowered them to support the marketing team and to learn new applications to data science. Their unwavering \"behind the curtains\" support contributed greatly to the marketing team's overall growth and success, although not always apparent to the rest of the organization.\nI worked alongside Allison and the Data Science team she led for two years at Juno Diagnostics, and was thoroughly impressed with her commitment and leadership abilities. Allison's poise under pressure allows her to meet tight deadlines without compromising quality or enthusiasm. Her dedication to achieving the best possible outcomes for the team and the organization is truly inspiring. Allison consistently sought ways to help her peers by implementing process efficiencies and truly going above and beyond. As a head of function, she motivated her team and empowered them to support the marketing team and to learn new applications to data science. Their unwavering \"behind the curtains\" support contributed greatly to the marketing team's overall growth and success, although not always apparent to the rest of the organization.\nSara Babakhyi\nSara Babakhyi\n· 2nd\nSecond degree connection\nAssociate Marriage and Family Therapist | Masters of Counseling Psychology |Certified Yoga Instructor |\nAssociate Marriage and Family Therapist | Masters of Counseling Psychology |Certified Yoga Instructor |\nJuly 29, 2023, Sara managed Allison Chia-Yi directly\nJuly 29, 2023, Sara managed Allison Chia-Yi directly\nI am delighted to write this glowing recommendation for Allison, who served as the exceptional Head of Data Science and Bioinformatics at Juno Diagnostics. Throughout her tenure with our company, Allison consistently demonstrated her extraordinary skills, leadership, and dedication, making her an invaluable asset to our team.\n\nAllison's expertise in data science and bioinformatics is truly remarkable. Her in-depth understanding of cutting-edge technologies and her ability to analyze complex biological data have significantly contributed to the success of numerous critical projects at Juno Diagnostics. She possesses an uncanny ability to extract meaningful insights from vast and intricate datasets, which has played a pivotal role in advancing our research and development initiatives.\n\nBeyond her technical prowess, Allison is an exceptional leader and team player. Her strong communication skills and approachable demeanor have fostered a collaborative and positive work environment. She has an innate talent for inspiring her colleagues, motivating them to perform at their best, and nurturing their professional growth. Under her guidance, the data science and bioinformatics team flourished, consistently delivering high-quality results and achieving project milestones ahead of schedule.\n\nOne of the most outstanding qualities of Allison is her unwavering commitment to excellence. She is not one to settle for mediocrity; rather, she consistently pushes herself and her team to strive for greatness. Her tireless work ethic and attention to detail have set the standard for the entire company, inspiring others to pursue excellence in their respective roles.\n\nMoreover, Allison's innovative thinking and ability to approach challenges from different angles have been instrumental in solving some of our most complex problems. Her strategic insights have played a crucial role in the development of new products and services, expanding Juno Diagnostics' offerings and positioning us as a frontrunner in the field.\n\nAside from her professional prowess, Allison is a pleasure to work with on a personal level. Her positive attitude and genuine care for her colleagues have created a warm and supportive atmosphere within the team. Her approachability and willingness to lend a helping hand have earned her the respect and admiration of everyone she interacts with.\n\nIn summary, I wholeheartedly endorse Allison for any endeavor she may pursue in the future. Her exceptional skills in data science and bioinformatics, coupled with her natural leadership abilities, make her an invaluable asset to any organization. It has been an honor and privilege to have Allison as a part of our team, and I have no doubt that she will continue to make a profound impact wherever she goes.\nI am delighted to write this glowing recommendation for Allison, who served as the exceptional Head of Data Science and Bioinformatics at Juno Diagnostics. Throughout her tenure with our company, Allison consistently demonstrated her extraordinary skills, leadership, and dedication, making her an invaluable asset to our team. Allison's expertise in data science and bioinformatics is truly remarkable. Her in-depth understanding of cutting-edge technologies and her ability to analyze complex biological data have significantly contributed to the success of numerous critical projects at Juno Diagnostics. She possesses an uncanny ability to extract meaningful insights from vast and intricate datasets, which has played a pivotal role in advancing our research and development initiatives. Beyond her technical prowess, Allison is an exceptional leader and team player. Her strong communication skills and approachable demeanor have fostered a collaborative and positive work environment. She has an innate talent for inspiring her colleagues, motivating them to perform at their best, and nurturing their professional growth. Under her guidance, the data science and bioinformatics team flourished, consistently delivering high-quality results and achieving project milestones ahead of schedule. One of the most outstanding qualities of Allison is her unwavering commitment to excellence. She is not one to settle for mediocrity; rather, she consistently pushes herself and her team to strive for greatness. Her tireless work ethic and attention to detail have set the standard for the entire company, inspiring others to pursue excellence in their respective roles. Moreover, Allison's innovative thinking and ability to approach challenges from different angles have been instrumental in solving some of our most complex problems. Her strategic insights have played a crucial role in the development of new products and services, expanding Juno Diagnostics' offerings and positioning us as a frontrunner in the field. Aside from her professional prowess, Allison is a pleasure to work with on a personal level. Her positive attitude and genuine care for her colleagues have created a warm and supportive atmosphere within the team. Her approachability and willingness to lend a helping hand have earned her the respect and admiration of everyone she interacts with. In summary, I wholeheartedly endorse Allison for any endeavor she may pursue in the future. Her exceptional skills in data science and bioinformatics, coupled with her natural leadership abilities, make her an invaluable asset to any organization. It has been an honor and privilege to have Allison as a part of our team, and I have no doubt that she will continue to make a profound impact wherever she goes.\nPublications\nPublications\nEnabling Scalable Data Science Pipeline with Mlflow at Thermo Fisher Scientific\nEnabling Scalable Data Science Pipeline with Mlflow at Thermo Fisher Scientific\nSpark Summit 2020 · Jun 26, 2020\nSpark Summit 2020 · Jun 26, 2020\nShow publication\nThermo Fisher Scientific has one of the most extensive product portfolios in the industry, ranging from reagents to capital instruments across customers in biotechnology, pharmaceuticals, academic, and more. The amount of data needed to construct a comprehensive view of customer needs is massive and in order to build a data science ecosystem capable in dealing with this amount of data, each step from data engineering, model development, and delivery in the ecosystem has to be scalable.\n\nWith scalability in mind, Thermo Fisher partnered up with Databricks to build an end-to-end data science pipeline with CI/CD standards, and further augmenting our capabilities through use of the latest technologies such as Mlflow, Spark ML, and Delta Lake. This talk is a summary of our journey from past to current state, as well as looking ahead to the future of our platform.\n\nKey takeaways:\n\nUtilizing big data for machine learning requires not just machine learning knowledge but also technical infrastructure to support continuous development, deployment and delivery for machine learning models.\nHow you can build a scalable data science pipeline with latest Databricks technologies.\nThermo Fisher Scientific has one of the most extensive product portfolios in the industry, ranging from reagents to capital instruments across customers in biotechnology, pharmaceuticals, academic, and more. The amount of data needed to construct a comprehensive view of customer needs is massive and in order to build a data science ecosystem capable in dealing with this amount of data, each step from data engineering, model development, and delivery in the ecosystem has to be scalable. With scalability in mind, Thermo Fisher partnered up with Databricks to build an end-to-end data science pipeline with CI/CD standards, and further augmenting our capabilities through use of the latest technologies such as Mlflow, Spark ML, and Delta Lake. This talk is a summary of our journey from past to current state, as well as looking ahead to the future of our platform. Key takeaways: Utilizing big data for machine learning requires not just machine learning knowledge but also technical infrastructure to support continuous development, deployment and delivery for machine learning models. How you can build a scalable data science pipeline with latest Databricks technologies.\nMED GATA factors promote robust development of the C. elegans endoderm\nMED GATA factors promote robust development of the C. elegans endoderm\nDevelopmental Biology · May 8, 2015\nDevelopmental Biology · May 8, 2015\nShow publication\nOther authors\nOther authors\n4\nShow all 4 publications\nHonors & awards\nHonors & awards\n2012 International Conference on Stochastic Processes Student Travel Award\n2012 International Conference on Stochastic Processes Student Travel Award\nIssued by 2012 International Conference on Stochastic Processes · Aug 2012\nIssued by 2012 International Conference on Stochastic Processes · Aug 2012\nAssociated with University of California, San Diego\nAssociated with University of California, San Diego\nFQRNT Merit Scholarship Program for Foreign Students (V3 - Short Term Research Fellowship)\nFQRNT Merit Scholarship Program for Foreign Students (V3 - Short Term Research Fellowship)\nIssued by Fonds de recherche du Québec · Jun 2011\nIssued by Fonds de recherche du Québec · Jun 2011\nAssociated with University of California, San Diego\nAssociated with University of California, San Diego\nThis is a 3-month short-term research fellowship (3000 CAD/month) provided by Fonds de \nrecherche du Quebec - Nature et technologies (FQRNT). With this fellowship, I performed \nyeast project, “Study of Genetics Architechture of Network Dynamics in S. cerevisiae” in \nChristian Landry Lab in the Université Laval.\nThis is a 3-month short-term research fellowship (3000 CAD/month) provided by Fonds de recherche du Quebec - Nature et technologies (FQRNT). With this fellowship, I performed yeast project, “Study of Genetics Architechture of Network Dynamics in S. cerevisiae” in Christian Landry Lab in the Université Laval.\nShow all 4 honors & awards\nLanguages\nLanguages\nEnglish\nEnglish\nJapanese\nJapanese\nShow all 3 languages\nOrganizations\nOrganizations\nSouthern California Taiwanese Biotechnology Association\nSouthern California Taiwanese Biotechnology Association\nPresident · Jul 2016 - Jul 2017\nPresident · Jul 2016 - Jul 2017\nSoCal Taiwanese Biotech Association is a non-profit organization established in 2016 by San Diego-based Taiwanese professionals in biology-related fields. As the President, my main job is to organize the annual symposium and local events to promote the local biotechnology community, provide the networking opportunity and exposure for small to medium-sized start-ups, and foster connections between large firms and small start-ups. We also strive to build a platform for experience sharing and to bridge between the local community with Taiwanese Biotechnology industry and local academic scene.\n\nThe annual symposium draws around 250 attendees, renowned speakers, VCs, government platforms from all over the states and Taiwan. \n\n\nSoCal Taiwanese Biotech Association is a non-profit organization established in 2016 by San Diego-based Taiwanese professionals in biology-related fields. As the President, my main job is to organize the annual symposium and local events to promote the local biotechnology community, provide the networking opportunity and exposure for small to medium-sized start-ups, and foster connections between large firms and small start-ups. We also strive to build a platform for experience sharing and to bridge between the local community with Taiwanese Biotechnology industry and local academic scene. The annual symposium draws around 250 attendees, renowned speakers, VCs, government platforms from all over the states and Taiwan. \n7th Asian Young Researchers Conference on Computational and Omics Biology\n7th Asian Young Researchers Conference on Computational and Omics Biology\nInternational Chair · Dec 2012 - Sep 2013\nInternational Chair · Dec 2012 - Sep 2013\nAssociated with University of California, San Diego\nAssociated with University of California, San Diego\nI continued to be involved in organizing AYRCOB in 2013 which took place in Tokyo, Japan. AYCOB has a bi-chair system that has one chair from the hosting country and another international chair from any other countries. As the international chairs and chair of program committee, I was responsible for organizing opinions of organizers from all 5 different countries, dealing with budget issue, negotiating with local committee members and arranging the conference program.\nI continued to be involved in organizing AYRCOB in 2013 which took place in Tokyo, Japan. AYCOB has a bi-chair system that has one chair from the hosting country and another international chair from any other countries. As the international chairs and chair of program committee, I was responsible for organizing opinions of organizers from all 5 different countries, dealing with budget issue, negotiating with local committee members and arranging the conference program.\nShow all 3 organizations\nInterests\nInterests\nTop Voices\nTop Voices\nCompanies\nCompanies\nGroups\nGroups\nNewsletters\nNewsletters\nSchools\nSchools\nNick Martin\nNick Martin\n· 1st\nFirst degree connection\nBridge builder | CEO @ TechChange | Prof @ Columbia | Top Voice (300K+)\nBridge builder | CEO @ TechChange | Prof @ Columbia | Top Voice (300K+)\n325,255 followers\n325,255 followers\nFollowing\nDevansh Devansh\nDevansh Devansh\n· 1st\nFirst degree connection\nChocolate Milk Cult Leader| Machine Learning Engineer| Writer | AI Researcher| | Computational Math, Data Science, Software Engineering, Computer Science\nChocolate Milk Cult Leader| Machine Learning Engineer| Writer | AI Researcher| | Computational Math, Data Science, Software Engineering, Computer Science\n13,619 followers\n13,619 followers\nFollowing\nShow all Top Voices\nMore profiles for you\nMore profiles for you\nJianhai Zhang\nJianhai Zhang\n· 3rd\nThird degree connection\nBiostatistician (clinical trials), Bioinformatician, Computational Biologist, PhD\nBiostatistician (clinical trials), Bioinformatician, Computational Biologist, PhD\nMessage\nEran Bram\nEran Bram\n· 2nd\nSecond degree connection\nVice President, Product Development at Nucleix Ltd.\nVice President, Product Development at Nucleix Ltd.\nConnect\nMathias Ehrich\nMathias Ehrich\n· 2nd\nSecond degree connection\nLife Science Executive\nLife Science Executive\nConnect\nJannet Vu, PhD\nJannet Vu, PhD\n· 2nd\nSecond degree connection\nData Scientist | Machine Learning Engineer | Applied Scientist | Project Manager | Science Communicator | Problem Solver | Naturalist\nData Scientist | Machine Learning Engineer | Applied Scientist | Project Manager | Science Communicator | Problem Solver | Naturalist\nConnect\nJimmy Wu\nJimmy Wu\n· 3rd\nThird degree connection\nSupport research projects on developing and applying technologies for deciphering genomic sequence and structure information for diverse research applications.\nSupport research projects on developing and applying technologies for deciphering genomic sequence and structure information for diverse research applications.\nMessage\nShow all\nExplore Premium profiles\nExplore Premium profiles\nMatthew Gouwens\nMatthew Gouwens\n· 3rd\nThird degree connection\nCEH (Chief Executive Hopster) / Owner at Hop Farm Brewing Company\nCEH (Chief Executive Hopster) / Owner at Hop Farm Brewing Company\nMessage\nTheresa Persico\nTheresa Persico\nTheresa Persico\n· 2nd\nSecond degree connection\nFounder/CEO at Veebit\nFounder/CEO at Veebit\nConnect\nDavid Gajda\nDavid Gajda\n· 3rd\nThird degree connection\nPresident Hollywood Media Center, LLC\nPresident Hollywood Media Center, LLC\nMessage\nPeople you may know\nPeople you may know\n\nFrom Allison Chia-Yi's school\nFrom Allison Chia-Yi's school\n\nJacqueline Hayot Ba\nJacqueline Hayot Ba\nInvestor Relations | Capital Formation | Startup Advisor | Angel Investor\nInvestor Relations | Capital Formation | Startup Advisor | Angel Investor\nConnect\nAna Alanis\nAna Alanis\nAt the intersection of climate emotions + food justice. UCLA MSW Candidate.\nAt the intersection of climate emotions + food justice. UCLA MSW Candidate.\nConnect\nDani Sangster\nDani Sangster\nScaling and Leading People Operations at Growing Startups | Remote Operations and Culture\nScaling and Leading People Operations at Growing Startups | Remote Operations and Culture\nConnect\nCarly Cohen, E.I.T., ENV SP\nCarly Cohen, E.I.T., ENV SP\nClimate + Sustainability Activist, Coordinator, and Leader | Sustainable Engineer\nClimate + Sustainability Activist, Coordinator, and Leader | Sustainable Engineer\nConnect\nGina Tryon Patino\nGina Tryon Patino\nBuilding Climate-Smart Food Systems | Regenerative Agriculture & NbS | Rural Development Project Manager | ESG Strategy\nBuilding Climate-Smart Food Systems | Regenerative Agriculture & NbS | Rural Development Project Manager | ESG Strategy\nConnect\nShow all\nYou might like\nYou might like\n\nCourses for you\nCourses for you\n\nTips to Manage Conflict\nTips to Manage Conflict\nSkills: Interpersonal Communication, Argumentation\nSkills: Interpersonal Communication, Argumentation\n32min\n32min\nSave\nBody Language Secrets for Powerful Presentations\nBody Language Secrets for Powerful Presentations\nSkills: Presentation Skills, Body Language\nSkills: Presentation Skills, Body Language\n12min\n12min\nSave\nShow all\nStatus is online\nMessaging\nYou are on the messaging overlay. Press enter to open the list of conversations.\nCompose message\nYou are on the messaging overlay. Press enter to open the list of conversations."
  }
}