{
  "url": "https://www.linkedin.com/in/celiafrancis/",
  "scraped_at": "2025-10-27T14:34:41.808597",
  "extracted": {
    "name": "Celia Francis",
    "headline": "Co-Founder and CEO of Ponterra. NED, Urban Partners. Focused on sustainable cities and nature based solutions to climate change. Co-founder, The Art of Forests. Available for public speaking.",
    "full_text": "0 notifications total\nSkip to search\nSkip to main content\nKeyboard shortcuts\nClose jump menu\nnew feed updates notifications\nHome\n1\n1 new network update notification\nMy Network\nJobs\nMessaging\n13\n13 new notifications\nNotifications\nMe\nFor Business\nAdvertise\nCelia has a {:badgeType} account\ntest\nCelia Francis \n  \n1st degree connection\n1st\nCo-Founder and CEO of Ponterra. NED, Urban Partners. Focused on sustainable cities and nature based solutions to climate change. Co-founder, The Art of Forests. Available for public speaking.\nPonterra\nMIT Sloan School of Management\nLondon Area, United Kingdom  Contact info\n6,773 followers \n500+ connections\nNeal Spackman, Eric Wilburn, and 83 other mutual connections\nNeal Spackman, Eric Wilburn, and 83 other mutual connections\nMessage\nMore\nHighlights\nHighlights\n1 mutual group\n1 mutual group\nYou and Celia are both in Climate Change / ESG Professionals Group\nYou and Celia are both in Climate Change / ESG Professionals Group\nAbout\nAbout\nCelia Francis is an experienced, purpose-driven tech CEO. Most recently, Celia was CEO of Rated People, an innovative online marketplace connecting millions of homeowners with 50,000 skilled local tradespeople across the United Kingdom to complete £3 billion of work every year. Before Rated People, Celia served as CEO of social games and networking company, WeeWorld, which entertained over 70 million users. Previous to that she grew T-Mobile’s €2 billion business focused P&L across Europe. She also enjoyed a tenure at IDEO, the world’s leading innovation consulting firm, working with a variety of top consumer products and services companies.\n \nCelia is on the board of the Nordic Real Estate Partners (NREP.com). She is also the founder of global tree ecosystem restoration alliance, The Art of Forests, which brings together the worlds top on-the-ground leaders in restoration work. She co-chairs the senior digital leadership group, H2, in London. She co-founded the tech and media female CEO group, WITSend. Celia also advises a variety of companies with a focus on sustainable urban environments and nature based solutions to climate change.\n\nPassionate about all things related to sustainable and liveable cities and nature-based solutions to climate change. A bit obsessed about the voluntary and compliance carbon markets.\n\nFrequent public speaker, I cover topics such as building and nurturing strong and happy teams, scaling businesses, and various industry specific topics. Speaker at TEDx on my CEO Super Power, Berlin Marketplaces on Radical Customer Retention.\n\nCelia is a graduate of Harvard College and Massachusetts Institute of Technology.\nCelia Francis is an experienced, purpose-driven tech CEO. Most recently, Celia was CEO of Rated People, an innovative online marketplace connecting millions of homeowners with 50,000 skilled local tradespeople across the United Kingdom to complete £3 billion of work every year. Before Rated People, Celia served as CEO of social games and networking company, WeeWorld, which entertained over 70 million users. Previous to that she grew T-Mobile’s €2 billion business focused P&L across Europe. She also enjoyed a tenure at IDEO, the world’s leading innovation consulting firm, working with a variety of top consumer products and services companies. Celia is on the board of the Nordic Real Estate Partners (NREP.com). She is also the founder of global tree ecosystem restoration alliance, The Art of Forests, which brings together the worlds top on-the-ground leaders in restoration work. She co-chairs the senior digital leadership group, H2, in London. She co-founded the tech and media female CEO group, WITSend. Celia also advises a variety of companies with a focus on sustainable urban environments and nature based solutions to climate change. Passionate about all things related to sustainable and liveable cities and nature-based solutions to climate change. A bit obsessed about the voluntary and compliance carbon markets. Frequent public speaker, I cover topics such as building and nurturing strong and happy teams, scaling businesses, and various industry specific topics. Speaker at TEDx on my CEO Super Power, Berlin Marketplaces on Radical Customer Retention. Celia is a graduate of Harvard College and Massachusetts Institute of Technology.\nFeatured\nFeatured\nPost\nPost\nThank you so much Ambssador Josefa Gonzalez Blanco Ortiz Mena for hosting this magical evening. You spoke so beautifully about Mexico’s commitment to nature and restoration. It was an honour to meet you. Ponterra Isabel Gallo Pliego Simón Torras\n9\nPost\nPost\nLast week I had the opportunity to speak at Founders Connect, part of the unlock VC Summit at STATION F in Paris, a gathering of founders and investors shaping the future of innovation.\n\nIt was a pleasure to share Ponterra’s work making nature an investable asset class by developing and operating large-scale, biodiverse reforestation projects designed for permanence, private and institutional capital, and integrity. \n\nIt was great to see so many female founders present, driving innovation across sectors from climate and health to fintech and frontier technology. The energy and ambition in the room reflected how far we’ve come, and how much potential there is ahead.\n\nThank you to Sophie Winwood, Anisah Osman Britton MBE, and Pallavi Jayashankar, and the whole Unlock team, for creating such a thoughtful space for founders and investors to connect.\n\nUmaima Malik Ahmad, Veronica Kirin, Marta Krupinska, Charlene LIN, Nicole Tingle, Alicia S., Annie Gilchrist, Alice Ivanoff-Boardman, Emily Mu, Chloe So, Katie Marsh, Friederike Edmunds, Alexa Bruce, Litzi U., Czuee Morey, Ph.D., Lauren (Ladd) Englehart, Anna Muñoz Farré\n\n74\n2 comments\nPost\nPost\nWow. So grateful for your support and kind words Haibo E.\nHow Do You Build a Forest-Restoration Project? Start by Becoming a Cattle Farmer.\nwsj.com\n4\nPost\nPost\nLast week we were thrilled to announce that Ponterra, Microsoft, Rubicon Carbon, and Carbon Streaming Corporation have closed a landmark deal to fully finance our flagship biodiversity restoration project, Ponterra's Restaura Azuero Project (ARC) in \nhashtag\n#Panama.\n\n🌲 The ARC Project will reforest 10,000 hectares (twice the size of Manhattan!) of degraded tropical forest in Panama, removing 3.24 million tonnes of CO2 by planting 6 million trees using 75 native species. \n\n🌳 In addition to the carbon sequestration, the project will bring back biodiversity (including the Azuero Spider Monkey) on land degraded by cattle ranching to one of the most important ecological regions in the world.\n\n💵 By combining upfront investment over a 30 year contract and long term offtake through 2040, we are bringing a first-of-a-kind deal to the market to prove out the \"nature carbon-as-infrastructure\" investment thesis. \n\n🔦 There is no path to preserving our planet's biodiversity or meeting the 1.5C maths without the VCM.\n\n👥 The ARC project is under validation with the new VM0047 Verra ARR standard to meet many of the ten key integrity requirements that we have heard from carbon credit buyers (more about these ten in future posts). \n\n📈 Verra has selected the Project to participate in its new Sustainable Development Verified Impact Standard (SD VISta) Nature Framework program.\n\n🌳The ARC project will leave over $70M with the Azuero community over the next 30 years.\n\nGratitude for the people who made this dream a reality:\n\n🙏 Our fantastic partners at Microsoft, Rubicon, and Carbon Streaming who have been unwavering in their support of Ponterra.\n\n🌳 The Pro Eco Azuero team who teach kids in the region about the importance of forests for the animals and plants of the region to thrive. Edwina von Gal\n\n🙏 Ponterra Ltd. seed investors \n\n💵 The team that made this deal possible: Leigh Madeira, CFA, Simón Torras, Andrew Coates, Christopher Brown, Annie Guo, Steph Harris, Justin Cochrane, Brent Sawkins, Erin Horleman, Michael Dreibelbis, Jim Lambert Jill Brachhausen Orhun Anthony Zabiegalski, PMP, CSPO, CSM, MSOL, Alexandre Lefebvre, Ana De Lucia \n\n\nhashtag\n#climatechange \nhashtag\n#reforestation\n\nAnd in particular thanks to the many members of The Art of Forests who support each other every day to grow and thrive in a spirit of friendship and reciprocity. \n\n💫 🌱 🌎 \nAzuero Reforestation Project Announcement\n95\n16 comments\nPost\nPost\nThanks Margaret Morales for writing this great piece in Trellis Group\nabout the Ponterra ARC project. We really appreciate how much time you took to interview our project investors, Microsoft, Rubicon Carbon, and Carbon Streaming Corporation Streaming, and get the details about the on-the-ground Ponterra field operations correct.\n\nhttps://lnkd.in/ejyz4CHB\nInside Microsoft’s Panama tropical forest carbon offtake deal | GreenBiz\ngreenbiz.com\n39\n3 comments\nExperience\nExperience\nCEO and Co-Founder\nCEO and Co-Founder\nPonterra · Full-time\nPonterra · Full-time\nMar 2023 - Present · 2 yrs 8 mos\nMar 2023 to Present · 2 yrs 8 mos\nHybrid\nHybrid\nNon Executive Director\nNon Executive Director\nUrban Partners · Part-time\nUrban Partners · Part-time\nApr 2021 - Present · 4 yrs 7 mos\nApr 2021 to Present · 4 yrs 7 mos\nLondon, England, United Kingdom\nLondon, England, United Kingdom\nAdvisor\nAdvisor\nRhizocore Technologies · Part-time\nRhizocore Technologies · Part-time\nFeb 2021 - Present · 4 yrs 9 mos\nFeb 2021 to Present · 4 yrs 9 mos\nLondon, England, United Kingdom\nLondon, England, United Kingdom\nChief Commercial Officer\nChief Commercial Officer\nEarthshot Labs · Full-time\nEarthshot Labs · Full-time\nAug 2022 - Mar 2023 · 8 mos\nAug 2022 to Mar 2023 · 8 mos\nLondon, England, United Kingdom\nLondon, England, United Kingdom\nConsultant, Advisor. Coach\nConsultant, Advisor. Coach\nConsultant, Advisor. Coach\nVarious\nVarious\nNov 2014 - Feb 2023 · 8 yrs 4 mos\nNov 2014 to Feb 2023 · 8 yrs 4 mos\nCoach or advisor on commercial and fundraising strategy, marketing, product market fit, scaling, team building, leadership, and personal development. \n\n* Coach to Founder, Visibly (training the next generation of infrastructure installation engineers)\n* Consultant, Stealth deep tech business (cyber security/Quantum/AI)\n* Consultant to various PE firm\n* Angel investor, Meal for the NHS\nCoach or advisor on commercial and fundraising strategy, marketing, product market fit, scaling, team building, leadership, and personal development. * Coach to Founder, Visibly (training the next generation of infrastructure installation engineers) * Consultant, Stealth deep tech business (cyber security/Quantum/AI) * Consultant to various PE firm * Angel investor, Meal for the NHS\nShow all 17 experiences\nEducation\nEducation\nMIT Sloan School of Management\nMIT Sloan School of Management\nMBA, Product Development\nMBA, Product Development\nHarvard University\nHarvard University\nBA, History and Literature\nBA, History and Literature\nActivities and societies: Hasty Pudding Club, The Advocate, Harvard Crimson, Photography\nActivities and societies: Hasty Pudding Club, The Advocate, Harvard Crimson, Photography\nShow all 3 educations\nVolunteering\nVolunteering\nCo-Founder\nCo-Founder\nCo-Founder\nWITs END Network (www.witsendnetwork.com)\nWITs END Network (www.witsendnetwork.com)\nNov 2016 - Present · 9 yrs\nNov 2016 - Present · 9 yrs\nEncouraging women to aim high and keep going\n\nWITs END’s mission is to inspire and support women – in tech companies but also more generally - to aspire to more senior roles, to run companies or start-up companies and be a bigger part of the future. And then to keep going.\n\nhttps://www.witsend.online/about\nEncouraging women to aim high and keep going WITs END’s mission is to inspire and support women – in tech companies but also more generally - to aspire to more senior roles, to run companies or start-up companies and be a bigger part of the future. And then to keep going. https://www.witsend.online/about\nCo-Founder\nCo-Founder\nThe Art of Forests\nThe Art of Forests\nNov 2019 - Present · 6 yrs\nNov 2019 - Present · 6 yrs\nEnvironment\nEnvironment\nThe Art of Forests was founded in 2019 to bring together some of the world’s largest ecosystem restoration organisations in a loose coalition to share knowledge and best practices, and to create a supportive community. We are committed to helping each other scale our ecosystem restoration projects so that both people and the planet thrive.\nThe Art of Forests was founded in 2019 to bring together some of the world’s largest ecosystem restoration organisations in a loose coalition to share knowledge and best practices, and to create a supportive community. We are committed to helping each other scale our ecosystem restoration projects so that both people and the planet thrive.\nShow all 4 volunteer experiences\nHonors & awards\nHonors & awards\nMost Inspiring Board Member\nMost Inspiring Board Member\nIssued by 10 Digital Ladies · Apr 2018\nIssued by 10 Digital Ladies · Apr 2018\nAssociated with Rated People\nAssociated with Rated People\nThe Most Inspiring Board Member Award, which celebrates a female executive or non-executive board member who is a leading light, not just within her business, but also her sector was won by Celia Francis, CEO at Rated People. \n\nThe judges said, “Celia has done amazing work in re-energising Rated People. She has a mission to help drive the economy by creating work, and has also essentially created a UK wide tradesmen trust mark. She regularly speaks at industry events and talks passionately about getting more people into well-paid, skilled and satisfying work, including young people and apprentices.”\nThe Most Inspiring Board Member Award, which celebrates a female executive or non-executive board member who is a leading light, not just within her business, but also her sector was won by Celia Francis, CEO at Rated People. The judges said, “Celia has done amazing work in re-energising Rated People. She has a mission to help drive the economy by creating work, and has also essentially created a UK wide tradesmen trust mark. She regularly speaks at industry events and talks passionately about getting more people into well-paid, skilled and satisfying work, including young people and apprentices.”\nLanguages\nLanguages\nEnglish\nEnglish\nNative or bilingual proficiency\nNative or bilingual proficiency\nFrench\nFrench\nProfessional working proficiency\nProfessional working proficiency\nShow all 4 languages\nCauses\nCauses\nEducation • Environment • Human Rights\nEducation • Environment • Human Rights\nMore profiles for you\nMore profiles for you\nRikke Rosenlund\nRikke Rosenlund\n· 2nd\nSecond degree connection\nFounder & CEO, BorrowMyDoggy | Speaker\nFounder & CEO, BorrowMyDoggy | Speaker\nFollow\nAriane Gorin\nAriane Gorin\n· 2nd\nSecond degree connection\nChief Executive Officer at Expedia Group\nChief Executive Officer at Expedia Group\nFollow\nAndrew Coates\nAndrew Coates\n· 2nd\nSecond degree connection\nCo-Founder, Partner, Director of Operations.\nCo-Founder, Partner, Director of Operations.\nConnect\nTamara Lohan MBE\nTamara Lohan MBE\n· 2nd\nSecond degree connection\nFounder & Chair, Mr & Mrs Smith, a certified B Corp\nFounder & Chair, Mr & Mrs Smith, a certified B Corp\nFollow\nSimón Torras\nSimón Torras\n· 1st\nFirst degree connection\nCo-Founder & Head of Project Development at Ponterra\nCo-Founder & Head of Project Development at Ponterra\nMessage\nShow all\nExplore Premium profiles\nExplore Premium profiles\nJuan Camilo Sanchez\nJuan Camilo Sanchez\n· 3rd\nThird degree connection\nFounder & CEO, Orphiq\nFounder & CEO, Orphiq\nMessage\nJoshua Ferrazzano\nJoshua Ferrazzano\n· 3rd\nThird degree connection\nCo-Founder / Managing Partner at World War Seven\nCo-Founder / Managing Partner at World War Seven\nMessage\nM Vincent Miller\nM Vincent Miller\n· 2nd\nSecond degree connection\nbuilding before buzzwords\nbuilding before buzzwords\nFollow\nMatthew Gouwens\nMatthew Gouwens\n· 3rd\nThird degree connection\nCEH (Chief Executive Hopster) / Owner at Hop Farm Brewing Company\nCEH (Chief Executive Hopster) / Owner at Hop Farm Brewing Company\nMessage\nPeople you may know\nPeople you may know\n\nFrom Celia's company\nFrom Celia's company\n\nEmma Dunne\nEmma Dunne\nMSc Biodiversity, Ecology, Environment - Ecological Engineering and Conservation\nMSc Biodiversity, Ecology, Environment - Ecological Engineering and Conservation\nConnect\nLeigh Madeira, CFA\nLeigh Madeira, CFA\nConnecting Finance to Forests || Co-Founder and Head of Investments at Ponterra\nConnecting Finance to Forests || Co-Founder and Head of Investments at Ponterra\nConnect\nJason Arlen Clark, PhD\nJason Arlen Clark, PhD\nNature-based Solutions, Forest Restoration, Carbon Sequestration\nNature-based Solutions, Forest Restoration, Carbon Sequestration\nConnect\nHubert Szczygieł\nHubert Szczygieł\nNaturalist\nNaturalist\nConnect\nAndrew Coates\nAndrew Coates\nCo-Founder, Partner, Director of Operations.\nCo-Founder, Partner, Director of Operations.\nConnect\nShow all\nYou might like\nYou might like\n\nGroups for you\nGroups for you\n\nCorporate Social Responsibility (CSR) Leaders\nCorporate Social Responsibility (CSR) Leaders\n33,292 members\n33,292 members\nJoin\nJoin Corporate Social Responsibility (CSR) Leaders group\nThe Emotional Intelligence Network\nThe Emotional Intelligence Network\n1,043,658 members\n1,043,658 members\nJoin\nJoin The Emotional Intelligence Network group\nShow all\nMessaging\nYou are on the messaging overlay. Press enter to open the list of conversations.\nCompose message\nYou are on the messaging overlay. Press enter to open the list of conversations."
  }
}