{
  "url": "https://www.linkedin.com/in/emmanuel-rengade-%F0%9F%8C%8E-9712441/",
  "scraped_at": "2025-10-27T14:35:02.659087",
  "extracted": {
    "name": "Emmanuel Rengade 🌎",
    "headline": "Founder at WeAreNature.com | Regenerative Hideaways in Brazil | Steward of the Earth | Ancestral Wisdom | Universal Citizen",
    "full_text": "0 notifications total\nSkip to search\nSkip to main content\nKeyboard shortcuts\nClose jump menu\nnew feed updates notifications\nHome\n1\n1 new network update notification\nMy Network\nJobs\nMessaging\n13\n13 new notifications\nNotifications\nMe\nFor Business\nAdvertise\ntest\nEmmanuel Rengade 🌎\n  \n1st degree connection\n1st\nFounder at WeAreNature.com | Regenerative Hideaways in Brazil | Steward of the Earth | Ancestral Wisdom | Universal Citizen\nFazenda Catucaba, Brazil\nINSEAD\nSão Paulo, Brazil  Contact info\n WeAreNature.com \n1,477 followers \n500+ connections\nDr. Stuart Cowan, Barbara Lima, and 26 other mutual connections\nDr. Stuart Cowan, Barbara Lima, and 26 other mutual connections\nMessage\nMore\nHighlights\nHighlights\n2 mutual groups\n2 mutual groups\nYou and Emmanuel are both in Climate Change / ESG Professionals Group and Brain Expansion Group\nYou and Emmanuel are both in Climate Change / ESG Professionals Group and Brain Expansion Group\nAbout\nAbout\nA global perspective shaped by living and working in six countries—from main urban centers to remote traditional villages. \n\nMy journey is anchored in a deep relationship with nature, focusing on regeneration, connection, and healing.\n\nAt the heart of my work for the past 20 years are two unique sanctuaries—Picinguaba and Catuçaba—dedicated to the regeneration of humans and nature, combining eco-architecture, integral health, and sustainable living. \n\nI am committed to creating environments that foster deep reconnection between humans and the Earth. Through WeAreNature, my work is grounded in Earth-based principles, prioritizing traditional living and long-term impact.\n\n---\n\nKey Experiences & Initiatives\n\n- Nature-Based Hospitality: Picinguaba and Catuçaba exemplify nature-to-table food, permaculture, land regeneration, and advanced sustainable practices, inspiring consciousness evolution and personal transformation. \n- Remote Sacred Sites Specialist: I’ve traveled across the five continents for the past 3 decades, learning from indigenous guardians and ancient Earth-based traditions that shape meaningful decisions and connections with the land and the planet.\n- Global Network: I established the WAN group, a confidential network of benevolent individuals across major global capitals, aligned by shared elevated values and committed to humanity evolution. \n- Long-Term Vision : Over 20 years of practical experience I have framed a scalable model for deep reconnection, sustainability, and healing, which I am dedicated to further developing and expanding.\n\n---\n\nCore Values & Purpose\n\n- Human Evolution from Within: humanity’s evolution begins with the individual. Lasting collective change requires dedicated places where people can slow down, reconnect with themselves, and engage deeply with the natural world.\n- Unity Through Nature : Earth is just an h away from Heart: our shared Earth is what connects us. By embracing our commonalities through nature, we can foster reconciliation and harmony. There is a space to be beyond ecology. We are like leaves of the same tree, breathing the same air and powered by the same life-force.\n\n---\n\nThrough WeAreNature, my mission is to blend ancient wisdom with practical approaches to create sustainable models for the future. I aim to inspire meaningful change by bringing together people and places, fostering deep reconnection with the Earth and a conscious, joyful way of living.\n\n---\nA global perspective shaped by living and working in six countries—from main urban centers to remote traditional villages. My journey is anchored in a deep relationship with nature, focusing on regeneration, connection, and healing. At the heart of my work for the past 20 years are two unique sanctuaries—Picinguaba and Catuçaba—dedicated to the regeneration of humans and nature, combining eco-architecture, integral health, and sustainable living. I am committed to creating environments that foster deep reconnection between humans and the Earth. Through WeAreNature, my work is grounded in Earth-based principles, prioritizing traditional living and long-term impact. --- Key Experiences & Initiatives - Nature-Based Hospitality: Picinguaba and Catuçaba exemplify nature-to-table food, permaculture, land regeneration, and advanced sustainable practices, inspiring consciousness evolution and personal transformation. - Remote Sacred Sites Specialist: I’ve traveled across the five continents for the past 3 decades, learning from indigenous guardians and ancient Earth-based traditions that shape meaningful decisions and connections with the land and the planet. - Global Network: I established the WAN group, a confidential network of benevolent individuals across major global capitals, aligned by shared elevated values and committed to humanity evolution. - Long-Term Vision : Over 20 years of practical experience I have framed a scalable model for deep reconnection, sustainability, and healing, which I am dedicated to further developing and expanding. --- Core Values & Purpose - Human Evolution from Within: humanity’s evolution begins with the individual. Lasting collective change requires dedicated places where people can slow down, reconnect with themselves, and engage deeply with the natural world. - Unity Through Nature : Earth is just an h away from Heart: our shared Earth is what connects us. By embracing our commonalities through nature, we can foster reconciliation and harmony. There is a space to be beyond ecology. We are like leaves of the same tree, breathing the same air and powered by the same life-force. --- Through WeAreNature, my mission is to blend ancient wisdom with practical approaches to create sustainable models for the future. I aim to inspire meaningful change by bringing together people and places, fostering deep reconnection with the Earth and a conscious, joyful way of living. ---\nFeatured\nFeatured\nLink\nLink\n#57 Emmanuel Rengade : Créer des Oasis, ces lieux pour vivre en paix\n#57 Emmanuel Rengade : Créer des Oasis, ces lieux pour vivre en paix\nYouTube\nYouTube\nAnne Ghesquière reçoit Emmanuel Rengade créateur de deux hôtels-oasis au Brésil, des éco-lieux où il fait bon vivre en paix et en harmonie avec le vivant. Da...\nAnne Ghesquière reçoit Emmanuel Rengade créateur de deux hôtels-oasis au Brésil, des éco-lieux où il fait bon vivre en paix et en harmonie avec le vivant. Da...\nLink\nLink\nTV CASA BRASILEIRA - GNT - 2015\nTV CASA BRASILEIRA - GNT - 2015\nVimeo\nVimeo\nPrograma Casa Brasileira\nPrograma Casa Brasileira\nLink\nLink\nFAZENDA CATUCABA ON TV5 - 2017 - English subtitles.\nFAZENDA CATUCABA ON TV5 - 2017 - English subtitles.\nVimeo\nVimeo\nHere is the Fazenda Catuçaba project as presented by the leading French architecture show, \"La Maison France 5\". Emmanuel Rengade, the owner, leads us to the Fazenda\nHere is the Fazenda Catuçaba project as presented by the leading French architecture show, \"La Maison France 5\". Emmanuel Rengade, the owner, leads us to the Fazenda\nActivity\nActivity\n\n1,477 followers\n1,477 followers\n\nFollowing\nPosts\nComments\nImages\nLoaded 9 Posts posts\nEmmanuel Rengade 🌎\nEmmanuel Rengade 🌎\n • 1st\n1st\nFounder at WeAreNature.com | Regenerative Hideaways in Brazil | Steward of the Earth | Ancestral Wisdom | Universal Citizen\nFounder at WeAreNature.com | Regenerative Hideaways in Brazil | Steward of the Earth | Ancestral Wisdom | Universal Citizen\n1w • \n \n1 week ago • Visible to anyone on or off LinkedIn\nBEYOND ECOLOGY\n\nThe ecological movement, once at the center of our collective consciousness, seems to be losing momentum. And perhaps that’s not such a bad thing. Perhaps there's another, better way.\n\nIt was always hard to believe anyway that it could truly “win.” That the well-intentioned few could sway the unconscious majority. Eventually, what seemed like good ideas—planting trees, electric cars, renewable energy—wasn’t really working at the end: most trees don’t survive if you don’t nurture them, electric cars create another issues with batteries, etc. Ecological change seemed more intentional and peripheral than real. \n\nAt some point, we must admit that the narrative became frustrating—heavy with guilt, tinged with hopelessness, and dominated by the language of fear. A vision of the future defined not by possibility, but by “points of no return.” \n\nBut if we believe our thoughts shape our reality—why are we continuing to create this one? \n\nIt may be time for a different approach. Not a war between “good ecologists” and “bad polluters”. Not guilt or blame, but collective responsibility. We can elevate ourselves and see from a wiser perspective. \n\nA new path is emerging—one that reconciles ecological awareness with deeper truths about healing, oneness, and our shared humanity.\n\n We can make the choice to responsibly self-actualize our ecological opinions to something more joyful and real, and that can bring true change.\n \nAncient and indigenous wisdom traditions have pointed to this all along: The Earth’s collapse mirrors the collapse of the human spirit. \n\nOur thoughts are creative forces. They can lead to destruction—or harmony. If we truly want to heal the Earth, we must first heal what we’ve lost within ourselves.\n\nThat means reconnecting with values that are not only humanistic, but spiritual. It suggests that ecology, as central and essential as it may have seemed to us, might in fact be just a path toward a deeper rediscovery: our connection with the Earth. Or shall we say to be more precise: our love for the Earth, and the love of the Earth for us.\n\nAnd this is good news, because love speaks higher than any ism.\nBeyond ideology. Beyond partisanship. Rooted in truth, simplicity, and presence. \n\nWhen we stop projecting blame and instead turn inward, we connect with something essential and inexpressable with words and mind. Unity. Coherence. \n\nEcology is but a path to Love: let’s really cross that bridge.\n\nAnd from there, right action emerges—not as obligation, but as a natural flow.\n\nIt’s time to go deeper into nature. Not just physically—but consciously.\n With openness. With humility. With the courage to change the way we see the world.\n…more\nActivate to view larger image,\nActivate to view larger image,\n4\n2 comments\nEmmanuel Rengade 🌎 reposted this\nThais Corral\nThais Corral\n • 2nd\n2nd\nFounder and Director, Instituto Sinal do Vale. Co-chair advisory council UN Decade for Ecosystems Restoration\nFounder and Director, Instituto Sinal do Vale. Co-chair advisory council UN Decade for Ecosystems Restoration\n3mo • \n \n3 months ago • Visible to anyone on or off LinkedIn\nLugares que Curam, Inspiram e Regeneram! \n\nNa semana passada, visitei dois lugares extraordinários: Catuçaba e Picinguaba – We Are Nature. Ambos me tocaram profundamente pela sua beleza, coerência e propósito. Assim como o SINAL do Vale, são muito mais do que hospedagens ou empreendimentos. São territórios vivos — lugares que acolhem, regeneram e mostram um outro caminho possível para o nosso futuro coletivo.\n\nVivemos tempos em que a reconexão com a natureza não é mais um luxo, mas uma necessidade vital. Como tão bem expõe o artigo da iniciativa We Are Nature — “7 reasons why we need places in nature” — esses espaços:\nrestauram nossa saúde física e emocional,\nresgatam a sabedoria do tempo natural,\ninspiram novas formas de viver, produzir e liderar.\nLugares como Catuçaba, Picinguaba e SINAL do Vale são sementes de um futuro regenerativo. Eles nos lembram que é possível viver em harmonia com a Terra, gerar impacto positivo e ao mesmo tempo criar experiências transformadoras para pessoas, comunidades e organizações. Precisamos fortalecer essa rede de territórios regenerativos — conectando práticas, saberes, soluções e narrativas. Eles são pontos de transição entre o modelo que está colapsando e o mundo que queremos construir.\n\nMais do que nunca, o planeta precisa de lugares assim. E nós também. 🌿\n\nPlaces that Heal, Inspire and Regenerate! \nLast week, I had the joy of visiting two extraordinary places: Catuçaba and Picinguaba – We Are Nature. Both touched me deeply — not only for their natural beauty, but for the coherence and purpose that permeate every detail. Like SINAL do Vale, these are not just hospitality ventures. They are living sanctuaries — places that welcome, regenerate, and show us another possible path for our shared future.\nIn our times, reconnection with nature is no longer a luxury — it is a vital need. As beautifully expressed in We Are Nature's article “7 reasons why we need places in nature”, these spaces:\nrestore our physical and emotional well-being,\nreconnect us with the wisdom of natural time,\ninspire new ways of living, producing, and leading.\nPlaces like Catuçaba, Picinguaba, and SINAL do Vale are seeds of a regenerative future. They remind us that it is possible to live in harmony with the Earth, generate positive impact, and create meaningful, transformative experiences for people, communities, and organizations.\n🌍 Now is the time to strengthen this network of regenerative territories — to connect practices, knowledge, solutions, and stories. These places are not isolated experiments: they are gateways between a collapsing system and the world we know is possible.\nMore than ever, the planet needs places like these. And so do we.\n…more\nActivate to view larger image,\nActivate to view larger image,\n46\n3 comments\n1 repost\nShow all posts\nExperience\nExperience\nFounder\nFounder\nFounder\nFazenda Catucaba, Brazil\nFazenda Catucaba, Brazil\nDec 2008 - Present · 16 yrs 11 mos\nDec 2008 to Present · 16 yrs 11 mos\nSao Paulo\nSao Paulo\nFazenda Catuçaba is a laboratory where a number of achievements were accomplished over the past few years, including the first Platinum LEED certified eco-house in South America, the first Oca (Indian House) built by indigenous people outside the Amazon, the fist Art Gallery away from the cities in Brazil, all landmark structures for new times that are being used for workshops, exhibitions, events, and direct experience of a new way of living. \n\nOur work involves getting back to the origins. The origin of hospitality, experiencing true kindness. The origin of food, living healthily. The origin of architecture, being in tune with our environment. The origin of Art, reaching to the invisible. The origin of education, freeing the soul. The origin of spirituality, returning to Nature.\nFazenda Catuçaba is a laboratory where a number of achievements were accomplished over the past few years, including the first Platinum LEED certified eco-house in South America, the first Oca (Indian House) built by indigenous people outside the Amazon, the fist Art Gallery away from the cities in Brazil, all landmark structures for new times that are being used for workshops, exhibitions, events, and direct experience of a new way of living. Our work involves getting back to the origins. The origin of hospitality, experiencing true kindness. The origin of food, living healthily. The origin of architecture, being in tune with our environment. The origin of Art, reaching to the invisible. The origin of education, freeing the soul. The origin of spirituality, returning to Nature.\nArchitecture, Leadership and +1 skill\nFounder\nFounder\nFounder\nPousada Picinguaba\nPousada Picinguaba\nMar 2001 - Present · 24 yrs 8 mos\nMar 2001 to Present · 24 yrs 8 mos\nPousada Picinguaba is a small, ecological, understated hotel based on beautiful nature and beautiful people, located in the fishing village of Picinguaba. Pousada Picinguaba was quoted by the Financial Times in 2002 as “the first boutique hotel of Brazil”.\n\nEntirely run by local people, the Pousada is set in one of the most beautiful stretch of the Brazilian Coastline, between Rio and Sao Paulo, in the middle of a Natural Park.\n\nPousada Picinguaba is a small, ecological, understated hotel based on beautiful nature and beautiful people, located in the fishing village of Picinguaba. Pousada Picinguaba was quoted by the Financial Times in 2002 as “the first boutique hotel of Brazil”. Entirely run by local people, the Pousada is set in one of the most beautiful stretch of the Brazilian Coastline, between Rio and Sao Paulo, in the middle of a Natural Park. \nEntrepreneurship Development\nThe Perfect Barefoot-Luxury Brazilian Beach Hotel: Pousada Picinguaba\nThe Perfect Barefoot-Luxury Brazilian Beach Hotel: Pousada Picinguaba\nHere are a few things Pousada Picinguaba does not have: what you want to eat whenever you want to eat it (let alone room service), air conditioning that's run as a matter of course, televisions, concierges, minibars, internet or a signal that most American mobile phones can pick up, a boutique, a road that gets you anywhere near the front door.\nHere are a few things Pousada Picinguaba does not have: what you want to eat whenever you want to eat it (let alone room service), air conditioning that's run as a matter of course, televisions, concierges, minibars, internet or a signal that most American mobile phones can pick up, a boutique, a road that gets you anywhere near the front door.\nFounder\nFounder\nFounder\nAPIS - Acao Picinguaba Sustentavel\nAPIS - Acao Picinguaba Sustentavel\nMar 2006 - Jun 2009 · 3 yrs 4 mos\nMar 2006 to Jun 2009 · 3 yrs 4 mos\nPicinguaba, SP, Brazil\nPicinguaba, SP, Brazil\nThis NGO was created with the objective to help protecting the amazing nature and culture of the village of Picinguaba, through direct action and notably through education to the environment within the local community.\nThis NGO was created with the objective to help protecting the amazing nature and culture of the village of Picinguaba, through direct action and notably through education to the environment within the local community.\nEnron logo\nDirector\nDirector\nEnron\nEnron\n1997 - 2001 · 4 yrs\n1997 to 2001 · 4 yrs\nCooperation\nCooperation\nBNP Paribas\nBNP Paribas\nJan 1995 - Jul 1996 · 1 yr 7 mos\nJan 1995 to Jul 1996 · 1 yr 7 mos\nEducation\nEducation\nINSEAD\nINSEAD\nExecutive Classes\nExecutive Classes\n1999 - 2000\n1999 - 2000\nNEOMA Business School\nNEOMA Business School\n1992 - 1994\n1992 - 1994\nShow all 4 educations\nSkills\nSkills\nArchitecture\nArchitecture\nFounder at Fazenda Catucaba, Brazil\nFounder at Fazenda Catucaba, Brazil\n1 endorsement\n1 endorsement\nEndorse\nEntrepreneurial Organizations\nEntrepreneurial Organizations\nFounder at Fazenda Catucaba, Brazil\nFounder at Fazenda Catucaba, Brazil\n1 endorsement\n1 endorsement\nEndorse\nShow all 30 skills\nRecommendations\nRecommendations\nRecommend Emmanuel\nReceived\nReceived\nGiven\nGiven\nCarina Martins\nCarina Martins\n· 2nd\nSecond degree connection\nOps Excellence at Pets at Home\nOps Excellence at Pets at Home\nOctober 13, 2014, Carina reported directly to Emmanuel\nOctober 13, 2014, Carina reported directly to Emmanuel\nEmmanuel is the most inspirational leader I've ever had, remaining on of the most important professional influences in my career to this date. He holds a rare quality of standing true to his beliefs, carrying his vision and values throughout all his businesses and truly engaging his entire team towards a visionary future. I remain a fan and a spokeswoman of all his hotels.\nEmmanuel is the most inspirational leader I've ever had, remaining on of the most important professional influences in my career to this date. He holds a rare quality of standing true to his beliefs, carrying his vision and values throughout all his businesses and truly engaging his entire team towards a visionary future. I remain a fan and a spokeswoman of all his hotels.\nMarco Kerkmeester\nMarco Kerkmeester\n· 2nd\nSecond degree connection\nCo Fundador, Santo Grao\nCo Fundador, Santo Grao\nOctober 10, 2013, Marco worked with Emmanuel but they were at different companies\nOctober 10, 2013, Marco worked with Emmanuel but they were at different companies\nEmmanuel is an inspiration and a visionary. But vision without execution is hot air. Manu has executed his vision at both Picinguaba and Catuçaba creating environments against all odds in which I would like to be sustained. \n \nThere is a tribe of Indians in Brasil that do not say \"I like you\". They say \" I like me when I am with you\". Manu, I like me when I am with you.\nEmmanuel is an inspiration and a visionary. But vision without execution is hot air. Manu has executed his vision at both Picinguaba and Catuçaba creating environments against all odds in which I would like to be sustained. There is a tribe of Indians in Brasil that do not say \"I like you\". They say \" I like me when I am with you\". Manu, I like me when I am with you.\nShow all 4 received\nLanguages\nLanguages\nEnglish\nEnglish\nFrench\nFrench\nShow all 4 languages\nInterests\nInterests\nTop Voices\nTop Voices\nCompanies\nCompanies\nGroups\nGroups\nNewsletters\nNewsletters\nSchools\nSchools\nMaxime Blondeau\nMaxime Blondeau\n· 2nd\nSecond degree connection\nCosmographe, auteur, entrepreneur. Un nouveau regard sur le territoire. Pour une collaboration - contactez myriam@cosmorama.fr\nCosmographe, auteur, entrepreneur. Un nouveau regard sur le territoire. Pour une collaboration - contactez myriam@cosmorama.fr\n197,152 followers\n197,152 followers\nFollow\nNicolas Hazard\nNicolas Hazard\n· 2nd\nSecond degree connection\nFounder at INCO/ Special Advisor at European Commission\nFounder at INCO/ Special Advisor at European Commission\n19,325 followers\n19,325 followers\nFollow\nShow all Top Voices\nMore profiles for you\nMore profiles for you\nCharlotte Lépany 🌈\nCharlotte Lépany 🌈\n· 3rd\nThird degree connection\n#QVEMA 5 📺 | DG La Tribu Happy Kids | Prévenir les maux pour vivre en santé | Expertise médecine préventive | Kreatif Bordelik \n#QVEMA 5 📺 | DG La Tribu Happy Kids | Prévenir les maux pour vivre en santé | Expertise médecine préventive | Kreatif Bordelik \nFollow\nRizwana Ilham\nRizwana Ilham\n· 2nd\nSecond degree connection\nChairwoman at Swiss Uyghur Association | Director of Youth Committee WUC | Office Management\nChairwoman at Swiss Uyghur Association | Director of Youth Committee WUC | Office Management\nConnect\nCorinne BRENNE\nCorinne BRENNE\n· 2nd\nSecond degree connection\nFondateur chez Terre d'Accord\nFondateur chez Terre d'Accord\nConnect\nMary Cristine\nMary Cristine\n· 2nd\nSecond degree connection\n4X Founder @Be That Life, Beat That Dish, Beyond Self Retreats | Award-Winning Gut Health Expert | Influential Speaker with a Global Footprint | Host of Be That Life Experience | Creator of Rewrite Your Gut Code \n4X Founder @Be That Life, Beat That Dish, Beyond Self Retreats | Award-Winning Gut Health Expert | Influential Speaker with a Global Footprint | Host of Be That Life Experience | Creator of Rewrite Your Gut Code \nFollow\nBritt Basel\nBritt Basel\n· 2nd\nSecond degree connection\nBridging critical social science and anthropology with technical expertise in environmental science and natural resource management\nBridging critical social science and anthropology with technical expertise in environmental science and natural resource management\nConnect\nShow all\nExplore Premium profiles\nExplore Premium profiles\nMatthew Gouwens\nMatthew Gouwens\n· 3rd\nThird degree connection\nCEH (Chief Executive Hopster) / Owner at Hop Farm Brewing Company\nCEH (Chief Executive Hopster) / Owner at Hop Farm Brewing Company\nMessage\nPatrick McKeague\nPatrick McKeague\nPatrick McKeague\n· 3rd\nThird degree connection\nFounder and Product Manager at XYZ Homework Founder and Publisher at Varsity Learning\nFounder and Product Manager at XYZ Homework Founder and Publisher at Varsity Learning\nMessage\nJuan Camilo Sanchez\nJuan Camilo Sanchez\n· 3rd\nThird degree connection\nFounder & CEO, Orphiq\nFounder & CEO, Orphiq\nMessage\nJoshua Ferrazzano\nJoshua Ferrazzano\n· 3rd\nThird degree connection\nCo-Founder / Managing Partner at World War Seven\nCo-Founder / Managing Partner at World War Seven\nMessage\nPeople you may know\nPeople you may know\n\nFrom Emmanuel's school\nFrom Emmanuel's school\n\nFernando Russo\nFernando Russo\nRegenerative Food Systems / Nature based solutions / Impact Investment / Story Telling\nRegenerative Food Systems / Nature based solutions / Impact Investment / Story Telling\nConnect\nJohn Lo\nJohn Lo\nFounder\nFounder\nConnect\nDANIEL S.\nDANIEL S.\nStanford GSB MSx '25 Candidate/Co-founder and CEO Grupo Abraxas\nStanford GSB MSx '25 Candidate/Co-founder and CEO Grupo Abraxas\nConnect\nJoost Oorthuizen\nJoost Oorthuizen\n(Non-) Executive\n(Non-) Executive\nConnect\nJens Munch Lund-Nielsen\nJens Munch Lund-Nielsen\nHead of Global Trade & Supply Chains at IOTA Foundation\nHead of Global Trade & Supply Chains at IOTA Foundation\nConnect\nShow all\nStatus is online\nMessaging\nYou are on the messaging overlay. Press enter to open the list of conversations.\nCompose message\nYou are on the messaging overlay. Press enter to open the list of conversations."
  }
}