{
  "url": "https://www.linkedin.com/in/jennifer-koster-a2b5331/",
  "scraped_at": "2025-10-27T14:38:22.384441",
  "extracted": {
    "name": "Jennifer Koster",
    "headline": "Serial Entrepreneur Re-Engineering How We Live, Work and Play",
    "full_text": "0 notifications total\nSkip to search\nSkip to main content\nKeyboard shortcuts\nClose jump menu\nnew feed updates notifications\nHome\n1\n1 new network update notification\nMy Network\nJobs\nMessaging\n14\n14 new notifications\nNotifications\nMe\nFor Business\nAdvertise\ntest\nJennifer Koster\n  \n1st degree connection\n1st\nSerial Entrepreneur Re-Engineering How We Live, Work and Play\nWerkWell Project Services\nCarleton University\nBeverly Hills, California, United States  Contact info\n500+ connections\nIndy Rishi Singh, Erica Gies, and 147 other mutual connections\nIndy Rishi Singh, Erica Gies, and 147 other mutual connections\nMessage\nMore\nHighlights\nHighlights\n3 mutual groups\n3 mutual groups\nYou and Jennifer are both in Climate Change / ESG Professionals Group, Climate Change - I care!, and 1 other\nYou and Jennifer are both in Climate Change / ESG Professionals Group, Climate Change - I care!, and 1 other\nAbout\nAbout\nJennifer Koster is a serial entrepreneur and systems integrator transforming the global built environment through innovation, precision, and execution. As Founder and CEO of WerkWell Holdings, she leads a vertically integrated group of companies advancing circular construction, sustainable real estate, and next-generation infrastructure. She is also Co-Founder of LivWell, where she is pioneering a wellness-driven development model rooted in regenerative systems and resilient design.\n\nJennifer brings a unique ability to synthesize complexity into action. Her core strength lies not just in visionary strategy, but in operationalizing that vision—aligning multi-disciplinary teams across design, engineering, finance, and community to deliver high-performance outcomes. Whether launching climate-aligned infrastructure or reimagining mixed-use communities, Jennifer leads with discipline, aligning stakeholders, de-risking capital, and keeping teams focused on measurable delivery.\n\nFrom circular building materials to post-disaster recovery and ESG-aligned financing, Jennifer’s work spans sectors including healthcare, hospitality, data centers, and residential real estate. She has led over $500M in executed projects and structured solutions that integrate innovation, resiliency, and social impact at scale. Her leadership ensures that nothing is siloed, every detail is owned, and execution is uncompromising.\n\nJennifer's global network spans advanced materials, AI, and sustainable infrastructure. She doesn’t just connect the dots—she orchestrates the entire system. Under her leadership, WerkWell delivers on what others only promise: real infrastructure, real capital deployment, and real-world outcomes.\n\nCore Competencies:\n\n- Systems-Based Design, Development & Governance\n- Circular Economy & Next-Gen Building Technologies\n- ESG Infrastructure Strategy & Capital Structuring\n- High-Performance Project Delivery Across Sectors\n- Stakeholder Alignment & Executional Leadership\nJennifer Koster is a serial entrepreneur and systems integrator transforming the global built environment through innovation, precision, and execution. As Founder and CEO of WerkWell Holdings, she leads a vertically integrated group of companies advancing circular construction, sustainable real estate, and next-generation infrastructure. She is also Co-Founder of LivWell, where she is pioneering a wellness-driven development model rooted in regenerative systems and resilient design. Jennifer brings a unique ability to synthesize complexity into action. Her core strength lies not just in visionary strategy, but in operationalizing that vision—aligning multi-disciplinary teams across design, engineering, finance, and community to deliver high-performance outcomes. Whether launching climate-aligned infrastructure or reimagining mixed-use communities, Jennifer leads with discipline, aligning stakeholders, de-risking capital, and keeping teams focused on measurable delivery. From circular building materials to post-disaster recovery and ESG-aligned financing, Jennifer’s work spans sectors including healthcare, hospitality, data centers, and residential real estate. She has led over $500M in executed projects and structured solutions that integrate innovation, resiliency, and social impact at scale. Her leadership ensures that nothing is siloed, every detail is owned, and execution is uncompromising. Jennifer's global network spans advanced materials, AI, and sustainable infrastructure. She doesn’t just connect the dots—she orchestrates the entire system. Under her leadership, WerkWell delivers on what others only promise: real infrastructure, real capital deployment, and real-world outcomes. Core Competencies: - Systems-Based Design, Development & Governance - Circular Economy & Next-Gen Building Technologies - ESG Infrastructure Strategy & Capital Structuring - High-Performance Project Delivery Across Sectors - Stakeholder Alignment & Executional Leadership\nTop skills\nTop skills\nProject Management • Business Development • Analytical Skills\nProject Management • Business Development • Analytical Skills\nFeatured\nFeatured\nPost\nPost\nI turned 47 yesterday and spent most of the day thinking about the legacy I want to leave. \n\nAn afternoon rendezvous with a dear friend, a fellow high achiever, reminded me to be a human being and not a human doing. As I gave this further thought throughout the day, I realized my achievements don't matter. It won't matter how many books I write, how many awards I receive, or how many successful exits I have. The only thing that matters is if I made a positive impact on people, on the world and, most importantly, my children. \n\nFor the last couple years, I have been deeply driven by a bigger purpose. A desire to help people. A desire to make the world a better place - more equal, more just, more open, more harmonious, more simple. Today, I hope that when my children celebrate their 47th birthdays that I leave them a planet to celebrate on that is in better shape than it is today.\n\nAs I track what is happening between natural disasters, mass shootings, environmental disasters, wars, and the climate crisis (which is now highly politicized as fossil fuels vs. sustainability, meat vs. plant-based, us vs. them), it only makes me more motivated to deliver real solutions to our real problems. \n\nI transitioned from high-end residential construction building luxury homes to launching a company that makes the whole construction process more efficient, less risky and more pleasant. Over the last year, I fully revived a plan I wrote 13 years ago for a sustainable community and my mission evolved to not just changing how we build, but changing how we LIVE.\n\nToday, I am on a mission to make existing buildings more efficient, healthy and sustainable, developing a global network of regenerative communities, and preparing to print my book. All to create a healthier balance between nature, home and people. To be more connected. To shift from achieving to being. To shift from fighting to loving - from struggling to thriving.\n\nThat is the legacy I hope to leave.\n170\n73 comments\nActivity\nActivity\n\n3,733 followers\n3,733 followers\n\nPosts\nComments\nImages\nDocuments\nLoaded 9 Posts posts\nJennifer Koster\nJennifer Koster\n • 1st\n1st\nSerial Entrepreneur Re-Engineering How We Live, Work and Play\nSerial Entrepreneur Re-Engineering How We Live, Work and Play\n2d • Edited • \n \n2 days ago • Edited • Visible to anyone on or off LinkedIn\nExactly. We have the solutions. We just need to start using them and change legislation. We have water harvesting and filtration systems that can manage massive volumes of water, and when part of a well-designed lanscape plan can reduce potable water usage up to 100% by re-using rainwater and graywater.\n\nBUT - in most jurisdictions around the globe we can only use that water for irrigation and fire suppression. In some locations it can be re-used for toilets and sinks. Yet, the water coming out of our systems tests cleaner than the world's best drinking water. If we want to save our planet - it all starts with being smarter on how we use our most valuable resource. Without it there is no life. (and for those who don't believe we are in a planetary crisis - also no data centers)\n\nThis is not that complicated. We just have outdated systems and laws.\n…more\nMoein Nodehi\nMoein Nodehi\n   • 1st\nPremium • 1st\nFounder Biotonomy.com | Co-Founder Circularliving.ai | Engineer & Architect | Advancing Nature Based, Self-Sufficient Buildings | Awarded by the United Nations, Government of Spain, Málaga City, Forbes\nFounder Biotonomy.com | Co-Founder Circularliving.ai | Engineer & Architect | Advancing Nature Based, Self-Sufficient Buildings | Awarded by the United Nations, Government of Spain, Málaga City, Forbes\nThis is one of the biggest design mistakes cities ever made.\n\nIn most cities, rainwater and sewage go through the same pipes.\n\nWhen it rains, clean water from roofs and streets mixes with dirty water from toilets and sinks.\n\nThe system can’t handle it — so to stop flooding, it dumps everything straight into rivers and the sea.\n\nThis is called a Combined Sewer Overflow —\nand it happens tens of thousands of times every year across Europe,\nwith over 650,000 overflow points still active today.\n\nThat means billions of liters of dirty water are released every time it rains heavily.\n\nSome newer cities tried to fix this by separating the pipes.\nBut instead of mixing, they now throw the rainwater away — sending it straight to the sea.\n\nOnce rainwater reaches the ocean, it becomes saltwater.\nIt can’t be used again for drinking, farming, or nature —\nit’s lost from the freshwater cycle.\n\nThat’s why cities flood in winter and dry up in summer —\nbecause rain never reaches the ground to refill the soil and groundwater.\n\nBoth systems fail:\n◾ One pollutes water.\n◾ The other wastes it.\n\nThe solution is simple:\nLet rain soak into the ground.\nStore it. Reuse it. Don’t throw it away.\n\nThat’s how we restore the natural water cycle —\nand fix one of the biggest urban design mistakes ever made.\n\n👉 Want to learn how to design buildings that restore water cycles?\nComment Academy, and I’ll invite you to our waiting list.\n\nBIOTONOMY - Nature Based Architecture\n\n\nhashtag\n#Biotonomy \nhashtag\n#water \nhashtag\n#greencities\n…more\nActivate to view larger image,\nActivate to view larger image,\n10\n1 repost\nJennifer Koster\nJennifer Koster\n • 1st\n1st\nSerial Entrepreneur Re-Engineering How We Live, Work and Play\nSerial Entrepreneur Re-Engineering How We Live, Work and Play\n4d • Edited • \n \n4 days ago • Edited • Visible to anyone on or off LinkedIn\nWe are all charged up about Critical Infrastructure, and our growing list of projects indicates the market is too. \n\nWhy we love it? \n\nWe get to connect different solutions and minds to build smarter, more resilient systems for the future - finding ways to better use our limited resources while creating a positive impact. \n\nWe often talk about sustainability, but the real change happens when how we build, power, and sustain our communities work in harmony to reduce demand and eliminate (or use) waste. \n\nSo where is innovation making a real impact now? \n\n→ Energy - Solar is just the beginning. \nBy integrating battery storage with renewable generation like wind and solar, we can turn building sites into mini power plants - generating, storing, and using energy locally. \n\n→ Geothermal - In Northern Europe, geothermal fields have been used for decades, and now they are proving their impact around the world. With heating and cooling among the most energy-intensive needs we have, geothermal systems can cut that demand by up to 80%. \n\n→ Water - Our planet’s most valuable resource. \nWe bring innovative Dutch startups into projects of all sizes to harvest, process, store and reuse rainwater and recycle greywater. In drought-stricken regions like California, capturing and reusing rainwater instead of releasing it into the ocean will transform irrigation and fire prevention, saving millions of gallons of valuable potable drinking water.\n\nCritical infrastructure is evolving quickly - and it’s exciting to see what’s possible when innovation meets intention. \n\nWhich of these technologies do you think will have the biggest impact in the next decade? \n\n\nhashtag\n#infrastructure \nhashtag\n#sustainability \nhashtag\n#renewableenergy \nhashtag\n#geothermal \nhashtag\n#watermanagement \nhashtag\n#innovation \nhashtag\n#climateaction \nhashtag\n#resilience \nhashtag\n#werkwell\n…more\nActivate to view larger image,\nActivate to view larger image,\n8\n2 reposts\nShow all posts\nExperience\nExperience\nCo-Founder and CEO\nCo-Founder and CEO\nWerkWell Project Services\nWerkWell Project Services\nJul 2017 - Present · 8 yrs 4 mos\nJul 2017 to Present · 8 yrs 4 mos\nThe Hague, South Holland, Netherlands\nThe Hague, South Holland, Netherlands\nWerkWell provides construction management and sustainability solutions to clients ranging from high-end residential, multi-family, commercial, hospitality, and healthcare for retrofit and new construction projects. We are most impactful when engaged in the earliest stages of the project concept so we can fully align design, sustainability and budget objectives around a clear project plan that streamlines the project and delivers on average 30% cost reduction from the typical project approach. For larger projects, we facilitate design, engineering, construction and operation of next generation infrastructure with financing solutions to make sustainability make sense.\n\nOur global team and extensive network of partners enable us to deliver projects around the world, and ensure that the right teams are connected to the right projects and clients. Together, our mission is to deliver successful projects, though our passion is to lead groundbreaking projects that have positive impact through energy reduction, cost savings and emissions reductions.\n\nExperts in Construction. Passionate about Sustainability.\nWerkWell provides construction management and sustainability solutions to clients ranging from high-end residential, multi-family, commercial, hospitality, and healthcare for retrofit and new construction projects. We are most impactful when engaged in the earliest stages of the project concept so we can fully align design, sustainability and budget objectives around a clear project plan that streamlines the project and delivers on average 30% cost reduction from the typical project approach. For larger projects, we facilitate design, engineering, construction and operation of next generation infrastructure with financing solutions to make sustainability make sense. Our global team and extensive network of partners enable us to deliver projects around the world, and ensure that the right teams are connected to the right projects and clients. Together, our mission is to deliver successful projects, though our passion is to lead groundbreaking projects that have positive impact through energy reduction, cost savings and emissions reductions. Experts in Construction. Passionate about Sustainability.\nAnalytical Skills, Communication and +3 skills\nCo-Founder and CEO\nCo-Founder and CEO\nWerkWell WerkForce BV · Full-time\nWerkWell WerkForce BV · Full-time\nJul 2017 - Present · 8 yrs 4 mos\nJul 2017 to Present · 8 yrs 4 mos\nWerkWell WerkForce provides consulting and solutions to contractors, subcontractors and workers to streamline administrative functions, provide business development support and advisory services on corporate structuring, financial management and growth strategy.\n\nWe provide consulting services and administrative support in the areas of bidding, estimating, accounting and business development so our clients can focus on what they do best - build. As companies seek to grow, we provide training and workforce development to increase work productivity and help implement processes and procedures to support long term growth plans.\nWerkWell WerkForce provides consulting and solutions to contractors, subcontractors and workers to streamline administrative functions, provide business development support and advisory services on corporate structuring, financial management and growth strategy. We provide consulting services and administrative support in the areas of bidding, estimating, accounting and business development so our clients can focus on what they do best - build. As companies seek to grow, we provide training and workforce development to increase work productivity and help implement processes and procedures to support long term growth plans.\nFundraising and Start-up Leadership\nManaging Partner\nManaging Partner\nManaging Partner\nidealight Inc.\nidealight Inc.\nApr 2002 - Present · 23 yrs 7 mos\nApr 2002 to Present · 23 yrs 7 mos\nManagement consultancy specializing in working with international early to mid-stage companies in developing growth strategy or pivoting existing business models. Focused on the tech, entertainment, fashion, fitness, beauty and mobile. idealight works with clients to create business plans, financial models, secure funding, build out management teams and boards and execute key partnerships to drive long term, sustainable growth.\nManagement consultancy specializing in working with international early to mid-stage companies in developing growth strategy or pivoting existing business models. Focused on the tech, entertainment, fashion, fitness, beauty and mobile. idealight works with clients to create business plans, financial models, secure funding, build out management teams and boards and execute key partnerships to drive long term, sustainable growth.\nAnalytical Skills, Communication and +2 skills\nStrategic Advisor & Investor\nStrategic Advisor & Investor\nJenette Skin Care, Inc.\nJenette Skin Care, Inc.\nMar 2012 - Present · 13 yrs 8 mos\nMar 2012 to Present · 13 yrs 8 mos\nGreater Los Angeles Area\nGreater Los Angeles Area\nJenette All Natural Skin Care (“JS“) is an innovative, all-natural skincare line launched in 2011 by Jenette Serrins after years of customizing facials and treatments for clients at her Los Angeles Spa, Being in LA. With a deep commitment to health and wellbeing, JS developed its line of all-natural, results-oriented, and anti-inflammatory products to address skin conditions at the root of the problem. The proprietary and truly natural formulas nourish the skin at a cellular level, delivering medical-grade results naturally unlike any other.\nJenette All Natural Skin Care (“JS“) is an innovative, all-natural skincare line launched in 2011 by Jenette Serrins after years of customizing facials and treatments for clients at her Los Angeles Spa, Being in LA. With a deep commitment to health and wellbeing, JS developed its line of all-natural, results-oriented, and anti-inflammatory products to address skin conditions at the root of the problem. The proprietary and truly natural formulas nourish the skin at a cellular level, delivering medical-grade results naturally unlike any other.\nAnalytical Skills and Communication\nJenette All Natural Skin Care\nJenette All Natural Skin Care\nStrategic Advisor\nStrategic Advisor\nLight Film International · Self-employed\nLight Film International · Self-employed\nNov 2021 - Aug 2023 · 1 yr 10 mos\nNov 2021 to Aug 2023 · 1 yr 10 mos\nZagreb, Croatia\nZagreb, Croatia\nAnalytical Skills and Communication\nShow all 15 experiences\nEducation\nEducation\nCarleton University\nCarleton University\nBIB Hon, International Marketing, Finance, Management\nBIB Hon, International Marketing, Finance, Management\n1995 - 1998\n1995 - 1998\nInstituto Tecnológico Autónomo de México\nInstituto Tecnológico Autónomo de México\nInternational Finance\nInternational Finance\n1997 - 1997\n1997 - 1997\nShow all 3 educations\nVolunteering\nVolunteering\nLeadership Council\nLeadership Council\nA Place Called Home\nA Place Called Home\nSkills\nSkills\nStart-up Leadership\nStart-up Leadership\nCo-Founder and CEO at WerkWell WerkForce BV\nCo-Founder and CEO at WerkWell WerkForce BV\nEndorse\nFundraising\nFundraising\nCo-Founder and CEO at WerkWell WerkForce BV\nCo-Founder and CEO at WerkWell WerkForce BV\nEndorse\nShow all 39 skills\nRecommendations\nRecommendations\nRecommend Jennifer\nReceived\nReceived\nGiven\nGiven\nNothing to see for now\nNothing to see for now\nRecommendations that Jennifer receives will appear here.\nRecommendations that Jennifer receives will appear here.\nLanguages\nLanguages\nDutch\nDutch\nProfessional working proficiency\nProfessional working proficiency\nEnglish\nEnglish\nNative or bilingual proficiency\nNative or bilingual proficiency\nShow all 4 languages\nInterests\nInterests\nTop Voices\nTop Voices\nCompanies\nCompanies\nGroups\nGroups\nNewsletters\nNewsletters\nSchools\nSchools\nArianna Huffington\nArianna Huffington\n· 2nd\nSecond degree connection\nFounder and CEO at Thrive Global | Passionate about Health and AI\nFounder and CEO at Thrive Global | Passionate about Health and AI\n9,596,918 followers\n9,596,918 followers\nFollow\nDavid Gelles\nDavid Gelles\n· 2nd\nSecond degree connection\nNew York Times reporter and author of DIRTBAG BILLIONAIRE\nNew York Times reporter and author of DIRTBAG BILLIONAIRE\n43,254 followers\n43,254 followers\nFollow\nShow all Top Voices\nCauses\nCauses\nAnimal Welfare • Children • Human Rights • Poverty Alleviation\nAnimal Welfare • Children • Human Rights • Poverty Alleviation\nMore profiles for you\nMore profiles for you\nJim Butcher\nJim Butcher\n· 2nd\nSecond degree connection\nCEO, Global Biocarbons\nCEO, Global Biocarbons\nConnect\nEric Burnik\nEric Burnik\n· 2nd\nSecond degree connection\nERIC BURNIK | Capital x Tech x Influence • Diplomatic Architect of EU–GCC–US Investment Relations • AI x M&A x PE at Sovereign & Founder Scale • FDI & Soft Power Diplomat\nERIC BURNIK | Capital x Tech x Influence • Diplomatic Architect of EU–GCC–US Investment Relations • AI x M&A x PE at Sovereign & Founder Scale • FDI & Soft Power Diplomat\nFollow\nHannah Na Yeon Oh\nHannah Na Yeon Oh\n· 2nd\nSecond degree connection\nDedicated to Regenerating Soil to Health | Building ventures in climate x water x soil x health | Advisor, Investor, Board Member\nDedicated to Regenerating Soil to Health | Building ventures in climate x water x soil x health | Advisor, Investor, Board Member\nFollow\nGiorgia Vicari\nGiorgia Vicari\n· 2nd\nSecond degree connection\nFounder & CEO, Brilliant Ideas Planet. We help eco-friendly companies and individuals gain visibility and grow globally—accelerating the transition to a more sustainable and regenerative future.\nFounder & CEO, Brilliant Ideas Planet. We help eco-friendly companies and individuals gain visibility and grow globally—accelerating the transition to a more sustainable and regenerative future.\nFollow\nSusan Brissette, MBA\nSusan Brissette, MBA\n· 2nd\nSecond degree connection\n🇨🇦 | Founder | Board Director | Safety Culture | Engagement | Nuclear & Critical Infrastructure | Ideas with Impact | Solutionist \n🇨🇦 | Founder | Board Director | Safety Culture | Engagement | Nuclear & Critical Infrastructure | Ideas with Impact | Solutionist \nConnect\nShow all\nExplore Premium profiles\nExplore Premium profiles\nJuan Camilo Sanchez\nJuan Camilo Sanchez\n· 3rd\nThird degree connection\nFounder & CEO, Orphiq\nFounder & CEO, Orphiq\nMessage\nMatthew Gouwens\nMatthew Gouwens\n· 3rd\nThird degree connection\nCEH (Chief Executive Hopster) / Owner at Hop Farm Brewing Company\nCEH (Chief Executive Hopster) / Owner at Hop Farm Brewing Company\nMessage\nTheresa Persico\nTheresa Persico\nTheresa Persico\n· 2nd\nSecond degree connection\nFounder/CEO at Veebit\nFounder/CEO at Veebit\nConnect\nPeople you may know\nPeople you may know\n\nFrom Jennifer's school\nFrom Jennifer's school\n\nStaci Walsh\nStaci Walsh\nFounder, CEO at OpenVoices | Connecting through shared experiences\nFounder, CEO at OpenVoices | Connecting through shared experiences\nConnect\nNancy Naylor\nNancy Naylor\nFormer Deputy Minister in the Ontario Public Service; \nCurrent board director at CHEO, Seneca Polytechnic, Dais\nFormer Deputy Minister in the Ontario Public Service; Current board director at CHEO, Seneca Polytechnic, Dais\nConnect\nJean-Francois Gagne\nJean-Francois Gagne\nHead of the Clean Energy Ministerial Secretariat\nHead of the Clean Energy Ministerial Secretariat\nConnect\nStacy Kauk, P.Eng.\nStacy Kauk, P.Eng.\nWorking to scale the carbon removal ecosystem\nWorking to scale the carbon removal ecosystem\nConnect\nJane C. Glavan\nJane C. Glavan\nCo-Founder Distant Imagery, Uplink Top Innovator, Villars Institute Mentor, Zayed Prize Finalist\nCo-Founder Distant Imagery, Uplink Top Innovator, Villars Institute Mentor, Zayed Prize Finalist\nConnect\nShow all\nYou might like\nYou might like\n\nNewsletters for you\nNewsletters for you\n\nSaving species from extinction\nSaving species from extinction\nThe latest updates from the WJC as we combat wildlife crime around the world to save endangered species from extinction.\nThe latest updates from the WJC as we combat wildlife crime around the world to save endangered species from extinction.\nPublished monthly\nPublished monthly\nWildlife Justice Commission\nWildlife Justice Commission\nSubscribe\nbiometrio. insights\nbiometrio. insights\nExpert perspectives on biodiversity monitoring, nature-based solutions, nature tech and more. \nExpert perspectives on biodiversity monitoring, nature-based solutions, nature tech and more. \nPublished monthly\nPublished monthly\nbiometrio.earth\nbiometrio.earth\nSubscribe\nShow all\nStatus is online\nMessaging\nYou are on the messaging overlay. Press enter to open the list of conversations.\nCompose message\nYou are on the messaging overlay. Press enter to open the list of conversations."
  }
}