{
  "url": "https://www.linkedin.com/in/joshuakonkankoh/",
  "extracted": {
    "name": "Konkankoh Joshua",
    "headline": "Indigenous Design Thinker for Cultural Transformation,Regenerative Consultant, Coach in Community Building & Education Partnerships: Local Governance/Economies - Twinning projects & Linking Communities.",
    "full_text": "0 notifications total\nSkip to search\nSkip to main content\nKeyboard shortcuts\nClose jump menu\nnew feed updates notifications\nHome\n1\n1 new network update notification\nMy Network\nJobs\nMessaging\n22\n22 new notifications\nNotifications\nMe\nFor Business\nAdvertise\ntest\nKonkankoh Joshua\n  \n1st degree connection\n1st\nIndigenous Design Thinker for Cultural Transformation,Regenerative Consultant, Coach in Community Building & Education Partnerships: Local Governance/Economies - Twinning projects & Linking Communities.\nAfrican Way – Association for Cooperation and Sustainable Development\nGaia University International\nPortugal  Contact info\nRegenerative Leadership \n10,059 followers \n500+ connections\nAnanda Fitzsimmons, Lee Rael, and 206 other mutual connections\nAnanda Fitzsimmons, Lee Rael, and 206 other mutual connections\nMessage\nMore\nHiring: Volunteer Assistant to Project Manager\n\nAfrican Way – Associação para a Cooperação e o Desenvolvimento Sustentável · Lagos, Faro, Portugal (Hybrid) · 19 days ago\n\nShow job\n\nHighlights\nHighlights\n10 mutual groups\n10 mutual groups\nYou and Konkankoh are both in Indigenous Cultural Preservation & Innovation, Artificial Intelligence, Deep Learning, Machine Learning, and 8 others\nYou and Konkankoh are both in Indigenous Cultural Preservation & Innovation, Artificial Intelligence, Deep Learning, Machine Learning, and 8 others\nAbout\nAbout\nKonkankoh is a Regenerator and honest broker for Indigenous and Modern Partnerships between academia, ethical businesses & local community leaders working to amplify systems change. He is an indigenous elder, network weaver leveraging technology and regenerative agriculture that combines Community University Research with fostering community-led nature-based regenerative principles.\nHe has worked across 35 countries in Africa, Asia and Europe for over 35 years designing and implementing Permaculture Ecovillage Education Projects that strengthen trade and friendship ties with the West. He is Chair of African Peace Village in Portugal for Just Regeneration, founder of African Way Advisory Group for Community Education Consulting that reduce social inequalities, enhance environmental leadership, and climate resilience. Today, he co-designs collaborations of Community University Partnerships between young African change-leaders and Digital Social Entrepreneurs for developing livelihoods and building Circular Economy. \n-Serial founder of quality and impact in education and local governance projects, such as award-winning Bafut Eco-village www.betterworld-cameroon.com supporting and promoting youth/women perspectives on regeneration and addressing barriers to capacity building and entrepreneurship. \n-Committed to reinventing African wisdom`s place in a new thriving global culture through plant intelligence www.africanway.world\n-Guided many rites of passage initiations for youth and emergent change leaders.\nHis dedication to youth, women, and regenerative futures is remarkable. He is now building new ways of consulting that guide investors who want to include African real farmers in value chains and living climate. He's a caring, compassionate, and collaborative leader. \nTo collaborate please review The Spirit of Ndanifor\nKonkankoh is a Regenerator and honest broker for Indigenous and Modern Partnerships between academia, ethical businesses & local community leaders working to amplify systems change. He is an indigenous elder, network weaver leveraging technology and regenerative agriculture that combines Community University Research with fostering community-led nature-based regenerative principles. He has worked across 35 countries in Africa, Asia and Europe for over 35 years designing and implementing Permaculture Ecovillage Education Projects that strengthen trade and friendship ties with the West. He is Chair of African Peace Village in Portugal for Just Regeneration, founder of African Way Advisory Group for Community Education Consulting that reduce social inequalities, enhance environmental leadership, and climate resilience. Today, he co-designs collaborations of Community University Partnerships between young African change-leaders and Digital Social Entrepreneurs for developing livelihoods and building Circular Economy. -Serial founder of quality and impact in education and local governance projects, such as award-winning Bafut Eco-village www.betterworld-cameroon.com supporting and promoting youth/women perspectives on regeneration and addressing barriers to capacity building and entrepreneurship. -Committed to reinventing African wisdom`s place in a new thriving global culture through plant intelligence www.africanway.world -Guided many rites of passage initiations for youth and emergent change leaders. His dedication to youth, women, and regenerative futures is remarkable. He is now building new ways of consulting that guide investors who want to include African real farmers in value chains and living climate. He's a caring, compassionate, and collaborative leader. To collaborate please review The Spirit of Ndanifor\nServices\nServices\nLeadership Development • Public Speaking • Public Relations • Change Management • Educational Consulting • Environmental Consulting • Training\nLeadership Development • Public Speaking • Public Relations • Change Management • Educational Consulting • Environmental Consulting • Training\nRequest services\nShow all services\nFeatured\nFeatured\nImage\nImage\nNPE Summer School.jpg\nNPE Summer School.jpg\nCommunity University Partnerships\nCommunity University Partnerships\nImage\nImage\nNdanifor Goals.jpg\nNdanifor Goals.jpg\nBusinesses can contribute to the regenerative economy through strategies such as implementing circular business models, investing in regenerative agriculture, supporting community-led initiatives, and prioritizing diversity, equity, and inclusion\nBusinesses can contribute to the regenerative economy through strategies such as implementing circular business models, investing in regenerative agriculture, supporting community-led initiatives, and prioritizing diversity, equity, and inclusion\nImage\nImage\nNdanifor Permaculture Ecovillage.jpg\nNdanifor Permaculture Ecovillage.jpg\nTRADE NOT AID\nSocial Permaculture for honoring the victims of the Ambazonian liberation war. All refugees have a right to regenerative education and developing social business for healing south-north collaboration.\nTRADE NOT AID Social Permaculture for honoring the victims of the Ambazonian liberation war. All refugees have a right to regenerative education and developing social business for healing south-north collaboration.\nImage\nImage\nCoFSA Role.jpg\nCoFSA Role.jpg\nBlending Indigenous and Modern Approaches to create a community of Trainers/Facilitators for Food Consciousness.\nBlending Indigenous and Modern Approaches to create a community of Trainers/Facilitators for Food Consciousness.\nDocument\nDocument\nSPSC Certificate.pdf\nSPSC Certificate.pdf\nAdvisory services for sustainable development\nAdvisory services for sustainable development\nActivity\nActivity\n\n10,059 followers\n10,059 followers\n\nFollowing\nPosts\nComments\nVideos\nImages\nLoaded 9 Posts posts\nKonkankoh Joshua\nKonkankoh Joshua\n • 1st\n1st\nIndigenous Design Thinker for Cultural Transformation,Regenerative Consultant, Coach in Community Building & Education Partnerships: Local Governance/Economies - Twinning projects & Linking Communities.\nIndigenous Design Thinker for Cultural Transformation,Regenerative Consultant, Coach in Community Building & Education Partnerships: Local Governance/Economies - Twinning projects & Linking Communities.\n1w • \n \n1 week ago • Visible to anyone on or off LinkedIn\nMY WORLDVIEW OF HOPE & POSSIBILITY I’ve seen health systems strain and climate risks grow. I’ve seen western political supremacist priorities shifting to medicate everyone on earth.\nThe world is standing by watching young people full of ideas for the future left without the opportunities to use them. When I am asked what I am learning at Intentional Peer Support, I want to be able to say a learning partnership with Africa's indigenous systems is imperative for the world's future children.\n…more\n\n10\n1 comment\nKonkankoh Joshua\nKonkankoh Joshua\n • 1st\n1st\nIndigenous Design Thinker for Cultural Transformation,Regenerative Consultant, Coach in Community Building & Education Partnerships: Local Governance/Economies - Twinning projects & Linking Communities.\nIndigenous Design Thinker for Cultural Transformation,Regenerative Consultant, Coach in Community Building & Education Partnerships: Local Governance/Economies - Twinning projects & Linking Communities.\n2w • \n \n2 weeks ago • Visible to anyone on or off LinkedIn\nAs a Regenerative Education practitioner and Indigenous and Modern Action Researcher, I’m happy to share that I’ve obtained a new certification: Warm Data Host from International Bateson Institute!\n…more\nCelebrating a New Certification\n27\n7 comments\nShow all posts\nExperience\nExperience\n African Way – Association for Cooperation and Sustainable Development\n African Way – Association for Cooperation and Sustainable Development\nFull-time · 4 yrs 1 mo\nFull-time · 4 yrs 1 mo\nConsultant@ konkankoh www.konkankoh.com / Indigenous & Modern \nConsultant@ konkankoh www.konkankoh.com / Indigenous & Modern \nOct 2021 - Present · 4 yrs 1 mo\nOct 2021 to Present · 4 yrs 1 mo\nUK , Germany, Portugal, Ambazonia · Hybrid\nUK , Germany, Portugal, Ambazonia · Hybrid\nAttention to Detail\nHuman Resources Administrator\nHuman Resources Administrator\nJan 2022 - Present · 3 yrs 10 mos\nJan 2022 to Present · 3 yrs 10 mos\nPortugal\nPortugal\nAttention to Detail\nInner Council Member CoFSA\nInner Council Member CoFSA\nConscious Food Systems Alliance · Full-time\nConscious Food Systems Alliance · Full-time\nJan 2023 - Present · 2 yrs 10 mos\nJan 2023 to Present · 2 yrs 10 mos\nUNDP · Hybrid\nUNDP · Hybrid\nAttention to Detail and Sustainable Agriculture\nClimate Justice Advisor Pachamama Alliance\nClimate Justice Advisor Pachamama Alliance\nClimate Justice Advisor Pachamama Alliance\nNdanifor Consultancy · Contract\nNdanifor Consultancy · Contract\nSep 2022 - Present · 3 yrs 2 mos\nSep 2022 to Present · 3 yrs 2 mos\nPortugal\nPortugal\nAttention to Detail and Sustainable Agriculture\nProject Captain\nProject Captain\n African Way – Association for Cooperation and Sustainable Development · Full-time\n African Way – Association for Cooperation and Sustainable Development · Full-time\nPortugal\nPortugal\nAttention to Detail\nBafut Ecovillage\nBafut Ecovillage\nBafut Ecovillage\n15 yrs\n15 yrs\nFounder Director\nFounder Director\nFeb 2014 - Present · 11 yrs 9 mos\nFeb 2014 to Present · 11 yrs 9 mos\n Setting up communication and networking systems in rural communities in Africa tomorrow for cross-culture education.\n Setting up communication and networking systems in rural communities in Africa tomorrow for cross-culture education.\nAttention to Detail\nBafut Ecovillage2020 Vision\nBafut Ecovillage2020 Vision\nThe strategy is to assist Bafut Council and Bafut Palace and local NGOs with implementing the Sustainable Development Agenda and achieving climate goals by supporting innovation and building integrated land management in rural areas. My goal is to use the Bafut Ecovillage platform in facilitating strategic partnerships between government, donors, businesses and agriculture initiatives.\nThe strategy is to assist Bafut Council and Bafut Palace and local NGOs with implementing the Sustainable Development Agenda and achieving climate goals by supporting innovation and building integrated land management in rural areas. My goal is to use the Bafut Ecovillage platform in facilitating strategic partnerships between government, donors, businesses and agriculture initiatives.\nFounder/Director Bafut Ecovillage\nFounder/Director Bafut Ecovillage\nNov 2010 - Oct 2021 · 11 yrs\nNov 2010 to Oct 2021 · 11 yrs\nBafut, Bamenda\nBafut, Bamenda\nBafut Ecovillage www.betterworld-cameroon.com\n New approaches in Climate Justice with GEN - Global Ecovillage Network Pan African Ecovillage Programme Reaching out to 10000 villages around the world: Regenerating soils, Ecological building, Energy and Food Production, Water Harvesting Regenerating the Social and Natural Environment.\nBafut Ecovillage www.betterworld-cameroon.com New approaches in Climate Justice with GEN - Global Ecovillage Network Pan African Ecovillage Programme Reaching out to 10000 villages around the world: Regenerating soils, Ecological building, Energy and Food Production, Water Harvesting Regenerating the Social and Natural Environment.\nShow all 25 experiences\nEducation\nEducation\nGaia University International\nGaia University International\nSystem, Networking, and LAN/WAN Management/Manager\nSystem, Networking, and LAN/WAN Management/Manager\n2017 - 2018\n2017 - 2018\nActivities and societies: Ecological Rehabilitation, Soil Restoration, Water Retension Landscapes\nActivities and societies: Ecological Rehabilitation, Soil Restoration, Water Retension Landscapes\nDesigning Living Biotopes\nDesigning Living Biotopes\nSustainable Agriculture\nHealing Bitope 1 Tamera\nHealing Bitope 1 Tamera\nHealing Bitope 1 Tamera\nWater Retention Landscapes Design, Cooperation with Nature\nWater Retention Landscapes Design, Cooperation with Nature\n2014 - 2015\n2014 - 2015\nGrade: Model for the future\nGrade: Model for the future\nActivities and societies: Designing Water, Food & Energy Systems as Youth Strategy for Sustainable Development\nActivities and societies: Designing Water, Food & Energy Systems as Youth Strategy for Sustainable Development\nBuilding on African cultural foundations using Permaculture to engage youth in community enterprises\nBuilding friendship with like minded people and projects.\nDeepening knowledge in indigenous knowledge systems and transferring knowledge to youth and children.\nRestoring food sovereignty, autonomy in water and energy to communities\nBuilding on African cultural foundations using Permaculture to engage youth in community enterprises Building friendship with like minded people and projects. Deepening knowledge in indigenous knowledge systems and transferring knowledge to youth and children. Restoring food sovereignty, autonomy in water and energy to communities\nSustainable Agriculture\nCertificate water retention landscapes\nCertificate water retention landscapes\nDEPENDING ON THE WAY WE HANDLE WATER, LIVING WATER IS LIVE!\nDEPENDING ON THE WAY WE HANDLE WATER, LIVING WATER IS LIVE!\nShow all 12 educations\nLicenses & certifications\nLicenses & certifications\nWarm Data Host\nWarm Data Host\nInternational Bateson Institute\nInternational Bateson Institute\nIssued Jan 2025\nIssued Jan 2025\nCredential ID Certificate of Warm Data Training\nCredential ID Certificate of Warm Data Training\nWarm Data Host Konkankoh.pdf\nWarm Data Host Konkankoh.pdf\nTraining in Transcontextual Research in ecology, economy, social change, health, education, and art. The International Bateson Institute supports a new kind of research in Regenerative Education that encourages and incubates projects, which examine the interactions within complex systems.\nThe aim of this research is to increase our ability to take into account the many relationships that coexist in any context of living things. In addition to providing much-needed perspective to existing research\nTraining in Transcontextual Research in ecology, economy, social change, health, education, and art. The International Bateson Institute supports a new kind of research in Regenerative Education that encourages and incubates projects, which examine the interactions within complex systems. The aim of this research is to increase our ability to take into account the many relationships that coexist in any context of living things. In addition to providing much-needed perspective to existing research\nManagement for Consulting and Training Providers\nManagement for Consulting and Training Providers\nITCILO\nITCILO\nIssued Jan 2022\nIssued Jan 2022\nCredential ID 44973817\nCredential ID 44973817\nShow credential\nShow all 6 licenses & certifications\nProjects\nProjects\nNdanifor Permaculture Eco-Village Learning Center and Eco-Lodge\nNdanifor Permaculture Eco-Village Learning Center and Eco-Lodge\nSep 2013 - Present\nSep 2013 - Present\nAssociated with Bafut Eco Village Vision 2020\nAssociated with Bafut Eco Village Vision 2020\nShow project\nGIVING ORIENTATION TO NEW WAYS OF SEEING AFRICA \nThe BIG IDEA of African Way is a South North Linking and Partnerships Platform for Regenerators and the Global Eco Village Network NextGen Africa to create learning centers for cultural exchange as part of the Bafut Ecovillage Reconstruction design strategy.A small but dedicated team of change makers is working to move forward the eco village movement in Africa, and they need your help in Engaging with African Indigenous Wisdom, mindset shift and transformative action.\nBuilding Trade not \"Aid\" as the new parameter for distribution of values such as Fair Trade. \nOur work is organised around the spiritual dimensions of inner capacities which reflect the historical and philosophical fabric of Bafut Ecovillage.\nWhy am I doing this?\nin 2016 a war was declared on the Ambazonian people by the Cameroun government and we were expelled from the Ndanifor Permaculture Ecovillage into exile in Portugal https://www.nrc.no/news/2019/june/cameroon-tops-list-of-most-neglected-crises/ \nin 2021 the ecovillage was burnt down by Cameroun \nstate terrorism thugs https://borealisdata.ca/dataset.xhtml?persistentId=doi:10.5683/SP3/V6FMOO \nIt is now clear that when it comes to many crisis facing humanity the Bafut Permaculture Peace Village is a prerequisite for getting not only the Bafut kingdom out of survival mode, but also humanity in the 21st century. Without Peace and reconciliation between the humanrace, it will not be possible to achieve the levels of trust, cooperation and inclusiveness necessary to solve these challenges, let alone empower local/international organisations necessary to address them.\nGIVING ORIENTATION TO NEW WAYS OF SEEING AFRICA The BIG IDEA of African Way is a South North Linking and Partnerships Platform for Regenerators and the Global Eco Village Network NextGen Africa to create learning centers for cultural exchange as part of the Bafut Ecovillage Reconstruction design strategy.A small but dedicated team of change makers is working to move forward the eco village movement in Africa, and they need your help in Engaging with African Indigenous Wisdom, mindset shift and transformative action. Building Trade not \"Aid\" as the new parameter for distribution of values such as Fair Trade. Our work is organised around the spiritual dimensions of inner capacities which reflect the historical and philosophical fabric of Bafut Ecovillage. Why am I doing this? in 2016 a war was declared on the Ambazonian people by the Cameroun government and we were expelled from the Ndanifor Permaculture Ecovillage into exile in Portugal https://www.nrc.no/news/2019/june/cameroon-tops-list-of-most-neglected-crises/ in 2021 the ecovillage was burnt down by Cameroun state terrorism thugs https://borealisdata.ca/dataset.xhtml?persistentId=doi:10.5683/SP3/V6FMOO It is now clear that when it comes to many crisis facing humanity the Bafut Permaculture Peace Village is a prerequisite for getting not only the Bafut kingdom out of survival mode, but also humanity in the 21st century. Without Peace and reconciliation between the humanrace, it will not be possible to achieve the levels of trust, cooperation and inclusiveness necessary to solve these challenges, let alone empower local/international organisations necessary to address them.\nOther contributors\nOther contributors\nBetter World Girls & Children Empowerment Project\nBetter World Girls & Children Empowerment Project\nJan 2012 - Present\nJan 2012 - Present\nAssociated with BETTERWORLD CAMEROON\nAssociated with BETTERWORLD CAMEROON\nShow project\nThe Girls and Children's empowerment center programs provide gender tailored education to promote good health, build remarkable leadership skills and encourage personal, educational and economical achievement. Why Girls and Children? The benefits of investing in girls are amplified and sustained in the next generation.\nThe status of girls and shapes the size and productivity of the future workforce in both the formal and informal sectors. The best documented relationship is between the education afforded to girls and children and their future economic activity. Girls and Children with more schooling participate in greater numbers in the labor force when they grow up, and they are able to earn more for their families and society.\n\nGirls and Children’s welfare today shapes the prospects for future families. The health and educational achievement of future generations is directly related to the physical and intellectual condition of today’s girls and young women, who will bear and prepare the children of the next decade.Our Core Values\n\nIntegrity: We apply honesty in all our dealings. \nTeamwork: We are focused and dedicated towards a common goal.\nRespect: We embrace our differences so that we may enrich the well-being of everyone. Openness: we believe in and practice transparency in all our activities. These values reflect who we are and what we do. They ensure the effectiveness of our approach and help us achieve our purpose of enhancing lives.\nOur core values guide and inspire our work everyday. \nThe Better World Educate for change program practiced in Yaounde, Bamenda and Maroua is a twin pillar program; on the one hand it is BWC's interpretation of the MDG in urban slums and rural Cameroon..\nThe Girls and Children's empowerment center programs provide gender tailored education to promote good health, build remarkable leadership skills and encourage personal, educational and economical achievement. Why Girls and Children? The benefits of investing in girls are amplified and sustained in the next generation. The status of girls and shapes the size and productivity of the future workforce in both the formal and informal sectors. The best documented relationship is between the education afforded to girls and children and their future economic activity. Girls and Children with more schooling participate in greater numbers in the labor force when they grow up, and they are able to earn more for their families and society. Girls and Children’s welfare today shapes the prospects for future families. The health and educational achievement of future generations is directly related to the physical and intellectual condition of today’s girls and young women, who will bear and prepare the children of the next decade.Our Core Values Integrity: We apply honesty in all our dealings. Teamwork: We are focused and dedicated towards a common goal. Respect: We embrace our differences so that we may enrich the well-being of everyone. Openness: we believe in and practice transparency in all our activities. These values reflect who we are and what we do. They ensure the effectiveness of our approach and help us achieve our purpose of enhancing lives. Our core values guide and inspire our work everyday. The Better World Educate for change program practiced in Yaounde, Bamenda and Maroua is a twin pillar program; on the one hand it is BWC's interpretation of the MDG in urban slums and rural Cameroon..\nOther contributors\nOther contributors\n7\nShow all 5 projects\nVolunteering\nVolunteering\nBusiness and Partnerships Director\nBusiness and Partnerships Director\nBetter World Cameroon\nBetter World Cameroon\nSep 1996 - Present · 29 yrs 2 mos\nSep 1996 - Present · 29 yrs 2 mos\nEconomic Empowerment\nEconomic Empowerment\nAs founder and Advocate of the \"Spirit of Ndanifor\" (Rite of Passage for Youth) Heritage restoration and indigenous community development concept in Cameroon, I develop, drive and spread innovative ideas for international solidarity and Trade not 'AID' effectiveness from an African perspective.\nAs founder and Advocate of the \"Spirit of Ndanifor\" (Rite of Passage for Youth) Heritage restoration and indigenous community development concept in Cameroon, I develop, drive and spread innovative ideas for international solidarity and Trade not 'AID' effectiveness from an African perspective.\nFundraiser\nFundraiser\nFundraiser\nBetter World Cameroon\nBetter World Cameroon\nOct 2020 - Present · 5 yrs 1 mo\nOct 2020 - Present · 5 yrs 1 mo\nEconomic Empowerment\nEconomic Empowerment\nI raised funds for moving the think tank group to Portugal.\nI raised funds for moving the think tank group to Portugal.\nSkills\nSkills\nSustainable Agriculture\nSustainable Agriculture\n4 experiences across Conscious Food Systems Alliance and 3 other companies\n4 experiences across Conscious Food Systems Alliance and 3 other companies\n7 educational experiences at Gaia University International and 1 other school\n7 educational experiences at Gaia University International and 1 other school\nApplied Permaculture\nApplied Permaculture\nShow all 4 details\nEndorse\nAttention to Detail\nAttention to Detail\n15 experiences across African Way – Association for Cooperation and Sustainable Development and 12 other companies\n15 experiences across African Way – Association for Cooperation and Sustainable Development and 12 other companies\nEndorse\nShow all 52 skills\nRecommendations\nRecommendations\nRecommend Konkankoh\nReceived\nReceived\nGiven\nGiven\nEvan Ross\nEvan Ross\n· 1st\nFirst degree connection\nFounder, StorySeer | Strategic Intelligence 2.0 for Startup Founders\nFounder, StorySeer | Strategic Intelligence 2.0 for Startup Founders\nJuly 24, 2023, Konkankoh was Evan’s client\nJuly 24, 2023, Konkankoh was Evan’s client\nKonkankoh is one of the most beautiful people I've had the honor of working with. I was deeply privileged to spend a few months working on African Way's strategic narrative / messaging platform, and finished feeling truly inspired by the beautiful vision which he and his team are birthing into this world. I had about 20 calls with him over the duration of our project, and each time I left feeling calm, inspired, and in a deep state of flow. I whole heartedly recommend him as both a speaker and a consultant on topics like indigenous wisdom, regenerative agriculture, conscious food systems, and the beautiful new story of Africa that he and his team embody.\nKonkankoh is one of the most beautiful people I've had the honor of working with. I was deeply privileged to spend a few months working on African Way's strategic narrative / messaging platform, and finished feeling truly inspired by the beautiful vision which he and his team are birthing into this world. I had about 20 calls with him over the duration of our project, and each time I left feeling calm, inspired, and in a deep state of flow. I whole heartedly recommend him as both a speaker and a consultant on topics like indigenous wisdom, regenerative agriculture, conscious food systems, and the beautiful new story of Africa that he and his team embody.\nLucy Fleetwood\nLucy Fleetwood\n· 2nd\nSecond degree connection\nHelping you get Back to Balance | Solution Focused NSDR | Ayurveda | In-house Coaching Surgeries | Stress | Burnout | Resilience | Trauma | sleep | lucyfleetwood.com\nHelping you get Back to Balance | Solution Focused NSDR | Ayurveda | In-house Coaching Surgeries | Stress | Burnout | Resilience | Trauma | sleep | lucyfleetwood.com\nKonkankoh is a man of real integrity. We connected through the Association of Sustainability Practitioners and he was doing good work in his country, to bring benefit to those around him.\nKonkankoh is a man of real integrity. We connected through the Association of Sustainability Practitioners and he was doing good work in his country, to bring benefit to those around him.\nShow all 13 received\nPublications\nPublications\nGender & Social development Intercultural Consultancy\nGender & Social development Intercultural Consultancy\nKonkankoh · May 2, 2013\nKonkankoh · May 2, 2013\nShow publication\nAs relay operator of Global Eco Village Network, I offer Intercultural Consultancy services to People and organizations interested in Africa, to build communities and connect others, living, networking and telling the new stories.\nAlso for adapting small-scale technologies through Permaculture; helping rural women to raise their status and increase their income and education.\nAs relay operator of Global Eco Village Network, I offer Intercultural Consultancy services to People and organizations interested in Africa, to build communities and connect others, living, networking and telling the new stories. Also for adapting small-scale technologies through Permaculture; helping rural women to raise their status and increase their income and education.\nOther authors\nOther authors\nBetter World Charter\nBetter World Charter\nKonkankoh · Jan 1, 2013\nKonkankoh · Jan 1, 2013\nShow publication\nBETTER WORLD CAMEROON\n CHARTER\n\nWE WORK FOR THE BETTERMENT OF AFRICA THROUGH PERMACULTURE PRACTICE (THE ART OF LIVING WITH NATURE), SERVICE DELIVERY TO AGRI BUSINESS & ENVIRONMENTAL PROTECTION.\nAt Better World Cameroon we are creating a social movement that will help end youth unemployment and enhance sustainable development in Africa. We recruit unemployed young graduates as volunteers into our Non Formal Education and Appropriate Technology Centers (Eco Villages) and mold them into sustainable agricultural technicians and Green Job Corps.\nBETTER WORLD CAMEROON CHARTER WE WORK FOR THE BETTERMENT OF AFRICA THROUGH PERMACULTURE PRACTICE (THE ART OF LIVING WITH NATURE), SERVICE DELIVERY TO AGRI BUSINESS & ENVIRONMENTAL PROTECTION. At Better World Cameroon we are creating a social movement that will help end youth unemployment and enhance sustainable development in Africa. We recruit unemployed young graduates as volunteers into our Non Formal Education and Appropriate Technology Centers (Eco Villages) and mold them into sustainable agricultural technicians and Green Job Corps.\nOther authors\nOther authors\nShow all 3 publications\nCourses\nCourses\nBusiness Management\nBusiness Management\nAssociated with Advanced School of Mass Communication, Younde ; Centre for Alternative Technology, Wales.Cameroon.\nAssociated with Advanced School of Mass Communication, Younde ; Centre for Alternative Technology, Wales.Cameroon.\nClimate Change Mitigation and Adapatation\nClimate Change Mitigation and Adapatation\nAssociated with Advanced School of Mass Communication, Younde ; Centre for Alternative Technology, Wales.Cameroon.\nAssociated with Advanced School of Mass Communication, Younde ; Centre for Alternative Technology, Wales.Cameroon.\nShow all 16 courses\nHonors & awards\nHonors & awards\nCustodian Bafut Culture/Member Ring of Power/Spiritual Activist Defend the Sacred Alliance/Black Liberation Community Development\nCustodian Bafut Culture/Member Ring of Power/Spiritual Activist Defend the Sacred Alliance/Black Liberation Community Development\nIssued by Institute for Global Peace Work · Aug 2014\nIssued by Institute for Global Peace Work · Aug 2014\nAssociated with Bafut Ecovillage\nAssociated with Bafut Ecovillage\nCreating Peace knowledge\nCreating Peace knowledge\nLanguages\nLanguages\nBafut\nBafut\nProfessional working proficiency\nProfessional working proficiency\nEnglish\nEnglish\nFull professional proficiency\nFull professional proficiency\nShow all 4 languages\nOrganizations\nOrganizations\nGlobal Eco Village Network\nGlobal Eco Village Network\nDec 2011 - Present\nDec 2011 - Present\nAssociated with Bafut Eco Village Vision 2020\nAssociated with Bafut Eco Village Vision 2020\nOffer Eco Village Design Education for Sustainable Development, Gaia Courses,\nTraining seminars on how to educate for change and the design of Sustainable Development Projects for improving local economies.\nBetter World Cameroon Anchoring Youth to Cultural & Ecological Heritage-see \"Ndanifor Permaculture Eco Village on GENAfrica website.\nOffer Eco Village Design Education for Sustainable Development, Gaia Courses, Training seminars on how to educate for change and the design of Sustainable Development Projects for improving local economies. Better World Cameroon Anchoring Youth to Cultural & Ecological Heritage-see \"Ndanifor Permaculture Eco Village on GENAfrica website.\nInterests\nInterests\nTop Voices\nTop Voices\nCompanies\nCompanies\nGroups\nGroups\nNewsletters\nNewsletters\nSchools\nSchools\nGary Burnison\nGary Burnison\n· 3rd\nThird degree connection\nChief Executive Officer at Korn Ferry\nChief Executive Officer at Korn Ferry\n150,844 followers\n150,844 followers\nFollow\nAlistair Cox\nAlistair Cox\n· 3rd\nThird degree connection\nFormer Chief Executive, Hays plc\nFormer Chief Executive, Hays plc\n215,166 followers\n215,166 followers\nFollow\nShow all Top Voices\nCauses\nCauses\nArts and Culture • Children • Civil Rights and Social Action • Economic Empowerment • Education • Environment • Poverty Alleviation • Science and Technology • Social Services • Health • Human Rights • Politics\nArts and Culture • Children • Civil Rights and Social Action • Economic Empowerment • Education • Environment • Poverty Alleviation • Science and Technology • Social Services • Health • Human Rights • Politics\nMore profiles for you\nMore profiles for you\nDan Greenwald\nDan Greenwald\n· 2nd\nSecond degree connection\nCEO/Chief Creative Officer White Rhino\nCEO/Chief Creative Officer White Rhino\nFollow\nHeide Maria Baden\nHeide Maria Baden\n· 1st\nFirst degree connection\nData Scientist | Eco Consultant | Biodiversity Champion | Botanical Researcher\nData Scientist | Eco Consultant | Biodiversity Champion | Botanical Researcher\nMessage\nAisha Marzuki\nAisha Marzuki\n· 2nd\nSecond degree connection\nCo-shaping Regenerative Futures | Innovation and Foresight | Post-Growth Fellow\nCo-shaping Regenerative Futures | Innovation and Foresight | Post-Growth Fellow\nFollow\nSonita Mbah\nSonita Mbah\n· 2nd\nSecond degree connection\nFacilitator, Manager, Consultant @ Regenerative Community, Permaculture\nFacilitator, Manager, Consultant @ Regenerative Community, Permaculture\nFollow\nTrimita Chakma\nTrimita Chakma\n· 2nd\nSecond degree connection\nIndigenous Feminist Researcher & Organiser. Specialised in FPAR and MEL.\nIndigenous Feminist Researcher & Organiser. Specialised in FPAR and MEL.\nConnect\nShow all\nExplore Premium profiles\nExplore Premium profiles\nPatrick McKeague\nPatrick McKeague\nPatrick McKeague\n· 3rd\nThird degree connection\nFounder and Product Manager at XYZ Homework Founder and Publisher at Varsity Learning\nFounder and Product Manager at XYZ Homework Founder and Publisher at Varsity Learning\nMessage\nJanelle Saint-Eloi\nJanelle Saint-Eloi\n· 3rd\nThird degree connection\nCreative Entrepreneur | Work-Life Architect | Creating Systems for Sustainable Success\nCreative Entrepreneur | Work-Life Architect | Creating Systems for Sustainable Success\nMessage\nMatthew Gouwens\nMatthew Gouwens\n· 3rd\nThird degree connection\nCEH (Chief Executive Hopster) / Owner at Hop Farm Brewing Company\nCEH (Chief Executive Hopster) / Owner at Hop Farm Brewing Company\nMessage\nPeople you may know\nPeople you may know\nChristopher Egert\nChristopher Egert\nProfessor, School of Interactive Games and Media at Rochester Institute of Technology\nProfessor, School of Interactive Games and Media at Rochester Institute of Technology\nConnect\nMatt Huenerfauth\nMatt Huenerfauth\nDean at Rochester Institute of Technology\nDean at Rochester Institute of Technology\nConnect\nStephanie Ludi\nStephanie Ludi\nStephanie Ludi\nProfessor, Associate Dean for Academic Affairs, College of Engineering, University of North Texas\nProfessor, Associate Dean for Academic Affairs, College of Engineering, University of North Texas\nConnect\nNeeraj Buch\nNeeraj Buch\nDean and Associate Provost at Rochester Institute of Technology\nDean and Associate Provost at Rochester Institute of Technology\nConnect\nMichael Laver\nMichael Laver\nProfessor of History at Rochester Institute of Technology\nProfessor of History at Rochester Institute of Technology\nConnect\nShow all\nYou might like\nYou might like\n\nPages for you\nPages for you\n\nNature Investment Hub\nNature Investment Hub\nNon-profit Organizations\nNon-profit Organizations\n2,322 followers\n2,322 followers\n54 connections follow this page\nFollow\nWorld Vision East Asia\nWorld Vision East Asia\nNon-profit Organizations\nNon-profit Organizations\n2,007 followers\n2,007 followers\n3 connections follow this page\nFollow\nShow all\nStatus is online\nMessaging\nYou are on the messaging overlay. Press enter to open the list of conversations.\nCompose message\nYou are on the messaging overlay. Press enter to open the list of conversations."
  }
}