{
  "url": "https://www.linkedin.com/in/kaluki-paul-mutuku%F0%9F%95%8A-2a8400105/",
  "scraped_at": "2025-10-27T15:58:58.248997",
  "extracted": {
    "name": "Kaluki Paul Mutuku🕊",
    "headline": "2x Founder | Consultant | Visionary | Events Host & Moderator 🔟 yrs in: Nature-based Solutions🌱|Restoration Projects🌳|Impact Storytelling🗣|Advocacy🌍 Currently: Philanthropy 🌐 | Movements support✨️",
    "full_text": "0 notifications total\nSkip to search\nSkip to main content\nKeyboard shortcuts\nClose jump menu\nnew feed updates notifications\nHome\nMy Network\nJobs\nMessaging\n1\n1 new notification\nNotifications\nMe\nFor Business\nAdvertise\ntest\nKaluki Paul Mutuku🕊 \n  \n1st degree connection\n1st\n2x Founder | Consultant | Visionary | Events Host & Moderator 🔟 yrs in: Nature-based Solutions🌱|Restoration Projects🌳|Impact Storytelling🗣|Advocacy🌍 Currently: Philanthropy 🌐 | Movements support✨️\nUMI Fund\nUniversity of Nairobi\nNairobi County, Kenya  Contact info\n11,802 followers \n500+ connections\nErica Gies, Ananda Fitzsimmons, and 275 other mutual connections\nErica Gies, Ananda Fitzsimmons, and 275 other mutual connections\nMessage\nMore\nHighlights\nHighlights\n4 mutual groups\n4 mutual groups\nYou and Kaluki Paul are both in Philanthropy Network, Nature-Based Solutions, and 2 others\nYou and Kaluki Paul are both in Philanthropy Network, Nature-Based Solutions, and 2 others\nAbout\nAbout\nLinkedIn most definitely wants me to tell you what I'm great at. Honestly, I'd rather tell you who I am.\n\nI am a stubborn optimist and proud son of the Afrikan soil. Yes, as a climate advocate and restoration expert, I centre optimism, courage and meaningful engagement of communities and youth who are leading the solutions for both the climate and biodiversity crises. Hope is a tiny seed 🫘 that thrives through care and nurturing, and when embraced among people, becomes a strong, towering tree 🌳 that gives life, a story that transcends generations.\n\nI love to work with grassroots, intentional stakeholders and to platform their efforts for global amplification. Clearly, the peoples are leading the works, so then why can't we work with them, co-create the solutions and genuinely support their course? I set up Earth Now Media as a decentralised digital studio to inform, impact and influence how we shape narratives, and therefore how the narratives can usher in a new wave of solidarity, trust building and enhancing community leadership in driving diverse solutions. We have to courageously own our authentic narratives, and tell them with the dignity deserved, so as to be the change we seek to see. \n\nI am learning to regeneratively restore landscapes, work with smallscale farmers to safeguard our food systems & save our indigenous seeds systems with the wisdom that has been passed down generations. These are living libraries & real science that can transform our food systems, build resilient ecosystems and revitalise our soils. \n\nNature is my go-to place to recharge & get grounded in the wildness, calm, harmony & sounds harboured in the soul of ecosystems. Nature is kind, genuine, a healer and dynamic. A lot that we can emulate from her.\n\nI am a son, brother & future ancestor to earth, using my scientific background, storytelling & communications skills to offer alternative views of a better world for all. I am keen to exemplify that as a species, we're merely stewards of care & no greater than the tiniest components of the rest of creation. I mentor youth - the next generation of world leaders, in ways they can feel more resourced, empowered & supported to lead the desired change. \n\nWorking with nature without the singular focus on financial gain can embrace complexities of ecosystems, support the leadership of communities & leave lasting marks of transformation, as we thrive with her across generations. Let's sow seeds of hope, resilience and solidarity in our journeys to heal mother nature. Let's go back to the roots. \n\nA better world is possible 🌍🌱✨️.\nLinkedIn most definitely wants me to tell you what I'm great at. Honestly, I'd rather tell you who I am. I am a stubborn optimist and proud son of the Afrikan soil. Yes, as a climate advocate and restoration expert, I centre optimism, courage and meaningful engagement of communities and youth who are leading the solutions for both the climate and biodiversity crises. Hope is a tiny seed 🫘 that thrives through care and nurturing, and when embraced among people, becomes a strong, towering tree 🌳 that gives life, a story that transcends generations. I love to work with grassroots, intentional stakeholders and to platform their efforts for global amplification. Clearly, the peoples are leading the works, so then why can't we work with them, co-create the solutions and genuinely support their course? I set up Earth Now Media as a decentralised digital studio to inform, impact and influence how we shape narratives, and therefore how the narratives can usher in a new wave of solidarity, trust building and enhancing community leadership in driving diverse solutions. We have to courageously own our authentic narratives, and tell them with the dignity deserved, so as to be the change we seek to see. I am learning to regeneratively restore landscapes, work with smallscale farmers to safeguard our food systems & save our indigenous seeds systems with the wisdom that has been passed down generations. These are living libraries & real science that can transform our food systems, build resilient ecosystems and revitalise our soils. Nature is my go-to place to recharge & get grounded in the wildness, calm, harmony & sounds harboured in the soul of ecosystems. Nature is kind, genuine, a healer and dynamic. A lot that we can emulate from her. I am a son, brother & future ancestor to earth, using my scientific background, storytelling & communications skills to offer alternative views of a better world for all. I am keen to exemplify that as a species, we're merely stewards of care & no greater than the tiniest components of the rest of creation. I mentor youth - the next generation of world leaders, in ways they can feel more resourced, empowered & supported to lead the desired change. Working with nature without the singular focus on financial gain can embrace complexities of ecosystems, support the leadership of communities & leave lasting marks of transformation, as we thrive with her across generations. Let's sow seeds of hope, resilience and solidarity in our journeys to heal mother nature. Let's go back to the roots. A better world is possible 🌍🌱✨️.\nTop skills\nTop skills\nNature-based Solutions expert • Impact Storytelling Trainer\nNature-based Solutions expert • Impact Storytelling Trainer\nFeatured\nFeatured\nPost\nPost\nWhen God decides to prepare tables for you to dine with kings and queens, you'll be surprised by just how high & rewarding the tables will be.\n\nI started Earth Now Media under 1 year ago, and in that short period, I have seen God manifest in so many ways. Opportunity after another opening for me, just because I made the difficult & daring decision to bring this vision to life, most times using the small finances at my disposal and leveraging the power of the intentional community that has been supportive of my journey.\n\nJust this June, I had the absolute rare pleasure to host the former vice president of the USA, Al Gore, Founder & Chairman of The Climate Reality Project. Al Gore has done incredible work in influencing climate action and investments for years. He has been a loud voice on what has to be done amidst the polycrisis.\n\nSo, when I got a formal invitation to host Al Gore at the Climate Reality's Nairobi tour Training, I was met with so many feelings, but one particular feeling was that I had to say a big YES, and to deliver this event in a stellar moderation and hosting that befits the occasion. And tell you what, even I was surprised that I could host and moderate a full day's programming, with humour, fun, scientific facts, and my own lived experiences in climate justice and environmental leadership. Of course, I've hosted events and moderated forums before, but this one felt different, due to it's intergenerational nature and scope regarding climate leadership. \n\nI am grateful to God, and to every person who has gone before me, believed in my capabilities and actually trusted me to deliver some good magic for their events and programs. And to the climate reality global and regional families, most especially the team behind the Nairobi training, a very big thank you for the honour of bringing out in me this ​not-so-new skill after all. I hope to continue learning, growing and thriving in the space, and delivering high-level, real & dignified hosting and moderation.\n\nTo add a cherry on top of the cake, I am officially a trained climate reality leader. Thanks so much The Climate Reality Project African Climate Reality Project Climate Reality Canada | Réalité climatique Canada Climate Reality Leadership Corps for this 🙌.\n\nIt was an honour to share the space and host key leaders across the continent and globally, ranging from Wanjira Mathai, Rebekah Shirley, Ph.D., Yvonne Nyokabi Gachugi - Nzomo, Ali Modammed Office of Kenya's Special Envoy for Climate Change, Omar Elmawi Rayah Ahmed, Dr Ezekiel, Phyllis Cuttino, ChezaCheza Dance Foundation & the wealth of climate leaders tuning in >700, thronging the venue across the day.\n\nFor you who may have doubted what this stubborn optimist + proud son of the Afrikan soil can do, this is your cue to give me that gig & let me show you how it's done. I'll bring you a fresh perspective & an authentic host personality that will spark more conversations towards solutions.\n \nA luta continua✊🏾🌍✨️🌱\n459\n93 comments\nLink\nLink\nEarth Now Media - Subscribe & join our growing community \nEarth Now Media - Subscribe & join our growing community \nYouTube\nYouTube\nLink\nLink\nClimate Change: Why Kenya & The World Must Do Better - Kaluki Paul Mutuku\nClimate Change: Why Kenya & The World Must Do Better - Kaluki Paul Mutuku\nYouTube\nYouTube\nPost\nPost\n✨️🕊Finishing the Good Fight! 🌱🌍💪🏽\n\nMonths back in 2023, INUKA Afrika_ launched as a pilot accelerator project for youth leaders working on Nature-based Solutions (NbS) projects in their communities, and at landscape level. Our aim: to make a case on how NbS can truly work for biodiversity, communities and livelihoods \n\nThrough undertaking well designed INUKA curriculum trainings, we went across different landscapes and communities, training, learning with and mentoring the youth in INUKA project, skilling and building their capacities to enhance their landscapes and seascapes restoration works, build stronger communities and develop a legacy for youth-led restoration, and set stage for Afrika and Global Youth restoration leadership. \n\nSo last week I had the honor to witness what I started as a dream, an ambitious project ideation in 2020, see its final impact training on NbS in Agriculture and Impact storytelling, and of course having the honor to lead and deliver the trainings has been worthwhile. These trainings have inspired me to keep going, even as I continue to mentor and Nurture more youth leaders in restoration \n\nFind my reflections in the comments section below but in summary I mention; lessons learnt, intentional partnerships, funding youth and communities, Design thinking in project development, and Media role in communicating impact.\n\nI can say a lot but for now, I want to say it has been real serving in this capacity. The works has INUKA Afrika, an authentic project that puts resources, skills and practice in young people and their communities, to transform themselves and restore their landscapes and seascapes. I will remain available as the Visionary and advisor for this and many other impact projects for youth, in Afrika 🌍 and indeed across the world 🌎. To my fellow trainers, partners and support systems, blessings in all you do!\n\nI am moving on to my next big thing in Afrika, and I leave my staff role at Youth4Nature as a proud son of the Afrikan soil. Afrika is my pride, and I shall always challenge the status quo so as to get authentic narratives into the world. Thanks for all funding support from ClimateWorks Foundation, this work has been made possible in immense ways ✨️🌱🌍💚\n\nLastly, I will continue to offer Consultancies in Nature-based Solutions (NbS), Impact Storytelling, Advocacy and Community Development. Let's interact and reach out to me for more information. \n\nViva Afrika🌱✨️🌍\nA luta continua 💪🏽🌍\n199\n19 comments\nExperience\nExperience\nYouth Programme Coordinator \nYouth Programme Coordinator \nUMI Fund · Full-time\nUMI Fund · Full-time\nSep 2025 - Present · 2 mos\nSep 2025 to Present · 2 mos\nRemote\nRemote\nEarth Now Media\nEarth Now Media\nFreelance · 1 yr 2 mos\nFreelance · 1 yr 2 mos\nAfrika\nAfrika\nFounder\nFounder\nSep 2024 - Present · 1 yr 2 mos\nSep 2024 to Present · 1 yr 2 mos\nFounder + Executive Producer\nFounder + Executive Producer\nSep 2024 - Aug 2025 · 1 yr\nSep 2024 to Aug 2025 · 1 yr\nHybrid\nHybrid\nLeading and curating impact communications for Climate, Nature, People and Development.\nLeading and curating impact communications for Climate, Nature, People and Development.\nStorytelling, Team Management and +8 skills\nOfficial trailer - Earth Now Media 🌍🌱\nOfficial trailer - Earth Now Media 🌍🌱\nAdvisor - Global Advisory Panel (GAP)\nAdvisor - Global Advisory Panel (GAP)\nFarm Radio International - Radios Rurales Internationales · Seasonal\nFarm Radio International - Radios Rurales Internationales · Seasonal\nSep 2022 - Sep 2025 · 3 yrs 1 mo\nSep 2022 to Sep 2025 · 3 yrs 1 mo\nRemote\nRemote\nAdvising Farm Radio International, Govt of Canada 🇨🇦 (Global Affairs Canada) and partners on Nature-based Solutions (NbS) programme being implemented across 6 sub-Saharan Afrikan countries including On-Air Dialogues (OAD), community-led NbS projects, impact documentaries and linkages to decision making and policy suggestions.\nAdvising Farm Radio International, Govt of Canada 🇨🇦 (Global Affairs Canada) and partners on Nature-based Solutions (NbS) programme being implemented across 6 sub-Saharan Afrikan countries including On-Air Dialogues (OAD), community-led NbS projects, impact documentaries and linkages to decision making and policy suggestions.\nNature-based Solutions expert and Expert Advisor\nProgram Manager\nProgram Manager\nAfrika Youth Caravan · Part-time\nAfrika Youth Caravan · Part-time\nSep 2021 - Aug 2025 · 4 yrs\nSep 2021 to Aug 2025 · 4 yrs\nKenya · On-site\nKenya · On-site\nFundraising, Planning, Managing and Logistics support for the Afrika Youth Caravan to UNFCCC COPs program, an initiative of the Kheri Environmental Action Network(KEAN International).\n\nThe Caravan seeks to meaningfully resource and support inspiring Afrikan Youth, whose voices have oftentimes been locked out, and actually support them to attend the COP. Through amplifying their stories, storytelling, delegation planning and at-COP programming, we empower them to bring their solutions to the climate conferences, and further get inspired to do more.\nFundraising, Planning, Managing and Logistics support for the Afrika Youth Caravan to UNFCCC COPs program, an initiative of the Kheri Environmental Action Network(KEAN International). The Caravan seeks to meaningfully resource and support inspiring Afrikan Youth, whose voices have oftentimes been locked out, and actually support them to attend the COP. Through amplifying their stories, storytelling, delegation planning and at-COP programming, we empower them to bring their solutions to the climate conferences, and further get inspired to do more.\nTeam Management, Logistics Management and +8 skills\nExecutive Director\nExecutive Director\nKEAN International · Part-time\nKEAN International · Part-time\nJun 2020 - Aug 2025 · 5 yrs 3 mos\nJun 2020 to Aug 2025 · 5 yrs 3 mos\nKenya · Hybrid\nKenya · Hybrid\nI managed the day-to-day running and programming of KEAN International. Through team coordination, partnerships, and community leadership, I led the strategic visioning and administration for the organisation. \n\nI oversaw the development, communications, fundraising and community engagement departments, and facilitated a reciprocal structure for members.\nI managed the day-to-day running and programming of KEAN International. Through team coordination, partnerships, and community leadership, I led the strategic visioning and administration for the organisation. I oversaw the development, communications, fundraising and community engagement departments, and facilitated a reciprocal structure for members.\nTeam Management, Budgeting and +7 skills\nShow all 17 experiences\nEducation\nEducation\nUniversity of Nairobi\nUniversity of Nairobi\nBachelor of Science - Bsc, Environmental Conservation and Natural Resource Management\nBachelor of Science - Bsc, Environmental Conservation and Natural Resource Management\n2013 - 2017\n2013 - 2017\nLicenses & certifications\nLicenses & certifications\n2025 GYCT Certificates\n2025 GYCT Certificates\n2025 GYCT Certificates\nUnited Latino Students Association\nUnited Latino Students Association\nIssued Sep 2025\nIssued Sep 2025\nCredential ID 125c0412-662e-41e3-b986-6fe0eb21f68b\nCredential ID 125c0412-662e-41e3-b986-6fe0eb21f68b\nShow credential\nClimate Reality Leaders, 2025\nClimate Reality Leaders, 2025\nClimate Reality Leaders, 2025\nUnited Latino Students Association\nUnited Latino Students Association\nIssued Jun 2025\nIssued Jun 2025\nCredential ID 8617f38e-0211-41c6-b585-7ec66f10539e\nCredential ID 8617f38e-0211-41c6-b585-7ec66f10539e\nShow credential\nShow all 4 licenses & certifications\nProjects\nProjects\nINUKA Afrika\nINUKA Afrika\nJan 2021 - Dec 2023\nJan 2021 - Dec 2023\nAssociated with Youth4Nature\nAssociated with Youth4Nature\nA Nature-based Solutions youth accelerator project piloted in Kenya, to explore what it means when we resource youth leaders and communities implementing restoration projects in their localities. As the visionary and project director, I developed this project with intentional programming, fundraising and inclusivity to allow all teams involved have a sense of agency, empowerment and be charged to lead.\n\nThrough on-the-ground field exchanges and trainings across landscapes, to impact storytelling trainings, mentorship and community learning, microgrants and resourcing, and a robust media amplification and impact campaign, I stewarded the project across the years. \n\nThe pilot successfully concluded, and, while I moved on from my engagements at my then employer, the scope and nature of INUKA Afrika is global, and currently the teams in charge are in the scale up phases into several Afrikan countries, and eventually roll outs globally. \n\n\nLessons:\nYouth and communities need flexible, unrestricted and sustainable resourcing, including finances, human resources and knowledge resources.\n\nStorytelling is a key tool in shifting narratives and amplification of what grassroots are doing.\n\nExchange and field based practical trainings are vital to helping youth and communities connect, share value and implement their projects better.\n\nFunding institutions should allow youth to incorporate social enterprising as a pathway towards sustainability and income generation linked to their restoration works. This way, they build their capacity and get resource empowerment that reduces fear and anxiety, and allows them to continue delivering Solutions even beyond grant availabilities. \n\nDiversity and inclusion is key. Work with teams and partners across sectors. Allyshio is about recognising the power of the whole, and embracing our different strengths towards our shared vision. INUKA Afrika lived that reality.\nA Nature-based Solutions youth accelerator project piloted in Kenya, to explore what it means when we resource youth leaders and communities implementing restoration projects in their localities. As the visionary and project director, I developed this project with intentional programming, fundraising and inclusivity to allow all teams involved have a sense of agency, empowerment and be charged to lead. Through on-the-ground field exchanges and trainings across landscapes, to impact storytelling trainings, mentorship and community learning, microgrants and resourcing, and a robust media amplification and impact campaign, I stewarded the project across the years. The pilot successfully concluded, and, while I moved on from my engagements at my then employer, the scope and nature of INUKA Afrika is global, and currently the teams in charge are in the scale up phases into several Afrikan countries, and eventually roll outs globally. Lessons: Youth and communities need flexible, unrestricted and sustainable resourcing, including finances, human resources and knowledge resources. Storytelling is a key tool in shifting narratives and amplification of what grassroots are doing. Exchange and field based practical trainings are vital to helping youth and communities connect, share value and implement their projects better. Funding institutions should allow youth to incorporate social enterprising as a pathway towards sustainability and income generation linked to their restoration works. This way, they build their capacity and get resource empowerment that reduces fear and anxiety, and allows them to continue delivering Solutions even beyond grant availabilities. Diversity and inclusion is key. Work with teams and partners across sectors. Allyshio is about recognising the power of the whole, and embracing our different strengths towards our shared vision. INUKA Afrika lived that reality.\nBudgeting, Supervisory Skills and +8 skills\nINUKA — Youth4Nature\nINUKA — Youth4Nature\nVolunteering\nVolunteering\nNairobi City Park and the Nairobi river Clean Ups\n Nairobi City Park and the Nairobi river Clean Ups\n Nairobi City Park and the Nairobi river Clean Ups\nUniversity of Nairobi(Chiromo Environmental Awareness Club) \nUniversity of Nairobi(Chiromo Environmental Awareness Club) \nEnvironment\nEnvironment\nVendor liaison Volunteer\nVendor liaison Volunteer\nPawa254\nPawa254\nDec 2015 - Dec 2016 · 1 yr 1 mo\nDec 2015 - Dec 2016 · 1 yr 1 mo\nArts and Culture\nArts and Culture\nShow all 3 volunteer experiences\nCourses\nCourses\nCompassionate Integrity Training\nCompassionate Integrity Training\nDecent Work through Nature-based Solutions\nDecent Work through Nature-based Solutions\nShow all 4 courses\nLanguages\nLanguages\nEnglish\nEnglish\nSwahili\nSwahili\nCauses\nCauses\nAnimal Welfare • Arts and Culture • Children • Civil Rights and Social Action • Economic Empowerment • Education • Environment • Health • Human Rights • Poverty Alleviation • Science and Technology\nAnimal Welfare • Arts and Culture • Children • Civil Rights and Social Action • Economic Empowerment • Education • Environment • Health • Human Rights • Poverty Alleviation • Science and Technology\nMessaging\nYou are on the messaging overlay. Press enter to open the list of conversations.\nCompose message\nYou are on the messaging overlay. Press enter to open the list of conversations."
  }
}