{
  "url": "https://www.linkedin.com/in/pennyheiple/",
  "scraped_at": "2025-10-27T16:09:04.169137",
  "extracted": {
    "name": "Penny L. Heiple",
    "headline": "Co-Founder Design School for Regenerating Earth",
    "full_text": "0 notifications total\nSkip to search\nSkip to main content\nKeyboard shortcuts\nClose jump menu\nnew feed updates notifications\nHome\nMy Network\nJobs\nMessaging\n2\n2 new notifications\nNotifications\nMe\nFor Business\nAdvertise\ntest\nPenny L. Heiple \n She/Her  \n1st degree connection\n1st\nCo-Founder Design School for Regenerating Earth\nDesign School for Regenerating Earth\nUniversity of Colorado at Boulder\nBarichara, Santander, Colombia  Contact info\n500+ connections\nRobert Chmielinski, Indy Rishi Singh, and 286 other mutual connections\nRobert Chmielinski, Indy Rishi Singh, and 286 other mutual connections\nMessage\nMore\nHighlights\nHighlights\n2 mutual groups\n2 mutual groups\nYou and Penny L. are both in systems thinking network and Regenerative Development Community\nYou and Penny L. are both in systems thinking network and Regenerative Development Community\nAbout\nAbout\nCurrently living in Barichara, Colombia, and a native of Boulder, Colorado, I have a passion for serving life and our beautiful planet Earth. I moved to Colombia to live out my dream of helping to regenerate the earth alongside my life partner, Joe Brewer. Together, we are doing ecosystem restoration work and helping to create a local regenerative economy in our bioregion in and around Barichara. We also co-founded the Design School for Regenerating Earth where we are helping to activate bioregional organizing and facilitating learning journeys and learning exchanges between bioregions across the planet. \n\nI'm passionate about integrating and applying unified science, integral philosophy, regenerative practices, and biodynamic healing and trauma resolution to everything I do. These passions combined with my comprehensive background in operations, project management, accounting, and administration means that I bring a unique combination of heart and organizational expertise to the various initiatives and organizations in which I'm involved. \n\nPlease visit this website to learn more about the Design School for Regenerating Earth:\nhttps://design-school-for-regenerating-earth.mn.co/\n\nPlease visit this website for more information on my healing practice:\nhttps://pennyheiple.com\nCurrently living in Barichara, Colombia, and a native of Boulder, Colorado, I have a passion for serving life and our beautiful planet Earth. I moved to Colombia to live out my dream of helping to regenerate the earth alongside my life partner, Joe Brewer. Together, we are doing ecosystem restoration work and helping to create a local regenerative economy in our bioregion in and around Barichara. We also co-founded the Design School for Regenerating Earth where we are helping to activate bioregional organizing and facilitating learning journeys and learning exchanges between bioregions across the planet. I'm passionate about integrating and applying unified science, integral philosophy, regenerative practices, and biodynamic healing and trauma resolution to everything I do. These passions combined with my comprehensive background in operations, project management, accounting, and administration means that I bring a unique combination of heart and organizational expertise to the various initiatives and organizations in which I'm involved. Please visit this website to learn more about the Design School for Regenerating Earth: https://design-school-for-regenerating-earth.mn.co/ Please visit this website for more information on my healing practice: https://pennyheiple.com\nActivity\nActivity\n\n1,898 followers\n1,898 followers\n\nPosts\nComments\nLoaded 9 Posts posts\nPenny L. Heiple\nPenny L. Heiple\n   • 1st\nVerified • 1st\nCo-Founder Design School for Regenerating Earth\nCo-Founder Design School for Regenerating Earth\n2d • \n \n2 days ago • Visible to anyone on or off LinkedIn\nThe energy that's fueled ecological and cultural overshoot has come from pulling ancient carbon out of the Earth exponentially faster than it was sequestered over millions of years by the daily flows of the sun, soil, and plants.\n\nCarbon energy has also fueled the accumulation and power of fungible currency. Current financial capital is untethered from the biophysical constraints of Earth's capacity.\n\nSays regenerative economist John Fullerton, \"I know that the current economy is driven by finance and if the economic premise of our entire global economy is in conflict with the laws of physics, we have a serious problem.\"\n\nIt’s time for the Great (Re)Turning.\n…more\nBrian Puppa\nBrian Puppa\n • 1st\n1st\nExecutive Director – Legacy Project\nExecutive Director – Legacy Project\nSo much is happening now that it can be very disorienting. People are trying to find their bearings, trying to find a story that makes some sense and can orient them. \n \nThe co-stewards of Bioregional Earth – myself and Legacy Project Founder Susan Bosak, along with Joe Brewer and Penny L. Heiple of the Design School for Regenerating Earth – have been thinking a lot about this, and have written an article together.\n\nWe won't find what we need in the noise. \n \nThere are so many \"theories of change\" and \"transformational ideas\" out there. Somehow we've come to believe that new is better, and abstraction is a higher form of thinking. But then we can't seem to figure out how to implement all the ideas people are generating. It's because we're starting in the wrong place.\n \nWe actually need to start with what's old, and has stood the test of time. And we need to start with what's real, on the ground, right under our feet.\n \nThat's why \"bioregional\" and \"regenerative\" work can't just be the trend of the moment, but has to be understood as living into the story of Bioregional Earth in the context of The Great (Re)Turning.\n \nWe draw on many voices in our latest collaborative article. To quote just one, John Fullerton, this is an \"unfolding, filled with mystery and even magic. It cannot be achieved, only facilitated and participated in.\"\n \nCheck out the whole article about The Great (Re)Turning:\nhttps://lnkd.in/g4puCp-E\n…more\nActivate to view larger image,\nActivate to view larger image,\n2\nPenny L. Heiple reposted this\nDr. Pete Jeffs 🐴\nDr. Pete Jeffs 🐴\n   • 1st\nVerified • 1st\nCultural Ecology / Regeneration & Land healing / Western European Atlantic Coastal BioRegion / Healing Circles & Wildings with Horses / BioRegional educator / StoryMoss\nCultural Ecology / Regeneration & Land healing / Western European Atlantic Coastal BioRegion / Healing Circles & Wildings with Horses / BioRegional educator / StoryMoss\n1w • Edited • \n \n1 week ago • Edited • Visible to anyone on or off LinkedIn\nA really beautiful article about the \nhashtag\n#BirdNations, and particularly about three – the amazing journeys of Pterodroma deserta, the \nhashtag\n#DesertasPetrel; Luscinia megarhynchos, the \nhashtag\n#Nightingale, and Cygnus columbianus bewickii, \nhashtag\n#BewicksSwan. This article recounts their extraordinary journeys. It is a delight. \n\nNext Thursday, 23rd October, 4pm GMT, in the Design School for Regenerating Earth, Elyes Mkacher and myself with the Western European Atlantic Coastal BioRegion will be holding a 1-hour celebration of the \nhashtag\n#BirdNations as BioRegional Ambassadors.\n\nThe \nhashtag\n#BirdNations connect our \nhashtag\n#BioRegions, and whilst we can often spend time \"defining\" those regions, it is important to remember that a BioRegion is never isolated – there may be a watershed or a specific ecozone, but, for example, the Western European Atlantic Coastal BioRegion is deeply connected to the region of the \nhashtag\n#GulfOfMexico, the warm saline waters that will then speed across the Atlantic and warm our region... Many of our \nhashtag\n#BirdNations – as this article beautifully illustrates – migrate from one BioRegion to another, as they overwinter in one region, and oversummer elsewhere. Watching animations of bird migrations enables us to visualise the to-and-fro movements that contribute to our planetary home. \n\nPlease join us in the Design School for Regenerating Earth next Thursday, for this Inter-BioRegional Event. If you would like to join us please use this link. Membership of the school is $5 a month – a truly great $5 for all the amazingness that the School brings together. Your subscription also helps to fund regenerative projects in the School. \n\nDesign School for Regenerating Earth: https://lnkd.in/eWjtzB84\n\nGuardian article: https://lnkd.in/dwJB2wZC\n…more\nActivate to view larger image,\nActivate to view larger image,\n17\n2 comments\n4 reposts\nShow all posts\nExperience\nExperience\nCo-Founder\nCo-Founder\nDesign School for Regenerating Earth · Self-employed\nDesign School for Regenerating Earth · Self-employed\nMar 2023 - Present · 2 yrs 8 mos\nMar 2023 to Present · 2 yrs 8 mos\nIn the Design School for Regenerating Earth, we host online courses on organizational development, landscape restoration, and cooperation. One of our main focuses in the school is facilitating learning exchanges between bioregions doing ecosystem restoration and working to create local living economies in their landscapes. We help to weave dialogues within and between bioregions, and we provide shared language, shared tools, and resources for organizing for regeneration at the landscape scale. \n\nMy work as co-founder includes managing operational activities, finances, administration, technical support, and customer service for the school. In addition, I bring to the school my expertise in project management, community development, prosocial facilitation, biodynamic healing and trauma resolution, unified science, integral philosophy, and regenerative practice. With my comprehensive background in business, finance and project management, I bring a unique combination of heart and organizational expertise to the school.\nIn the Design School for Regenerating Earth, we host online courses on organizational development, landscape restoration, and cooperation. One of our main focuses in the school is facilitating learning exchanges between bioregions doing ecosystem restoration and working to create local living economies in their landscapes. We help to weave dialogues within and between bioregions, and we provide shared language, shared tools, and resources for organizing for regeneration at the landscape scale. My work as co-founder includes managing operational activities, finances, administration, technical support, and customer service for the school. In addition, I bring to the school my expertise in project management, community development, prosocial facilitation, biodynamic healing and trauma resolution, unified science, integral philosophy, and regenerative practice. With my comprehensive background in business, finance and project management, I bring a unique combination of heart and organizational expertise to the school.\nAccounting, Integrative Thinking and +7 skills\nBiodynamic Healing & Trauma Resolution Practitioner\nBiodynamic Healing & Trauma Resolution Practitioner\nBiodynamic Healing & Trauma Resolution Practitioner\nPenny L. Heiple, BS, RCST®, LMT · Self-employed\nPenny L. Heiple, BS, RCST®, LMT · Self-employed\nJan 2002 - Present · 23 yrs 10 mos\nJan 2002 to Present · 23 yrs 10 mos\nBarichara, Santander, Colombia · On-site\nBarichara, Santander, Colombia · On-site\nBiodynamic Healing Practitioner. Autonomic Nervous System Regulation and Biodynamic Bodywork, integrating modalities such as Biodynamic Craniosacral Therapy, Polarity Therapy, Quantum-Touch®, Zen Shiatsu, and Integrative Massage, as well as the application of relevant aspects of unified science and integral philosophy.\n\nPlease visit this website for more information on my healing practice: \n\nhttps://pennyheiple.com\nBiodynamic Healing Practitioner. Autonomic Nervous System Regulation and Biodynamic Bodywork, integrating modalities such as Biodynamic Craniosacral Therapy, Polarity Therapy, Quantum-Touch®, Zen Shiatsu, and Integrative Massage, as well as the application of relevant aspects of unified science and integral philosophy. Please visit this website for more information on my healing practice: https://pennyheiple.com\nPolarity Therapy, Energy Healing and +5 skills\nCo-Owner\nCo-Owner\nCo-Owner\nLive It Now Productions, LLC · Contract\nLive It Now Productions, LLC · Contract\nMay 2020 - Jan 2023 · 2 yrs 9 mos\nMay 2020 to Jan 2023 · 2 yrs 9 mos\nUnited States\nUnited States\nOnline production, community-building and consulting company working in the evolutionary consciousness & regenerative arenas. Operational direction & coordination, project management, accounting & business services, with an interest in developing decentralized governance models based on regenerative principles & practices. Decades of experience in trauma resolution & biodynamic healing are also applied into the spaces I engage in.\n\nLive It Now Productions, LLC, is currently co-creating and/or consulting with the following initiatives:\n\nhttps://globalcoherencepulse.org/\nhttps://islandsofcoherence.net/\nhttps://www.thriveon.com/\nhttps://higherstatusglobal.com\nOnline production, community-building and consulting company working in the evolutionary consciousness & regenerative arenas. Operational direction & coordination, project management, accounting & business services, with an interest in developing decentralized governance models based on regenerative principles & practices. Decades of experience in trauma resolution & biodynamic healing are also applied into the spaces I engage in. Live It Now Productions, LLC, is currently co-creating and/or consulting with the following initiatives: https://globalcoherencepulse.org/ https://islandsofcoherence.net/ https://www.thriveon.com/ https://higherstatusglobal.com\nAccounting, Integrative Thinking and +6 skills\nProject Manager / Community Support / Accountant\nProject Manager / Community Support / Accountant\nResonance Science Foundation · Self-employed\nResonance Science Foundation · Self-employed\nApr 2018 - Aug 2020 · 2 yrs 5 mos\nApr 2018 to Aug 2020 · 2 yrs 5 mos\nUnited States\nUnited States\nProject management, community support, event production and bookkeeping support for the Resonance Academy, an educational community exploring unified science based on the Unified Physics Theory of Nassim Haramein.\nProject management, community support, event production and bookkeeping support for the Resonance Academy, an educational community exploring unified science based on the Unified Physics Theory of Nassim Haramein.\nAccounting, Technical Support and +4 skills\nBusiness Operations Manager\nBusiness Operations Manager\nSchool of Inner Health\nSchool of Inner Health\nMay 2017 - Oct 2018 · 1 yr 6 mos\nMay 2017 to Oct 2018 · 1 yr 6 mos\nDenver, Colorado\nDenver, Colorado\nBusiness Operations Manger for the School of Inner Health, a holistic educational organization based in the Biodynamic Paradigm offering trainings and courses in Biodynamic Craniosacral Therapy and Neurodynamics (Nervous System Dynamics).\nBusiness Operations Manger for the School of Inner Health, a holistic educational organization based in the Biodynamic Paradigm offering trainings and courses in Biodynamic Craniosacral Therapy and Neurodynamics (Nervous System Dynamics).\nAccounting, Operations Management and +3 skills\nShow all 15 experiences\nEducation\nEducation\nUniversity of Colorado Boulder\nUniversity of Colorado Boulder\nBachelor of Arts (B.A.), Philosophy\nBachelor of Arts (B.A.), Philosophy\n2006 - 2008\n2006 - 2008\nColorado School of Energy Studies\nColorado School of Energy Studies\nColorado School of Energy Studies\nCertified Biodynamic Craniosacral & Polarity Therapist\nCertified Biodynamic Craniosacral & Polarity Therapist\n2010 - 2012\n2010 - 2012\n700-hour biodynamic craniosacral therapy certification training.\n110-hour polarity therapy associate practitioner training.\n700-hour biodynamic craniosacral therapy certification training. 110-hour polarity therapy associate practitioner training.\nShow all 7 educations\nLicenses & certifications\nLicenses & certifications\nCertified Quantum-Touch Practitioner\nCertified Quantum-Touch Practitioner\nCertified Quantum-Touch Practitioner\nQuantum-Touch, Inc.\nQuantum-Touch, Inc.\nIssued Nov 2013\nIssued Nov 2013\nAssociate Polarity Therapy Practitioner\nAssociate Polarity Therapy Practitioner\nAssociate Polarity Therapy Practitioner\nColorado School of Energy Studies\nColorado School of Energy Studies\nIssued Nov 2012\nIssued Nov 2012\nShow all 6 licenses & certifications\nVolunteering\nVolunteering\nHeart Circle Facilitation, Finance, Technical Operations, Volunteer Coordination\nHeart Circle Facilitation, Finance, Technical Operations, Volunteer Coordination\nHUMANITY'S TEAM\nHUMANITY'S TEAM\nMar 2015 - Present · 10 yrs 8 mos\nMar 2015 - Present · 10 yrs 8 mos\nCivil Rights and Social Action\nCivil Rights and Social Action\nI volunteered in several areas within Humanity's Team, including IT/Technical support, finance, and volunteer coordinating. Currently, I facilitate Heart Circles for the members of Community Circle.\nI volunteered in several areas within Humanity's Team, including IT/Technical support, finance, and volunteer coordinating. Currently, I facilitate Heart Circles for the members of Community Circle.\nVolunteer\nVolunteer\nVolunteer\nKauai Hospice\nKauai Hospice\nMar 2012 - Sep 2014 · 2 yrs 7 mos\nMar 2012 - Sep 2014 · 2 yrs 7 mos\nSocial Services\nSocial Services\nProvided emotional and holistic healing support to patients & caregivers.\nProvided emotional and holistic healing support to patients & caregivers.\nShow all 8 volunteer experiences\nSkills\nSkills\nSocial Media Marketing\nSocial Media Marketing\nBusiness Operations Manager at School of Inner Health\nBusiness Operations Manager at School of Inner Health\nEndorse\nReceptionist Duties\nReceptionist Duties\n2 experiences across Breckenridge Communications, Inc. and 1 other company\n2 experiences across Breckenridge Communications, Inc. and 1 other company\nEndorse\nShow all 38 skills\nRecommendations\nRecommendations\nRecommend Penny L.\nReceived\nReceived\nGiven\nGiven\nGrace (Rebecca) Rachmany\nGrace (Rebecca) Rachmany\n· 1st\nFirst degree connection\nBioregional Systems Orchestration, DAO and governance expert, entrepreneur, mentor\nBioregional Systems Orchestration, DAO and governance expert, entrepreneur, mentor\nMarch 28, 2025, Grace (Rebecca) worked with Penny L. on the same team\nMarch 28, 2025, Grace (Rebecca) worked with Penny L. on the same team\nPenny's tireless work at the Design School is the foundation that keeps the system running. She is a master of maintaining a positive community vibe, facilitating deep conversations, and taking care of all the little details that keep the system running seamlessly. Penny regularly achieves impossible project outcomes with joy and calm. The best part of working with Penny is that she magically maintains an environment where everyone feels cared for and appreciated for their individual talents and contributions, and everyone feels heard and acknowledged when they experience limitations.\nPenny's tireless work at the Design School is the foundation that keeps the system running. She is a master of maintaining a positive community vibe, facilitating deep conversations, and taking care of all the little details that keep the system running seamlessly. Penny regularly achieves impossible project outcomes with joy and calm. The best part of working with Penny is that she magically maintains an environment where everyone feels cared for and appreciated for their individual talents and contributions, and everyone feels heard and acknowledged when they experience limitations.\nInterests\nInterests\nTop Voices\nTop Voices\nCompanies\nCompanies\nGroups\nGroups\nNewsletters\nNewsletters\nSchools\nSchools\nIoana Hardy - Marketing for Sustainability\nIoana Hardy - Marketing for Sustainability\n· 2nd\nSecond degree connection\n🌍 Value-Based Marketing that fuels impact & growth for impact & sustainability founders I Productise your service & build systems to attract clients consistently I B Corp I LinkedIn Top Voice\n🌍 Value-Based Marketing that fuels impact & growth for impact & sustainability founders I Productise your service & build systems to attract clients consistently I B Corp I LinkedIn Top Voice\n16,190 followers\n16,190 followers\nFollow\nKees Klomp\nKees Klomp\n· 2nd\nSecond degree connection\nActivist Researcher & Developer, Uneconomist, Economic System Change, Existential Economics, Reinventing Business Education \nActivist Researcher & Developer, Uneconomist, Economic System Change, Existential Economics, Reinventing Business Education \n62,290 followers\n62,290 followers\nFollow\nShow all Top Voices\nCauses\nCauses\nAnimal Welfare • Arts and Culture • Civil Rights and Social Action • Economic Empowerment • Education • Environment • Health • Human Rights • Disaster and Humanitarian Relief • Politics • Poverty Alleviation • Science and Technology • Social Services\nAnimal Welfare • Arts and Culture • Civil Rights and Social Action • Economic Empowerment • Education • Environment • Health • Human Rights • Disaster and Humanitarian Relief • Politics • Poverty Alleviation • Science and Technology • Social Services\nMore profiles for you\nMore profiles for you\nSamantha Power\nSamantha Power\n· 1st\nFirst degree connection\nRegenerative Economist, Futurist, Bioregionalist, Co-Founder & Director of the BioFi Project\nRegenerative Economist, Futurist, Bioregionalist, Co-Founder & Director of the BioFi Project\nMessage\nDr. Lyla June Johnston\nDr. Lyla June Johnston\n· 3rd\nThird degree connection\nOrator, musician, scientist\nOrator, musician, scientist\nMessage\nTobias Luthe\nTobias Luthe\n· 2nd\nSecond degree connection\nPhD. Program director and group leader, ETH Zurich. Founding director, MonViso Institute.\nPhD. Program director and group leader, ETH Zurich. Founding director, MonViso Institute.\nConnect\nRalph Thurm\nRalph Thurm\n· 1st\nFirst degree connection\nFounder A|HEAD|ahead, Co-Founder r3.0 & Managing Director OnCommons gGmbH\nFounder A|HEAD|ahead, Co-Founder r3.0 & Managing Director OnCommons gGmbH\nMessage\nBill Baue\nBill Baue\n· 1st\nFirst degree connection\nBioregional Regeneration Steward\nBioregional Regeneration Steward\nMessage\nShow all\nExplore Premium profiles\nExplore Premium profiles\nMatthew Gouwens\nMatthew Gouwens\n· 3rd\nThird degree connection\nCEH (Chief Executive Hopster) / Owner at Hop Farm Brewing Company\nCEH (Chief Executive Hopster) / Owner at Hop Farm Brewing Company\nMessage\nBlue Sheffer\nBlue Sheffer\n· 3rd\nThird degree connection\nCo-founder, School of Song\nCo-founder, School of Song\nMessage\nJanelle Saint-Eloi\nJanelle Saint-Eloi\n· 3rd\nThird degree connection\nCreative Entrepreneur | Work-Life Architect | Creating Systems for Sustainable Success\nCreative Entrepreneur | Work-Life Architect | Creating Systems for Sustainable Success\nMessage\nAustin Hernandez\nAustin Hernandez\nAustin Hernandez\n· 3rd+\n3rd+ degree connection\nEntrepreneur\nEntrepreneur\nMessage\nPeople you may know\nPeople you may know\n\nFrom Penny L.'s school\nFrom Penny L.'s school\n\nBrittany Boettcher\nBrittany Boettcher\n🌍 Social Impact Leader | Climate Philanthropy Strategist | Portfolio & Program Architect | Champion of Equity, Systems Change & Collaborative Innovation\n🌍 Social Impact Leader | Climate Philanthropy Strategist | Portfolio & Program Architect | Champion of Equity, Systems Change & Collaborative Innovation\nConnect\nAndrea Doukakis\nAndrea Doukakis\nSustainability | Efficiency | Program Management\nSustainability | Efficiency | Program Management\nConnect\nGinger Cassady\nGinger Cassady\nExecutive Director at Rainforest Action Network\nExecutive Director at Rainforest Action Network\nConnect\nZoe Welz\nZoe Welz\nPrincipal at Avesta Fund\nPrincipal at Avesta Fund\nConnect\nJeremy Freund\nJeremy Freund\nChief Climate Officer at Wildlife Works - In Defense of People and Planet\nChief Climate Officer at Wildlife Works - In Defense of People and Planet\nConnect\nShow all\nYou might like\nYou might like\n\nNewsletters for you\nNewsletters for you\n\nbiometrio. insights\nbiometrio. insights\nExpert perspectives on biodiversity monitoring, nature-based solutions, nature tech and more. \nExpert perspectives on biodiversity monitoring, nature-based solutions, nature tech and more. \nPublished monthly\nPublished monthly\nbiometrio.earth\nbiometrio.earth\nSubscribe\nResources and Projects Updates\nResources and Projects Updates\nStay up to date with Gaia Education’s latest projects, initiatives, and impact around the world.\nStay up to date with Gaia Education’s latest projects, initiatives, and impact around the world.\nPublished monthly\nPublished monthly\nGaia Education\nGaia Education\nSubscribe\nShow all\nStatus is online\nMessaging\nYou are on the messaging overlay. Press enter to open the list of conversations.\nCompose message\nYou are on the messaging overlay. Press enter to open the list of conversations."
  }
}