{
  "url": "https://www.linkedin.com/in/douglas-sheil-55330a9a/",
  "scraped_at": "2025-10-30T12:21:49.268672",
  "extracted": {
    "name": "Douglas Sheil",
    "headline": "Prof at Wageningen University and Research",
    "full_text": "Douglas Sheil\n\n· 1st\n\nProf at Wageningen University and Research\n\nWageningen, Gelderland, Netherlands\n\n·\n\nContact info\n\nWageningen University and Research\n\nUniversity of Oxford\n\n500+ connections\n\nPhilip, Thomas and 254 other mutual connections\n\nMessage\nHighlights\n\n3 mutual groups\n\nYou and Douglas are both in Environmental Consulting Professionals, Climate Change / ESG Professionals Group, and 1 other\n\nAbout\n\nI am an ecologist, forester and conservationist   \n\nRather than list publications here I will point to other sites that are easier to keep updated. \n\nhttp://scholar.google.com/citations?user=7cXBF9sAAAAJ&hl=en\nhttps://www.researchgate.net/profile/Douglas_Sheil?ev=hdr_xprf\nhttp://www.umb.no/ipm-en/employees/douglas.sheil0\nhttp://ukcatalogue.oup.com/product/9780199285884.do\n\nMany older publications are available at http://www.cifor.org/mla/\n\n\n… more\n\nActivity\n\n5,292 followers\n\nPosts\nComments\nImages\n\nDouglas Sheil \n • 1st\n\nProf at Wageningen University and Research\n\n18h • Edited • \n\nEvidence for the Biotic Pump\n \nIn previous posts I described various aspects of the \"Biotic Pump\" theory (see also refs. 1, 2 -- see comments). In this post I summarize supporting observations. Let me know what I missed. \n \nThe theory explains persistent high rainfall within forested continents—contrasting with the approximately exponential declines seen with distance inland in open regions [1]. It explains why this effect, noted in Siberia's summer, disappears during winters when transpiration ceases [2]. It predicts the erosion of precipitation and reliability following deforestation and land-cover changes, as observed in Brazil and Australia [3,4].\n \nThe theory addresses why untuned climate simulations fail to account for around half of observed Amazonian discharge rates, with general circulation models predicting average rainfalls of ~1.0–1.2 mm/day versus actual ~2.1 mm/day [5]. It explains the atmospheric convergence seen over the Amazon [6,7], and also how these cooler forests pull in winds off a warmer ocean contrary to conventional expectation [8,9]. It explains the abrupt monsoon onsets that conventional climate models fail to replicate [10,11], and predicts the observed high pre-rainfall atmospheric pressure in tropical South America [9]. It also aligns with studies finding that ~70% of Amazon precipitation is transported from outside the region [12,13].\n \nThe mechanisms have relevance beyond vegetation cover. Analyses of tropical tropospheric pressure and temperature profiles reveal that observed spatial and temporal variations in sea level pressure relative to mean tropospheric temperature align more closely with Biotic Pump predictions than with standard models  [14].\n \nThe physical principles also refine cyclone thermodynamics, linking storm power to rainfall measures—consistent with observations of hurricane intensification correlating with condensation rates [15,16]. They connect global circulation power to theory by linking condensation to available energy and observations [17]. More speculatively, the biotic pump illuminates diurnal precipitation cycles and moisture-advection feedbacks along low-level jets, supported by data showing afternoon rainfall peaks over forests tied to transpiration-driven transport [18,8].\n \nThere are various ad-hoc explanations and claims for some of these phenomena. But the Biotic Pump provides a unified explanation.\n\nAnastassia Makarieva\n#WUR #CIFOR #Ecorestoration #BioticPump #ClimateScience #Forests #Deforestation #ClimateModeling #ConservationScience\n… more\n\nPhilip Bogdonoff and 44 others reacted\nPhilip Bogdonoff and 44 others\n\n9 comments\n\n•\n\n7 reposts\n\nLike\nComment\nRepost\nSend\n\nDouglas Sheil \n • 1st\n\nProf at Wageningen University and Research\n\n4d • Edited • \n\nFairy Trees and Fig Spirits—A Halloween Reflection\n \nAs a child in Ireland, I enjoyed paging through nature field guides with their pictures and accounts of birds, wildflowers and shells. I remember finding a copy of W.B. Yeats’s \"Fairy and Folk Tales of the Irish Peasantry\" and finding that he had written, what read like, a field guide to the diversity of Ireland’s unseen beings: fairies, goblins, and other spirits who might bless or curse those who crossed their paths. The presentation was serious and offered a glimpse into an even richer world where there was no clear boundary between natural and supernatural. Even today, there are Irish trees that are protected by their association with spirits.\n \nSuch sensibilities aren’t unique to Ireland. In my research in various parts of the planet, I’ve often found similar beliefs: with trees, forests and landscapes having their own rich folklore and magic. In our recent paper, led by Ditro Wibisono Wardi Parikesit, we explored how an Iban community in West Kalimantan (Indonesian Borneo) see large strangler figs as hosting various types of demons and spirit beings — some benevolent, others unpredictable and dangerous. One, the \"antu grasi\" or hunter ghost, is especially feared and celebrated. Their trees are never cut, and the space around them becomes a refuge for forest wildlife.\n \nFor me that’s what Halloween, or Samhain as it was known in Ireland, celebrates: it is about nature and the moment when the worlds of the living, the dead, and the imagination overlap, and when we acknowledge the spirits that keep the world in balance.\n \nHere is the new article (open access): https://lnkd.in/e4XmNb8n .\n\n#WUR #CIFOR #IndigenousKnowledge #Conservation #Indonesia #Borneo #Biodiversity #Forest #Swidden #land #Halloween #Ireland #Samhain #Ficus\n… more\n\nAse Johannessen, PhD and 21 others reacted\nAse Johannessen, PhD and 21 others\n\n7 comments\n\nLike\nComment\nRepost\nSend\n\nDouglas Sheil reposted this\n\nLiza MURPHY \n • 2nd\n\nExpert in global issues regarding assurance, sustainable commodities,supply chains, design and implementation of market development strategies, biodiversity credits, economic inclusion and multistakeholder engagement.\n\n1w • Edited • \n\nThis is a helpful discussion and a useful reminder that complex problems cannot be discussed, or resolved, with simple slogans.  Fact based information, with appropriate validation are the foundational building blocks of effective solutions.  \nThis paper discusses Vegetable Oil Crops, but it applies to many of the commodities we use. Calling something High Integrity does not make it so - transparent actions and truthful discussion of all the impacts do.  \n\nTick tock folks, tick tock.........\n\n\"Without a balanced, evidence-based assessment of all oil crops and their practices and impacts, consumers and policymakers risk making decisions based on narratives rather than facts.\"\nand\n\"Rather than labeling oils as good or bad, we need approaches that reveal performance on biodiversity, human rights, and land use\"  to this last quote I would add rather than labeling MOST things good or bad.......\nErik Meijaard\n… more\n\nNo oil crop is inherently bad - But our thinking might be.\n\n4 pages\n\n1 / 4\n\n0\n\nJoseph D’Cruz and 16 others reacted\nJoseph D’Cruz and 16 others\n\n3 reposts\n\nLike\nComment\nRepost\nSend\n\nDouglas Sheil \n • 1st\n\nProf at Wageningen University and Research\n\n1w • Edited • \n\nUnpacking Food Oil Prevalence, One Ingredient List at a Time\n \nLikely you’ve heard the claim that palm oil is in over 50% of our supermarket products. It’s a powerful claim and has been widely repeated in various forms and contexts. But have you seen the evidence? Is the claim outdated or perhaps a myth?\n \nOur new study, led by Emily Meijaard, examined this widely repeated claim for selected supermarkets in the UK, the Netherlands, and Australia.  We found that only about 8% of products that are in categories that potentially include vegetable oils, explicitly list palm oil, though up to 40% might contain it nonetheless. \n\nSo was the 50% claim ever justified? We discuss this and related implications in the article. In brief: we need evidence but poor transparency is an obstacle.\n\nThe study is open access here: https://lnkd.in/e7dSqQnE\n\nErik Meijaard Kimberly Carlson @SyahmiZaini\n#PalmOil #Sustainability #MythBusting #EvidenceBasedPolicy #Transparency #SustainableChoices #Research #WUR #IUCN\n… more\n\n27 reactions\n27\n\n1 comment\n\n•\n\n4 reposts\n\nLike\nComment\nRepost\nSend\n\nDouglas Sheil reposted this\n\nThe TreeMap\n\n2,472 followers\n\n1w • \n\n1.14 Million Hectares of Nickel Concessions Now Mapped on Nusantara Atlas\n\nThe TreeMap has recently published the updated nickel mining concession layer on Nusantara Atlas which covers 1.14 million hectares of Indonesia’s terrestrial and coastal zones. This new spatial data offers unprecedented visibility into where nickel extraction rights overlap with forests, wetlands, and marine ecosystems.\n\n Explore the map and its features here:\nhttps://lnkd.in/g3kcMS6A\n\nExplore:\n • which ecosystems are at risk\n • how mining concessions intersect with Indigenous territories\n • how land-use planning must respond to this scale of development\n\nAt Nusantara Atlas we believe that if you can see it, you can act on it. This is especially critical for regions where nickel is expanding rapidly and transparency has often been limited.\n\n#NickelMining #Indonesia\n\n… more\n\nDouglas Sheil and 66 others reacted\nDouglas Sheil and 66 others\n\n2 comments\n\n•\n\n14 reposts\n\nLike\nComment\nRepost\nSend\n\nDouglas Sheil reposted this\n\nMike Shanahan • 2nd\n\nFreelance writer, editor, media and communications advisor\n\n1w • \n\nNew research in Borneo explores how an Iban community’s taboo against harming strangler figs — born of belief in forest spirits — preserves life above and below the canopy, linking belief, ecology and an ancestral sense of reciprocity with nature. I wrote about it here:\nhttps://lnkd.in/eh_TEDEt\nThe research paper is by Ditro Wibisono Wardi Parikesit, Douglas Sheil and colleagues. You can read it here:\n\n\nHow Respect for Forest Spirits Protects Borneo's Strangler Figs — and Its Biodiversity\n\nplanetficus.substack.com\n\nDouglas Sheil and 11 others reacted\nDouglas Sheil and 11 others\n\n2 reposts\n\nLike\nComment\nRepost\nSend\n\nDouglas Sheil \n • 1st\n\nProf at Wageningen University and Research\n\n1w • Edited • \n\nWhich cooking oil should I buy?\n\nIn the supermarket, I'm as bewildered as anyone else. This olive oil? That sunflower oil? That other one claiming \"palm oil free\"? Despite years working with the IUCN Palm Oil Task Force (report here https://lnkd.in/ea55DA-W) and more recently the IUCN Oil Crops Task Force (report https://lnkd.in/ebX9JNsS), I still don’t know and can't find the information I need to make well informed choices. That's a problem.\n \nWhat’s the question?\n\nLikely you have heard stories about the evil of palm oil and the wonders of coconut or olive. Most of these stories focus on the crops not the real villains. Our concern shouldn't be \"which type of oil crop is good or bad?\" but rather for the specific oils we consider buying ... \"how was it produced and what are the implications?\"\n\nIn our new paper (see https://lnkd.in/evFmanDA), by @Erik Meijaard, @Malika Virah-Sawmy, and myself, we challenge the simplified narratives that dominate vegetable oil discussions. The reality? All oil crops can be linked to conservation concerns, to environmental impacts and even in many cases to shocking human rights abuses. It depends where and how they're grown, processed and brought to market.\n \nThe crop isn't the problem but practices are.\n\nSo what’s the solution? Informed decisions should not rely on us doing the searching—that’s hard. Currently most information is simplistic, partial and reflects vested interests. Regulatory and policy interventions are essential to enforce ethical production as the standard rather than the exception. Businesses and governments must also work together to remove barriers that make responsible choices more costly or inaccessible.\n\nWe need transparency across the entire vegetable oil sector, not selective scrutiny of tropical oils while temperate crops get a free pass. We need to look at impact, rights, and governance—not just which plant the oil came from. Until then we're guessing.\n\n#WUR #IUCN #Sustainability #FoodSystems #VegetableOils #PalmOil #Conservation #SupplyChainTransparency\n… more\n\nNiels Werdenberg and 113 others reacted\nNiels Werdenberg and 113 others\n\n16 comments\n\n•\n\n9 reposts\n\nLike\nComment\nRepost\nSend\n\nDouglas Sheil reposted this\n\nErik Meijaard \n • 2nd\n\nManaging Director at Borneo Futures Sdn Bhd\n\n2w • \n\nNow online.\n\nWhat do we really know about oil crops?\n\nHow well does our consumption align with our values?\n\nWhat do product labels not disclose... but should.\n\nHave a look at our provocative essay on this complex issue, and let us know what you think.\n\nDouglas Sheil\n… more\n\nNo oil crop is inherently bad—But our thinking might be\n\ncell.com\n\nRobert Nasi and 31 others reacted\nRobert Nasi and 31 others\n\n1 comment\n\n•\n\n11 reposts\n\nLike\nComment\nRepost\nSend\n\nDouglas Sheil reposted this\n\nKoen van Seijen • Following\n\nManager at Toniic, host of the Podcast Investing in Regenerative Agriculture and Food\n\n2w • \n\n💦 Why fixing #water fixes #carbon?\nWater is at the heart of so many of our planetary challenges from carbon to #biodiversity to #food production. When we restore #watercycles, carbon becomes easier to store, trees can thrive across larger landscapes, and biodiversity rebounds.\nWe often think of these as separate issues, but they’re deeply connected through water. Yet, there’s still a lot of misinformation out there.\nOne of the most common myths is that trees always use water, therefore trees always cost water. It’s true if you plant large eucalyptus stands in dry areas, they can deplete local water tables. But that’s not the whole story.\n\nTrees also create #rain, recycle #moisture, and cool the #land.\nThey can increase #rainfall downwind, enhance #soil infiltration, and sustain streams that would otherwise disappear. We’ve known this for a long time — but we haven’t emphasized it enough. When we see trees as part of the water system, not just as water consumers, we start to understand how restoring vegetation is also restoring the hydrology that sustains life.\nIt’s not trees or water.\nIt’s trees for water. \n\nThe conversation with Douglas Sheil, professor at Wageningen University & Research is now OUT! Find it on your favorite podcast player or on our website in the section PODCASTS or in the submenu of the Water Cycles series.\n… more\n\nAli Bin Shahid and 97 others reacted\nAli Bin Shahid and 97 others\n\n16 comments\n\n•\n\n16 reposts\n\nLike\nComment\nRepost\nSend\n\nDouglas Sheil reposted this\n\nKoen van Seijen • Following\n\nManager at Toniic, host of the Podcast Investing in Regenerative Agriculture and Food\n\n2w • \n\nYes, we’re talking again about #watercycles and this time with Douglas Sheil, Professor of Forest Ecology and Forest Management at Wageningen University & Research, one of the most famous agricultural universities in the world. Why has it been so difficult to get scientific discoveries, like the #bioticpump theory in physics, to enter other fields like #climate science and #forestry? \n\nThis and much more in the new conversation coming out tomorrow afternoon!\n\n\nThomas Ressa and 55 others reacted\nThomas Ressa and 55 others\n\n1 comment\n\n•\n\n4 reposts\n\nLike\nComment\nRepost\nSend\nShow all\nExperience\n\nProf\n\nWageningen University and Research · Full-time\n\nJan 2021 - Present · 4 yrs 10 mos\n\nNetherlands\n\nChair Forest Ecology and Forest Management Group\n\nhttps://www.wur.nl/en/Research-Results/Chair-groups/Environmental-Sciences/Forest-Ecology-and-Forest-Management-Group.htm\n… more\n\nCIFOR - Center for International Forestry Research\n\n27 yrs 10 mos\n\nSenior Research Associate\n\n2008 - Present · 17 yrs 10 mos\n\nBogor, Indonesia\n\nMaintaining collaborations and contributing to new initiatives\n\nResearcher\n\n1998 - 2008 · 10 yrs\n\nIndonesia (field work mainly in Kalimantan and Papua)\n\nLeading multidisciplinary field teams\n\nProfessor\n\nNorwegian University of Life Sciences (NMBU)\n\nDec 2013 - Jan 2021 · 7 yrs 2 mos\n\nÅs\n\nResearch\nTeaching and supervision\n\nAssociate Professor\n\nSouthern Cross University\n\nAug 2012 - Jul 2013 · 1 yr\n\nLismore, NSW, Australia\n\nResearch and teaching\n\nDirector\n\nInstitute for Tropical Forest Conservation (ITFC)\n\nAug 2008 - Jul 2012 · 4 yrs\n\nBwindi Impenetrable National Park, Uganda\n\nLed the research institute (the focus was on student guidance and support and research on applied forest and conservation issues, see http://itfc.org/). \nThe position was administered by the Wildlife Conservation Society (WCS, see http://www.wcs.org) who seconded me to Mbarara University of Science and Technology in Uganda (MUST, see http://www.must.ac.ug/).\n… more\n\nShow all\nEducation\n\nUniversity of Oxford\n\nDoctor of Philosophy (Ph.D.), Tropical ecology\n\n1992 – 1996\n\nDoctor of Philosophy 'D.Phil.'​\nThesis title: The Ecology of Long Term Change in a Ugandan Rain Forest\n\nUniversity of Oxford\n\nMaster's Degree, Forestry and its relation to land use\n\n1988 – 1989\n\nShow all\nSkills\n\nEcology\n\nBiodiversity\n\nShow all\nLanguages\n\nEnglish\n\nNative or bilingual proficiency\n\nFrench\n\nLimited working proficiency\n\nShow all\nInterests\nTop Voices\nCompanies\nGroups\nNewsletters\nSchools\n\nJonathan Haidt \n\n· 2nd\n\nProfessor, NYU Stern School of Business, author of instant #1 NYT bestseller “The Anxious Generation,” “The Coddling of the American Mind,” “The Righteous Mind,” & “Happiness Hypothesis.” Latest research: AfterBabel.com\n\n97,816 followers\n\nFollow\n\nJeffrey Sachs \n\n· 2nd\n\nEconomics professor, bestselling author, innovative educator, UN advisor, and global leader in sustainable development.\n\n0 followers\n\nFollow\n\nPeople also viewed\n\nAnastassia Makarieva\n\n· 1st\n\nResearcher, Physical and Biological Bases of Life Stability\n\nMessage\n\nDavid Gaveau\n\n· 2nd\n\nEnvironmental Scientist, Founder @The TreeMap\n\nConnect\n\nTies van der Hoeven\n\n· 1st\n\nFounder and Creative Director of The Weather Makers - Ecosystem Regeneration!\n\nMessage\n\nAlpha Lo\n\n· 1st\n\nruns Climate Water Project, water researcher, writer and podcaster, water consultant, bringing people together in the regenerative water field, climatewaterproject.substack.com, instagram.com/climatewaterproject\n\nMessage\n\nMarc Ancrenaz\n\n· 2nd\n\nDirector at Hutan - Kinabatangan Orang-utan Conservation Project\n\nConnect\nShow all\n\nExplore premium profiles\n\nMarta Pernas \n\n· 3rd\n\nEntrepreneur, UX/UI designer, and mother of an autistic child. CEO of Marcos Language Apps LLC—on a mission to make a difference for children with language learning challenges.\n\nMessage\n\nSusan Kelly \n\n· 3rd\n\nDriving Innovation in Document Search & Access | President @ MicroSearch | JD, Boston College\n\nMessage\n\nJoshua Ferrazzano \n\n· 3rd\n\nCo-Founder / Managing Partner at World War Seven\n\nMessage\n\nPeople you may know\n\nFrom Douglas's school\n\nTom Evans\n\n· 2nd\n\nSenior Director, Wildlife Conservation Society\n\nConnect\n\nLenny Jenkins \n\n· 2nd\n\nFacilitating removals-only nature-based carbon projects\n\nFollow\n\nBennett Cohen \n\n· 2nd\n\nDirector of US Investment at Fortescue Ventures\n\nConnect\n\nGeoff Davis \n\n· 2nd\n\nImpact Investor | Impact Entrepreneur & CEO | Board Member/Advisor\n\nConnect\n\nTom Mills \n\n· 2nd\n\nClimate Smart Agriculture I Carbon Removal  I Stripe Climate Fellow I Oxford and CEPLMP Alumnus I Responsibly Scaling Carbon Management\n\nConnect\nShow all\n\nYou might like\n\nPages for you\n\nThe Female Quotient\n\nAdvertising Services\n\n775,491 followers\n\nShelley works here\n\nFollow\n\nLockheed Martin\n\nDefense and Space Manufacturing\n\n2,934,847 followers\n\nHarvick & 5 other connections work here\n\nFollow\nShow all\n\nAbout\n\nAccessibility\n\nTalent Solutions\n\nCommunity Guidelines\n\nCareers\n\nMarketing Solutions \n\nPrivacy & Terms\n\nAd Choices\n\nAdvertising\n\nSales Solutions\n\nMobile\n\nSmall Business\n\nSafety Center\n\nLinkedIn Corporation © 2025\n\nQuestions?\n\nVisit our Help Center.\n\nManage your account and privacy\n\nGo to your Settings.\n\nRecommendation transparency\n\nLearn more about Recommended Content.\n\nSelect language\n\nالعربية (Arabic)\nবাংলা (Bangla)\nČeština (Czech)\nDansk (Danish)\nDeutsch (German)\nΕλληνικά (Greek)\nEnglish (English)\nEspañol (Spanish)\nفارسی (Persian)\nSuomi (Finnish)\nFrançais (French)\nहिंदी (Hindi)\nMagyar (Hungarian)\nBahasa Indonesia (Indonesian)\nItaliano (Italian)\nעברית (Hebrew)\n日本語 (Japanese)\n한국어 (Korean)\nमराठी (Marathi)\nBahasa Malaysia (Malay)\nNederlands (Dutch)\nNorsk (Norwegian)\nਪੰਜਾਬੀ (Punjabi)\nPolski (Polish)\nPortuguês (Portuguese)\nRomână (Romanian)\nРусский (Russian)\nSvenska (Swedish)\nతెలుగు (Telugu)\nภาษาไทย (Thai)\nTagalog (Tagalog)\nTürkçe (Turkish)\nУкраїнська (Ukrainian)\nTiếng Việt (Vietnamese)\n简体中文 (Chinese (Simplified))\n正體中文 (Chinese (Traditional))"
  }
}