{
  "url": "https://www.linkedin.com/in/maxime-weidema-82863239/",
  "scraped_at": "2025-10-30T11:43:50.967588",
  "extracted": {
    "name": "Maxime Weidema",
    "headline": "From Ego to Eco | From gray to 🏳️‍🌈",
    "full_text": "Maxime Weidema\n\nShe/Her\n\n· 2nd\n\nFrom Ego to Eco | From gray to 🏳️‍🌈\n\nNetherlands\n\n·\n\nContact info\n\nFreelance\n\n500+\n\nconnections\n\nWessel, Shinta and 1 other mutual connection\n\nConnect\nMessage\nActivity\n\n779 followers\n\nFollow\nPosts\nComments\n\nMaxime Weidema • 2nd\n\nFrom Ego to Eco | \nFrom gray to 🏳️‍🌈\n\n11mo • \n\nTwee weken geleden kreeg ik Rosan Kocken op bezoek, gedeputeerde Noord-Holland met oa portefeuille op natuur en klimaat. We maakten een tour langs positieve projecten waar mensen het heft in eigen hand nemen voor vergroening van buurten; meer groen, biodiversiteit, gezondheid, plezier, schoonheid, gezamenlijkheid... noem maar op. \n\nEr zit best veel energie en motivatie bij allerlei individuen en groepen, maar er is wel ondersteuning nodig vanuit beleidsmakers: faciliteren, makkelijk maken. Dus daar spraken wij over. Je loopt snel vast in regels en bureaucratie als je iets voor mekaar wil krijgen, en dat is demotiverend. Om vanuit mijn werk voor #MeerBomenNu boompjes aan te bieden aan dit soort projecten, gratis en met extra handjes vanuit allerlei kanten, daar zit een soort katalysator, ieders energie wordt vergroot door samen iets concreets voor mekaar te krijgen. Mensen zijn enthousiast over de hoeveelheid boompjes die ze mee krijgen, de hele buurt wordt vervolgens opgetrommeld, de plaatselijk groenbeheerder helpt met een ecologisch plan, de bakker om de hoek regelt koek en taart voor in de pauze.. etc. Zo wordt energie vergroot en ingezet in een praktisch concreet project, waar de hele buurt en de natuur (insecten, e.d.) profijt bij hebben. \nDank voor je bezoek Rosan Kocken, voor je interesse om samen te zoeken naar mogelijkheden hoe we elkaar kunnen helpen, jij kan het een, wij het ander, en hoe dat samen te brengen. Wordt vervolgd! \nEn ondertussen gaan wij door met oogsten en planten van zaailingen, door heel Nederland. Ben je nieuwsgierig? Ga ook een dag mee (met mij) en leer van alles over deze vergroeningsmethode. Stuur mij een bericht of ga naar www.meerbomen.nu\n… more\n\nShow translation\n\nGroen Kapitaal\n\n2,090 followers\n\n11mo • \n\nZaterdag waren we met het team Groen Kapitaal samen met gedeputeerde Rosan Kocken op pad met Meer Bomen Nu. \n\nRosan Kocken: “We zijn als Provincie Noord-Holland partner van MeerBomenNu. Zij verzamelen de overdaad aan jonge struiken en bomen in natuur- en groengebieden, die anders bijvoorbeeld weggemaaid zullen worden. Vervolgens delen zij deze weer uit aan boeren en voedselbossen, of inwoners die sneller hun eigen omgeving willen vergroenen. Hoe tof is dat?! \n\nIk was bij de bomenhub in Hoofddorp: daar komen bomen en struiken van verschillende oogstdagen van verschillende locaties bij elkaar en worden ze tijdelijk opgeslagen, tot ze worden opgehaald om ergens geplant te worden.\n\nMeerBomenNu wordt steeds professioneler en er zijn steeds meer partijen die graag samen willen werken, bewonersinitiatieven, terreinbeheerders, bedrijven en ook steeds meer gemeenten in Noord-Holland (en ook in andere provincies!).\n\nAlles is gereed voor een nieuw plantseizoen. \nIn Noord-Holland worden op deze manier jaarlijks 150.000 bomen en struiken geplant! Ik hoop dat nog veel meer mensen en organisaties aansluiten in deze positieve beweging naar meer bomen, zie alle mogelijkheden op hun website www.meerbomen.nu”\n… more\n\nShow translation\n\n1/4\n\n18 reactions\n18\n\n1 comment\n\nLike\nComment\nRepost\nSend\n\nMaxime Weidema • 2nd\n\nFrom Ego to Eco | \nFrom gray to 🏳️‍🌈\n\n1yr • Edited • \n\n🌱De aanmelding is open voor Het Groene Traineeship vanaf deze herfst. Voor iedereen tussen 16 en 29 jaar: ga mee de natuur in en vergroen je omgeving, kom op voor de rechten van de natuur en inspireer en betrek anderen! \n\nMet MeerBomenNu zijn we onderdeel van het groen traineeship en begeleid ik een groep in de regio Amsterdam/Heemstede/Haarlemmermeer. We gaan ons inzetten voor meer bomen en biodiversiteit, terwijl we met elkaar onderzoeken hoe we de inclusiviteit en diversiteit van dit soort activiteiten en educatie kunnen vergroten. \n\nIk heb heel veel zin in om met een jonge groep te filosoferen, plannen uit te werken, mooie natuurwerkdagen te organiseren, te reflecteren en veel van elkaar te leren. Dus, ben of ken je iemand die dit leuk vindt? \nKijk voor meer informatie en aanmelden op: https://ap.lc/UxCYR\n\nOf heb je ideeën om bij te dragen aan dit programma? Bijv. door het geven van een training, stuur mij een bericht!\n\n#groentraineeship #meerbomennu #jongeren #biodiversiteit #vergroenen\n\nShow translation\n\n25 reactions\n25\n\n2 comments\n\n•\n\n1 repost\n\nLike\nComment\nRepost\nSend\n\nMaxime Weidema • 2nd\n\nFrom Ego to Eco | \nFrom gray to 🏳️‍🌈\n\n1yr • \n\nAanstaande zondag is het zo ver: de Climate Chain. We slaan letterlijk onze handen ineen langs de Nederlandse kust en maken zo een menselijke ketting met als signaal: meer en snellere actie om klimaatverandering tegen te gaan. Kom je mee? ❤️ Ik ga naar Zandvoort en iedereen is zeer welkom aan te sluiten\n\n#theclimatechain #klimaatactie #samen #duikjenemen \n\nShow translation\n\nUrgenda\n\n25,689 followers\n\n1yr • \n\n❗️❗️ Over een kleine twee weken is het zo ver ❗️❗️ \n\nOp zondag 23 juni slaan we om 14:00 uur, 10 minuten de handen ineen en vormen zo een menselijke ketting. Deze Climate Chain maken we om de stille meerderheid die zich zorgen maakt over klimaatverandering zichtbaar te maken.\n\nTrommel dus nog al je vrienden, ouders, (vage én verre) kennissen, collega's, buren, leraren, ouders en alle anderen op om ook naar het strand te komen en meld je aan! Samen geven we een krachtig signaal af: we willen meer én snellere actie om klimaatverandering tegen te gaan.\n\nMeld je aan via de website https://lnkd.in/ePJ9i4y9\n\n#jointhechain #ikbenerbij #theclimatechain \n… more\n\nShow translation\n\n3 reactions\n3\n\n1 comment\n\nLike\nComment\nRepost\nSend\n\nMaxime Weidema • 2nd\n\nFrom Ego to Eco | \nFrom gray to 🏳️‍🌈\n\n1yr • \n\nIk doe mee aan The Climate Chain! Ga je mee? ❤️ \n\nUrgenda\n\n25,689 followers\n\n1yr • \n\n𝗪𝗘 𝗭𝗜𝗝𝗡 𝗟𝗢𝗦: 𝗝𝗢𝗜𝗡 𝗧𝗛𝗘 𝗖𝗟𝗜𝗠𝗔𝗧𝗘 𝗖𝗛𝗔𝗜𝗡!\n\nOp zondag 23 juni 2024 slaan we de handen ineen en trekken een rode streep langs de Nederlandse kustlijn. Samen vormen we een human chain en vragen we snellere actie tegen ontwrichtende klimaatverandering en voor een volhoudbare economie. Zo maken we het grote draagvlak voor meer en snellere klimaatactie zichtbaar. Een meerderheid van de Nederlanders sprak zich in 2023 uit voor meer klimaatbeleid en vraagt meer actie van de overheid.\n\n🌎 𝗪𝗮𝘁 𝗴𝗮𝗮𝗻 𝘄𝗲 𝗱𝗼𝗲𝗻? We vormen de langste human chain ooit langs de Nederlandse kust: de grootste letterlijke verbinding van mensen in Nederland voor meer klimaatactie.\n👥 𝗩𝗼𝗼𝗿 𝘄𝗶𝗲? Voor iedereen die meer en snellere actie wil om ontwrichtende klimaatverandering te voorkomen.\n🗓️ 𝗪𝗮𝗮𝗿 𝗲𝗻 𝘄𝗮𝗻𝗻𝗲𝗲𝗿? Op zondag 23 juni om 14:00 uur, op een kustlocatie bij jou in de buurt.\n\nWe hebben de Nederlandse kust opgedeeld in vakken van elk één kilometer. Via de kaart op de website kun je je aanmelden voor het vak waar jij, je familie, vrienden en collega's willen staan. Claim snel jouw favoriete kustlocatie via de website https://theclimatechain.nl\n\nTot zondag 23 juni bij The Climate Chain!\n\n#TheClimateChain #VerbindenVoorVersnelling\n… more\n\nShow translation\n\n7 reactions\n7\n\n2 comments\n\n•\n\n1 repost\n\nLike\nComment\nRepost\nSend\n\nMaxime Weidema • 2nd\n\nFrom Ego to Eco | \nFrom gray to 🏳️‍🌈\n\n2yr • \n\nWe gaan bijna weer beginnen 🌳 🌳 \nPer week een keertje minder naar de sportschool en met mij mee het bos in!! Gegarandeerd genoeg beweging, frisse lucht, geestelijke ontspanning, gezelligheid, uitdaging, nieuwe kennis over ecologie en bomen, en natuurlijk de voldoening door bij te dragen aan biodiversiteit en klimaatproblematiek. \nJa, ook JIJ kan mee doen. Tot binnenkort dus. \n\nShow translation\n\nMeer Bomen Nu\n\n5,064 followers\n\n2yr • \n\n🌳 NU: GRATIS BOMEN 🌳\n\nIn het Algemeen Dagblad:  Het vierde seizoen van Meer Bomen Nu gaat van start en iedereen kan nu gratis (inheemse) bomen en struiken aanvragen op meerbomen.nu of de (gloednieuwe) app downloaden in apple en playstore!\n\nOok kan iedereen die de handen uit de mouwen wil steken voor #klimaat en #biodiversiteit aanhaken om te helpen kansarme zaailingen een tweede kans te geven.\n\n\"Iedereen met een gezonde dosis enthousias­me en een schep kan meedoen. Groene vingers zijn niet vereist\"\n\nLees het hele artikel: 👉 https://lnkd.in/ehm3ANFB\n\nEen initiatief van Urgenda, Caring Farmers en Stichting MEERGroen\n\nMarjan Minnesma Marga Witteman Tsjeard Hofstra Mehr Bäume Jetzt Aukje Romkes Stefan Forsten Floor Verdenius Elsemarieke Spriensma Bonnie Snoek Frank de Waal Stijn Mertens Anouk Guilliet Leonie Caesar Marc Rotmans Ids Toxopeus Léon Uittenbogaard Hanneke van Ormondt\n… more\n\nShow translation\n\nNederland krijgt er komende maanden 600.000 bomen bij\n\nad.nl\n\n8 reactions\n8\n\n3 comments\n\nLike\nComment\nRepost\nSend\n\nMaxime Weidema • 2nd\n\nFrom Ego to Eco | \nFrom gray to 🏳️‍🌈\n\n2yr • Edited • \n\nNature's beauty\nWith Stichting MEERGroen we created 50 flower meadows on more than 20 acres, in cooperation with municipalities and companies. From now until September these bloom with different species each time. All with the aim of more biodiversity, food for bees and other pollinators, and to offer us fascinating views! ❤️ Look around and enjoy nature's beauty!\n#biodiversity #flowermeadow #beauty #bees \n\n17 reactions\n17\n\n2 reposts\n\nLike\nComment\nRepost\nSend\n\nMaxime Weidema • 2nd\n\nFrom Ego to Eco | \nFrom gray to 🏳️‍🌈\n\n2yr • \n\nStichting MEERGroen\n\n536 followers\n\n2yr • \n\n🌳🌍🇮🇹 MEERGroen maakt grote stappen in Italië: samenwerkingen, bomen planten en een duurzame toekomst! 🌳🌍🇮🇹\n\nWe zijn net terug van een inspirerende 2-weekse reis naar Italië, waar we onze ecologische inspanningen hebben uitgebreid naar nieuwe horizonten. Ons doel is om wereldwijd het ecologische wanbeheer aan te pakken, en Italië was de perfecte plek om ons bereik te vergroten.\n\nWe hebben ons gericht op twee hoofddoelen: het vinden van lokale partners en het uitvoeren van overlevingsstudies in het mediterrane klimaat. We hebben contact gelegd met de \"17 tons\" beweging in Italië, die aansluit bij onze missie om jaarlijks 17 ton CO2 per persoon te verwijderen. Samen maken we een grote impact!\n\nWe hebben productieve vergaderingen gehad met Lega Ambiente Umbria en verschillende boomkwekerijen, waarbij we mogelijkheden hebben verkend om meer bomen te planten en duurzame praktijken te bevorderen. De Paulownia boom trok onze aandacht, omdat deze gedijt in het Italiaanse klimaat en een CO2-afvang kampioen is. Door Paulownia bomen te planten, kunnen we een groenere en gezondere toekomst creëren.\n\nTijdens onze reis hebben we onze ervaringen gedocumenteerd en video's en materialen in het Italiaans gemaakt ter ondersteuning van de PiùAlberiOra campagne. De positieve energie en enthousiasme die we zijn tegengekomen, waren echt inspirerend!\n\nBij terugkomst waren we verheugd te zien dat onze toegewijde vrijwilligers goed voor de tuinen hadden gezorgd in onze afwezigheid. Samen blijven we wieden, groenten oogsten en onze gezamenlijke verantwoordelijkheid voor een groenere wereld koesteren.\n\nMaar onze inspanningen stopten niet in Italië! Een van onze teamleden heeft deelgenomen aan de ChangeNOW-conferentie in Parijs en onderzocht samenwerkingen met Franse boomplantinitiatieven. We overwegen zelfs samenwerking met de duurzaamheidsambities van de Olympische Spelen van 2026!\n\nDoe met ons mee om een verschil te maken en een duurzame toekomst voor iedereen op te bouwen. Samen kunnen we geweldige dingen bereiken! 🌳💚\n\n#MoreGreenMission #DuurzaamLeven #BoomPlanten #MilieuImpact #GlobaleSamenwerking #ChangeNOW #2026Olympics #MEERGroen #MeerBomenNu #PiuAlberiOra\n\n… more\n\nShow translation\nLike\nComment\nRepost\nSend\n\nMaxime Weidema • 2nd\n\nFrom Ego to Eco | \nFrom gray to 🏳️‍🌈\n\n2yr • Edited • \n\nBen je een voedselbos aan het creëren? 🌳 Wil je meer biodiversiteit in je tuin? 🐝 Heb je een stuk(je) grond en wil je meer bomen of struiken planten? 🌹   \nWe hebben deze winter met MeerBomenNu door heel Nederland veel kleine boompjes geoogst, die elders in overdaad waren of het anders niet zouden redden. Deze zijn nu op zoek naar een nieuw thuis. We geven je gratis een leuke en voor jou geschikte mix aan bomen en struiken mee: voor een mooie leefomgeving, om de biodiversiteit én het klimaat te helpen. Er zijn allerlei verschillende soorten, denk aan de hazelaar, esdoorn, berk, wilg, zwarte els, es, beuk, eik, kastanje en kers, en bijvoorbeeld ook de vlieren- en vlinderstruik. \nWees welkom op de uitdeeldagen van Stichting MEERGroen in de Haarlemmermeer: 12, 15 of 18 maart in Aalsmeer, Hoofddorp of Sassenheim. Aanmelden: https://bit.ly/41vMY1m\nWoon je elders in het land? Op 4 maart zijn er door het hele land uitdeeldagen. Bekijk alle plekken en meld je aan: https://lnkd.in/e9Vi776Q\n\n#GratisBomen #Klimaat #Biodiversiteit #MEERGroen #Bomenactie\n… more\n\nShow translation\n\n12, 15 en 18 maart: Gratis bomen voor iedereen: op inschrijving\n\nbit.ly\n\n18 reactions\n18\n\n1 comment\n\n•\n\n1 repost\n\nLike\nComment\nRepost\nSend\n\nMaxime Weidema • 2nd\n\nFrom Ego to Eco | \nFrom gray to 🏳️‍🌈\n\n2yr • \n\n🌱🌳 Oooh wat is de natuur krachtig, prachtig, helend, en zo belangrijk in de uitdagingen van deze maatschappij.. Ik leefde 1,5 jaar te midden van pure natuur, eerst in een ecologische gemeenschap, en daarna in een klein dorpje in de bergen. Nu ben ik weer thuis, in Nederland, in Amsterdam. Daar was mijn relatie tot de natuur anders, je voelt je nederiger, meer verbonden. Hier voelt het meer afgescheiden, je hebt de stad, en je hebt het bos/heide/etc. \nDe vraag ‘hoe verhouden wij ons tot de natuur’ is een grote en cruciale in de transitie naar een duurzame toekomst. Het besef groeit dat we onderdeel zijn van de natuur, én dat we er goed voor moeten zorgen. Maar hoe geven we daar vorm aan? In mijn zoektocht vind ik een antwoord in dit initiatief, niet in woorden, maar in actie: \n\n🌱🌳 Stichting MEERGroen, met oa de campagne MeerBomenNu (ism Urgenda en Caring Farmers).\n\nHet is een bottom-up initiatief, waar burgers zich op verschillende plekken vrijwillig inzetten voor lokaal ecologisch beheer, via allerlei georganiseerde activiteiten. Ipv je machteloos voelen, of wachten op politiek en bedrijfsleven, verantwoordelijkheid nemen en aan de slag gaan. We (ver)planten bomen, leggen bloemenweides aan, vergroten biodiversiteit, toveren braakliggende grond om in ecologische paradijsjes, en meer. Het is een verhaal van hoop, verbeelding, empowerment, actie. Een beweging richting een andere relatie met de natuur. Wij zijn er onderdeel van, we voeden het ecosysteem, we ondersteunen de natuur om ons heen. En niet te vergeten, de natuur voedt altijd terug! Je voelt je ontspannen, energiek, gezond en verbonden met natuur en medemens. \n\nIk verbeeld me alvast een wereld waar dit normaal is, en nodig daarom iedereen uit om een keertje mee te gaan, dit kan door heel Nederland, zie hier de planning https://lnkd.in/eYYYcUmg\n\n#meergroen #meernatuur #meerbomen #biodiversiteit #actie #vrijwilligers #doemee\n… more\n\nShow translation\n\nAgenda - MeerBomenNu\n\nmeerbomen.nu\n\n32 reactions\n32\n\n6 comments\n\n•\n\n1 repost\n\nLike\nComment\nRepost\nSend\n\nMaxime Weidema • 2nd\n\nFrom Ego to Eco | \nFrom gray to 🏳️‍🌈\n\n5yr • Edited • \n\nWhere the first few 'Corona months' have literally and spiritually been a journey inside, the last weeks, it was time to open up more, connect and give: I participated in the Bright Minds program of Impact Hub Amsterdam & Young Impactmakers Community & Starters4Communities. Big shout out to my team Abi Malins Lenka Homolka Liza Anceaux, what a smooth collaboration, lovely women. \n\nGreat thanks to Rutger de Rijk and his team for connecting me to the exemplary and inspiring Bloei & Groei initiative that empowers women in Amsterdam Zuid-Oost through gardening, and for which we explored partnership options. It pointed out even more how vital it is to spend time outside, connecting with people and nature. \n\nTo continue and integrate this more into my own life as well, I am currently spending my days at my favorite campsite in the north of the Netherlands, Camping BuitenLand, where I have offered to work on improving its sustainability (i.e. waste streams, veg&herb garden, increase awareness among guests and employees). My experience working with Green Events Nederland, greening the festival industry, will come in handy. If anyone has experience with greening campsites in particular, would love to exchange thoughts.\n\n#brightminds #youngimpactmakers #sustainability #campsite\n… more\n\n1/2\n\n61 reactions\n61\n\n6 comments\n\n•\n\n1 repost\n\nLike\nComment\nRepost\nSend\nShow all\nExperience\n\nProject, process & community coordinator \n\nFreelance · Freelance\n\nJan 2025 - Present · 10 mos\n\nAmsterdam, North Holland, Netherlands · Hybrid\n\nReach out to set-up, create and run beautiful green&people projects together. maxime@denatuurbende.nl\n\nProject- en procesbegeleider met focus op bewustwording en eigenaarschap rond natuur\n\nEcoco · Part-time\n\nDec 2024 - Present · 11 mos\n\nNetherlands · Hybrid\n\nCoordinator Noord-Holland & Coordinator company days \n\nMeerBomenNu\n\nJun 2023 - Present · 2 yrs 5 mos\n\nNetherlands\n\nCampaign for circular tree planting to fight climate change and create more biodiversity\n\nProject & community coordinator\n\nStichting MEERGroen\n\nOct 2022 - May 2025 · 2 yrs 8 mos\n\nNetherlands\n\nBottom-up ecological management, nature development and urban farming\n\nCoordinator of Work and Volunteers \n\nECOLONIE CENTRE ECOLOGIQUE INTERNATIONAL\n\nJun 2021 - Mar 2022 · 10 mos\n\nFrance\n\nECOlonie\n\n Interpersonal Communication, Problem Solving and +5 skills\n\nShow all\nEducation\n\nPhoenix Opleidingen\n\npost-HBO Registeropleiding, Opleiding in Professionele Communicatie\n\nSep 2024 – Aug 2027\n\nScholing tot begeleider van ontwikkelingsprocessen op persoonlijk en organisatieniveau. \nPijlers: autonomie, heelheid, identiteit, integratie en zingeving\nStromingen: TA, NLP en Systemisch Werken\n… more\n\nOpleiding in professionele communicatie (3 oktober 2024)\n\nVrije Universiteit van Amsterdam & Universiteit van Amsterdam (Joint programme)\n\nMaster of Science (MSc), Research Master - Business in Society\n\n2015 – 2017\n\nAbout the MSc program Business in Society: it addresses the intricate relationships between business and society, as can be seen in grand challenges posed by e.g. the financial crisis, society’s request for ethical leadership and corporate social responsibility, and the need for sustainability. This program educates a new generation of business researchers who will have a profound grasp of the societal trends that are changing the face of business.\n\nAbout my research focus: I examined the role of crowdsourcing - functioning as an open, multi-stakeholder, problem-centered form of organizing - in tackling the grand societal challenge of climate crisis. \n\n\n… more\n\nShow all\nSkills\n\nArt of creation \n\nCoordinator of Work and Volunteers  at ECOLONIE CENTRE ECOLOGIQUE INTERNATIONAL\n\nInterpersonal Communication\n\nCoordinator of Work and Volunteers  at ECOLONIE CENTRE ECOLOGIQUE INTERNATIONAL\n\n1 endorsement\n\nShow all\nLanguages\n\nDutch\n\nNative or bilingual proficiency\n\nEnglish\n\nFull professional proficiency\n\nShow all\nInterests\nTop Voices\nCompanies\nGroups\nNewsletters\nSchools\n\nHarald Friedl \n\n· 2nd\n\nCircular Economy & Sustainability Strategist | Public Speaker | Leadership Coach | Impact Storytelling | Transforming Systems from Ego to Eco\n\n124,930 followers\n\nMessage\nCauses\n\nAnimal Welfare • Arts and Culture • Civil Rights and Social Action • Disaster and Humanitarian Relief • Environment • Human Rights • Politics • Poverty Alleviation\n\nPeople also viewed\n\nFranke van der Laan\n\n· 2nd\n\nClimate Mayor Haarlemmermeer 2021-2025| Initiator @meerbomen.nu | Director @StichtingMEERGroen; Citizin of honor Municipality Ouder Amstel at age of 25 ; 3x in National Sustainable Top100 on spot 18, 56,\n\nConnect\n\nJoost Gringhuis\n\n· 3rd\n\nWOZ- coördinator  bij Gemeente Den Haag\n\nMessage\n\nLeon ter Linden \n\n· 3rd\n\nWerkt graag samen naar een duurzamere samenleving | Bestuurslid De Groene Transformator | Software engineer Groene Code\n\nMessage\n\nIris van der Haagen\n\n· 3rd\n\nBaking bread\n\nMessage\n\nPascalle Van der Ven\n\n· 3rd\n\nCoördinator Dierenambulance’s-Hertogenbosch e.o.\n\nConnect\nShow all\n\nExplore premium profiles\n\nSusan Kelly \n\n· 3rd\n\nDriving Innovation in Document Search & Access | President @ MicroSearch | JD, Boston College\n\nMessage\n\nXavier Delacour \n\n· 3rd\n\nFounder at Occam Vision Group\n\nMessage\n\nYooRi Kim \n\n· 3rd\n\nNonprofit Entrepreneur & Philanthropy Advisor\n\nMessage\n\nDuke Pham \n\n· 3rd\n\nFounder at Phonomenal, Inc\n\nMessage\n\nPeople you may know\n\nFrom Maxime's school\n\nJoszi Smeets\n\n· 2nd\n\nCo Founder, Creative Director Food Hub\n\nConnect\n\nLinde Lassche \n\n· 2nd\n\nVenture Capital | Impact Investing | Board Member\n\nConnect\n\nCorriene van Eck\n\n· 3rd\n\nProgrammamanager bij KnopOm | Einde maken aan energiearmoede | Meetbare maatschappelijke impact & ondernemerschap\n\nMessage\n\nJanneke Leenaars\n\n· 2nd\n\nSustainability Manager Northern Europe at Interface\n\nConnect\n\nDaniel Reisman\n\n· 2nd\n\nCo-Founder | Chief of Growth & Relations at Collie\n\nConnect\nShow all\n\nYou might like\n\nNewsletters for you\n\nTHRIVE\n\nTransform your relationship with practical advice and expert guidance from Coaches Taf and Victoria.\n\nPublished monthly\n\nTafazal Mohammed - Muslim Men’s Coach, MA, PG Dip\n\nSubscribe\n\nGenerations\n\nGenerative Media Creative Tips, Tricks, Tools & Secret Recipes\n\nPublished monthly\n\nEvo H.\n\nSubscribe\nShow all\n\nAbout\n\nAccessibility\n\nTalent Solutions\n\nCommunity Guidelines\n\nCareers\n\nMarketing Solutions \n\nPrivacy & Terms\n\nAd Choices\n\nAdvertising\n\nSales Solutions\n\nMobile\n\nSmall Business\n\nSafety Center\n\nLinkedIn Corporation © 2025\n\nQuestions?\n\nVisit our Help Center.\n\nManage your account and privacy\n\nGo to your Settings.\n\nRecommendation transparency\n\nLearn more about Recommended Content.\n\nSelect language\n\nالعربية (Arabic)\nবাংলা (Bangla)\nČeština (Czech)\nDansk (Danish)\nDeutsch (German)\nΕλληνικά (Greek)\nEnglish (English)\nEspañol (Spanish)\nفارسی (Persian)\nSuomi (Finnish)\nFrançais (French)\nहिंदी (Hindi)\nMagyar (Hungarian)\nBahasa Indonesia (Indonesian)\nItaliano (Italian)\nעברית (Hebrew)\n日本語 (Japanese)\n한국어 (Korean)\nमराठी (Marathi)\nBahasa Malaysia (Malay)\nNederlands (Dutch)\nNorsk (Norwegian)\nਪੰਜਾਬੀ (Punjabi)\nPolski (Polish)\nPortuguês (Portuguese)\nRomână (Romanian)\nРусский (Russian)\nSvenska (Swedish)\nతెలుగు (Telugu)\nภาษาไทย (Thai)\nTagalog (Tagalog)\nTürkçe (Turkish)\nУкраїнська (Ukrainian)\nTiếng Việt (Vietnamese)\n简体中文 (Chinese (Simplified))\n正體中文 (Chinese (Traditional))"
  }
}