{
  "url": "https://www.linkedin.com/in/missy-lahren-earthlawyer/",
  "scraped_at": "2025-10-30T11:44:43.661167",
  "extracted": {
    "name": "Missy Lahren",
    "headline": "Chair of Board of Directors @ Earth Law Center | Public Interest Lawyer, Producer, and Writer",
    "full_text": "Missy Lahren\n\nShe/Her\n\n· 1st\n\nChair of Board of Directors @ Earth Law Center | Public Interest Lawyer, Producer, and Writer\n\nSan Francisco, California, United States\n\n·\n\nContact info\n\nEarth Law Center\n\nCalifornia Institute of Integral Studies\n\n500+ connections\n\nJojo, Rebecca Donner and 10 other mutual connections\n\nMessage\nHighlights\n\nMissy is a new connection\n\n“Hi Missy, it’s great to connect with you. Looking forward to staying in touch.”\n\nSay hello\n\n1 mutual group\n\nYou and Missy are both in Climate Change - I care!\n\nAbout\n\nMissy Lahren has worked as an activist and public interest lawyer in the San Francisco Bay Area since 1993. She has a Ph.D. in Philosophy and Religion and a M.Ed. in Integral Education, both of which focus on the emerging field of “ecozoic education.” She has been working to expand enforceable human and ecological rights since 1997 through participatory media and board positions at Earth Law Center, Unite for Rights, Planetary Advocates, and Eleanor Lives.\n… more\n\nFeatured\n\nMedia\n\nSept 5th, Film and Franti\n\nhttps://www.eventbrite.com/e/the-future-of-energy-film-w-michael-franti-tickets-12585963957\n\nActivity\n\n751 followers\n\nPosts\nComments\n\nMissy Lahren reposted this\n\nEarth Law Center\n\n6,729 followers\n\n2mo • \n\n🌿Earth Law Center ventured into the Peruvian Amazon to partner with Asháninka communities and key allies in protecting native stingless bees.\n\n🤝Together with scientists and strategic allies like @amazonresearchint and @beesfordevelopment, we conducted community empowerment workshops and stingless bee mapping in Asháninka territory, with support from @sernanp and @rc.asháninka.\n\n🐝Over two weeks, we engaged deeply with 50+ Asháninka community members, incorporating their traditional knowledge and feedback to develop initiatives that protect both their cultural heritage and native stingless bee populations.\n\n🔎✨This collaborative effort bridges science and ancestral wisdom to protect Nature and Indigenous Rights. We're proud to share some highlights from this expedition with you.\n\n💪💚This is just the beginning. Want to be part of the change? Support Earth Law Center's Latin America Legal Program via the link in our bio.\n\n#bees #latam #climatechange #animalrights #nature #naturelovers #theamazon #amazonia\n… more\n\nCasper Tybjerg and 42 others reacted\nCasper Tybjerg and 42 others\n\n6 reposts\n\nLike\nComment\nRepost\nSend\n\nMissy Lahren reposted this\n\nEarth Law Center\n\n6,729 followers\n\n2mo • \n\n🐾 What if animals could take humans to court?\nJoin us for the premiere of this timeless fable brought to life on stage — a family-friendly performance where animals demand justice and remind us why their rights matter.\n\n🎭 Followed by a fireside chat on ecocentrism in urban spaces.\n🌿 Presented by Earth Law Center.\n\nDon’t miss this unique mix of theater, activism, and inspiration.\n📌 More info in our bio.\n\n\n#RightsofNature #EarthLaw #ClimateWeekNYC #AnimalRights\n… more\n\nGrant Wilson and 46 others reacted\nGrant Wilson and 46 others\n\n8 reposts\n\nLike\nComment\nRepost\nSend\n\nMissy Lahren reposted this\n\nEarth Law Center\n\n6,729 followers\n\n1mo • \n\nThe Green Amendment gives us the constitutional right to clean air, safe water, and a healthy environment. New York is one of only three states that has taken this landmark step. Join us at Climate Week NYC to learn how local governments can put this right into action and what it means for climate justice worldwide.\n\n📍 Innovating with the New York Green Amendment\n🗓 Tuesday, Sept. 23, 2025 | 11:00 AM – 12:00 PM\n\nMore details here: https://lnkd.in/gijWD6TU\n\n#nyc #climateweek #nature #rightsofnature #rightsofanimals #naturelovers\n… more\n\n1/6\n\nGrant Wilson and 39 others reacted\nGrant Wilson and 39 others\n\n1 comment\n\n•\n\n12 reposts\n\nLike\nComment\nRepost\nSend\n\nMissy Lahren \n • 1st\n\nChair of Board of Directors @ Earth Law Center | Public Interest Lawyer, Producer, and Writer\n\n11mo • \n\nIt was such an honor to be at COP16 with this team! Each of your stories are so inspiring and I am very excited to help spread the word!\n\nGrant Wilson \n • 1st\n\nExecutive Director at Earth Law Center. We give Nature a voice in the legal system.\n\nVisit my website\n\n11mo • Edited • \n\nThis is what happens when a group of Earth lawyers & advocates meet a river with rights, the Pance River in Colombia! 🌊 👩‍⚖️ 📸 \n\nThis was the funnest hour I can remember, seriously! All lawyers, judges, negotiators, and politicians should also find joy in Nature before making impactful decisions on the future of the environment. \n\nThis field trip was a source of motivation as we advocated for the Rights of Nature and ecocentric law at #COP16. We also floated the idea of a formally recognized Nature Delegation to give a voice to the environment at future talks. \n\n🙏 Gratitude to Nikki Riddy for taking most of these pictures alongside Callie Veelenturf and The Leatherback Project! Thank you also to Paul Powlesland (Lawyers for Nature) for loaning me your necktie--the crucial element I forgot. The last photo is a sneak preview of a future post on COP16, where we shared a booth with Global Alliance for the Rights of Nature (GARN) and Stop Ecocide International and teamed up with many more. Full recap to come.\n\n🎆 Incredible job by the Earth Law Center team, which worked VERY hard for two weeks to advocate for Nature's voice and rights. Including Samantha Gottsegen, Constanza Prieto Figelist, F. Javier Ruiz, Tory Dille, Annie Lalonde, Emily Zinkula, Felipe Clavijo-Ospina, Charlotte Dent, Karie Crisp, Missy Lahren, Patricia Welty, & Anne Solgaard. More pictures of that to follow.\n… more\n\n1/8\n\n29 reactions\n29\n\n4 comments\n\nLike\nComment\nRepost\nSend\n\nMissy Lahren \n • 1st\n\nChair of Board of Directors @ Earth Law Center | Public Interest Lawyer, Producer, and Writer\n\n1yr • \n\nPlease support this campaign at earthlawcenter.org! 🌎\n\n\n#damremovals #nature #naturelife #law #earthlaw #naturelover #animalrights #ocean #river #VOICEOFNATURE #climatechange #climatecrisis #laws #orcas #salmon #washington #elwha #naturelovers #shortfilm #climateaction #climatestrike #environment\n\n\nhttps://lnkd.in/gsebMZJX\n\n… more\n\nLast Stand: Saving the Elwha River's Legacy Forests\n\nyoutube.com\n\n17 reactions\n17\n\n1 comment\n\n•\n\n1 repost\n\nLike\nComment\nRepost\nSend\n\nMissy Lahren \n • 1st\n\nChair of Board of Directors @ Earth Law Center | Public Interest Lawyer, Producer, and Writer\n\n1yr • \n\n👏💚 \n\nEarth Law Center\n\n6,729 followers\n\n1yr • Edited • \n\n\nLast Stand - Saving the Elwha River's Legacy Forests OUT NOW!\n\nWatch the full short film: https://lnkd.in/ehzsVy4s 🌱\n\n#damremovals #nature #naturelife #law #earthlaw #naturelover #animalrights #ocean #river #VOICEOFNATURE #climatechange #climatecrisis #laws #orcas #salmon #washington #elwha #naturelovers #shortfilm #climateaction #climatestrike #environment\n… more\n\n11 reactions\n11\n\n1 comment\n\n•\n\n2 reposts\n\nLike\nComment\nRepost\nSend\n\nMissy Lahren \n • 1st\n\nChair of Board of Directors @ Earth Law Center | Public Interest Lawyer, Producer, and Writer\n\n1yr • \n\nSee you there! Can’t wait!\n\nGrant Wilson \n • 1st\n\nExecutive Director at Earth Law Center. We give Nature a voice in the legal system.\n\nVisit my website\n\n1yr • Edited • \n\nEarth Law Center & friends are at EarthX! Join us April 22-26, in Dallas, #Texas, with three all-star panels. EarthX is one of the world’s premier environmental gatherings, bringing together diverse perspectives towards a common goal of protecting the planet. Come to hang out with ELC! BIG discounts below. 🤠 \n\n📣 Here are the three panels: \n\n1) EARTH LAW: Legalizing the Rights and Voices of Nature  🌍 👬🏽 🐙 🐍 🏛\n\n2) RELIGION, ECOLOGY AND LAW: We’re All in This Together 🌌 🌍 👬🏽\n\n3) SHORT FILM: “Saving the Elwha River’s Forests” 🌲 🌊 📽 \n\nHere is an EPIC code for a hugely discounted $99/day rate to share with my network: https://lnkd.in/gTcFX-yj ( ⭐ Code: EARTHXCOC24)\n\nFull conference agenda (😍): https://lnkd.in/gbtfTjM7\n\nI’ve never been to Texas although I feel like I live in “Little Texas” during the summers in Durango. I can’t wait to share Earth law with a new audience. Please come!!! As a bonus, you'll hear my Matthew McConaughey impression. \n\nSpeakers include Grant Wilson, Kevin Schneider, Callie Veelenturf, Anthony Zelle, Pooja Sharma, Joanie Klar, Or Rose, Richard Cizik, Natalia Greene, Missy Lahren, Elizabeth D. & others!!\n\n#RightsofNature #EarthLaw #Environment #Earth The University of Texas at Dallas The University of Dallas Southern Methodist University Dallas College Wade College South University-The Art Institute of Dallas UNT Dallas College of Law SMU Dedman School of Law Bill Shireman Trammell Crow Company Samantha Tweet Wes Sechrest Leslie Griffin Rick Navarro Regina Mayor Jen 🌐 Yamila Cole Sylvia Earle Amy Lewis Van Jones Amir Dossal Barbara D'Amato Joaquín Escoto Iris Diaz Francisco de la Torre Jane Waetara Teburoro Tito et al.\n… more\n\n1/3\n\n13 reactions\n13\n\n1 repost\n\nLike\nComment\nRepost\nSend\n\nMissy Lahren \n • 1st\n\nChair of Board of Directors @ Earth Law Center | Public Interest Lawyer, Producer, and Writer\n\n1yr • \n\nCan’t wait for your webinar! And thank you again for all that you taught me at GW in September.\n\nKathy Hessler \n • 2nd\n\nAssistant Dean, Animal Law at The George Washington University Law School\n\n1yr • \n\nJoin us for a webinar - Animal Law 101 for Scientists with Elizabeth Baker (Physicians Committee for Responsible Medicine) and myself, sponsored by the Animal Law & Science Project (GW Animal Law Program and KIMMELA CENTER FOR ANIMAL ADVOCACY INC) on January 11, 2024 via zoom.\n\n#animallaw #ALEI\n\n10 reactions\n10\n\nLike\nComment\nRepost\nSend\n\nMissy Lahren \n • 1st\n\nChair of Board of Directors @ Earth Law Center | Public Interest Lawyer, Producer, and Writer\n\n2yr • \n\nPlease join me and an incredible panel of experts in NYC during Climate Week for an inspiring discussion about the role of 3 keystone marine species: Southern Resident Orcas, Leatherback sea turtles, and Hammerhead sharks. We’ll discuss their vital roles in protecting biodiversity and helping to mitigate climate change. Help me spread the word about this free event!\n\nRSVP here: https://lnkd.in/gvvgTXtB\n\n78 reactions\n78\n\n4 comments\n\n•\n\n17 reposts\n\nLike\nComment\nRepost\nSend\n\nMissy Lahren \n • 1st\n\nChair of Board of Directors @ Earth Law Center | Public Interest Lawyer, Producer, and Writer\n\n2yr • \n\nhttps://lnkd.in/gAdKJnSy\n\nEarth Law Center\n\n6,729 followers\n\n2yr • \n\nI am reaching out with an urgent request from Earth Law Center: We need to stop the systematic logging of “legacy forests” in the State of Washington. These trees are the age of our grandparents. We’ve identified a critical 126-acre stretch of forest called \"Power Plant\" that is slated for timber auction on July 26, 2023. We must delay and ultimately stop this sale; it’s scheduled to happen in just 2 days! \n\n“Power Plant” is a unique legacy forest case: Earth Law Center, et al. vs. DNR. Since its mature canopy and root system is located near the banks of the Elwha River, logging these old trees will impact stream flows, slope stability, and the salmon spawning in the river. Damage to the salmon triggers problems downstream for the critically endangered Southern Resident Orcas (73 left), who feed at the mouth of the river and rely on those very salmon to survive. \n\nForty-five miles long, the iconic Elwha River flows from the headwaters in the Olympic National Park to the Strait of Juan de Fuca. The river received international attention when the federal government removed its two dams in 2014, allowing its waters to finally run free. Taxpayers paid $327 million to successfully restore the river, yet the State jeopardizes this progress by using outdated logging guidance and ignoring the reality of climate change and the rights of future generations.\n\nOn June 30, 2023, the Earth Law Center’s Elizabeth Dunne embarked on an emergency campaign to protect Power Plant and the remaining 800 acres of legacy forest around the Elwha. Power Plant’s unique facts and location may be just the catalyst to bring longer lasting protection to other critical forests in the Elwha Watershed, while also amplifying the urgent need to save legacy forests generally. This past Friday, Elizabeth and pro bono lawyer, Steven Turner, went to Court to try and delay the July sale. While the Court listened carefully to the arguments, the judge has yet to rule and the auction is still on the calendar – less than two days away. \n\nWe are incredulous that the state government has chosen to log in a watershed that the federal government and local community has worked so hard to restore. As the iconic River regenerates, it inspires many – not only Washingtonians– but people all around the world that ecosystems can restore themselves. \n\nOur immediate need is to spread the word as widely as possible and to raise funds to protect the forest. We aim to purchase the extractive timber harvest lease– essentially \"buying\" the right to protect rather than extract. So, there's no reason to log. So please:\n\n*Donate to the Elwha Forest Fund: https://lnkd.in/gWaCMi75\n*Read & forward the story: https://lnkd.in/g7DQvzcy\n*Donate to the Earth Law Center’s Elwha Forest Legal Team: https://lnkd.in/etfX7C9x\n\nSince we are a 501(c)(3), your contribution will be tax deductible.\n\nFor more info: edunne@earthlawcenter.org, 808-554-1409\n\nMany thanks!\n… more\n\nElwha Forest Fund\n\ngivebutter.com\n\n15 reactions\n15\n\n2 comments\n\nLike\nComment\nShow all\nExperience\n\nChair of Board of Directors\n\nEarth Law Center · Full-time\n\nMar 2021 - Present · 4 yrs 8 mos\n\nDurango, Colorado, United States · Hybrid\n\n• Lead international nonprofit dedicated to advancing ecocentric law, policy, and education.\n• Participate in board & staff meetings, program development, legal analysis & strategy, publications, panel discussions, networking & fundraising.\n• Co-designed 12 virtual Earth classes for law students from newly published legal textbook Earth Law: Emerging Ecocentric Law- A Guide for Practitioners, 2021.\n• Co-designed 6-week summer internship for high school, college, and law students including legal, experiential, and advocacy training.\n… more\n\n Operations Management and Nonprofit Organizations\n\nExecutive Committee\n\nEleanor Lives! · Part-time\n\n2019 - Present · 6 yrs 10 mos\n\nSan Francisco, California, United States\n\n• Helped grow international human rights law and advocacy group.\n• Participate in board and staff meetings, program development, publications and films, fundraising, and event planning for 75th Anniversary of UDHR.\n… more\n\nExecutive Committee, Co-Founder\n\nPlanetary Advocates · Full-time\n\nJan 2013 - Present · 12 yrs 10 mos\n\nBerkeley, California, United States\n\n• Co-founded media based non-profit (EIN # 46-3434778) to make educational content devoted to social justice, human potential, and environmental stewardship.\n• Participated in multi-year renewable energy campaign that included national and international film festivals, conferences, demonstrations, and panel discussions.\n• Co-wrote and co-produced 3 films:\n 1) “The Future of Energy: Lateral Power to the People” 62 minute crowd funded documentary about the movement to 100% renewable energy. https://youtube/Ho4OmSnezxI\n2) “The Secrets of the Climate Paradox” 7 minute animated short about the psychological barriers that lead to climate inaction. \nhttps://www.facebook.com/theFutureofEnergyfilm/videos/542531312567252/\n3) “Cogdissonex” 3 minute drug commercial parody to cure cognitive dissonance.\nhttps://www.youtube.com/watch?v=QIA_jwGq3kQ\n… more\n\nLegal Staff & Advisory Board\n\nUnite for Rights · Contract\n\n2005 - 2019 · 14 yrs\n\nBerkeley, California, United States\n\n• Co-developed international human rights non-profit tasked with generating a global human rights charter.\n• Participated in legal analysis, grant writing, book editing & networking.\n… more\n\nFounding Partner\n\nPublic Interest Lawyers Group · Full-time\n\n1995 - 1999 · 4 yrs\n\nSan Francisco, California, United States\n\n• Enforced violations of federal environmental laws using citizen suit provisions with emphasis on the Clean Water Act.\n• Managed complex legal case load for environmental non-profit clients.\n… more\n\nShow all\nEducation\n\nCalifornia Institute of Integral Studies\n\nDoctor of Philosophy - PhD, Doctor of Philosophy and Religion\n\n2021\n\nCalifornia Institute of Integral Studies\n\nMaster of Philosophy - MPhil, Master of Philosophy, Cosmology, and Consciousness\n\n2014\n\nShow all\nProjects\n\nThe Future of Energy Film\n\nFeb 2013 – Present\n\nShow project\n\nThe Future of Energy: Lateral Power to the People is a positive, fun film that focuses on energy solutions and the people behind the renewable energy revolution. It's a love story about people re-imagining their relationship to the planet, and falling back in love with the Earth and each other.\n… more\n\nOther contributors\n\nView all contributors\nVolunteering\n\nSpeaker Committee, Food and Nutrition Committee\n\nSCHOOLS OF THE SACRED HEART-SAN FRANCISCO\n\n2009 - 2011 · 2 yrs\n\nEducation\n\nSpeaker Committee:\n• Researched & recruited speakers for six-part annual educational series.\n• Managed budget & communications to school community.\n\nFood and Nutrition Committee:\n• Co-organized campaign to convert school lunches to locally sourced, organic purveyor.\n… more\n\nPhilosophy Teacher\n\nPhiloso-Tea\n\n2014 - 2017 · 3 yrs\n\nEducation\n\n• Develop philosophy middle school curricula for girls ages 11-15.\n• Taught 2 hour facilitated philosophy discussion groups using social emotional learning, differentiation, and participatory action research.\n… more\n\nSkills\n\nNonprofit Organizations\n\nChair of Board of Directors at Earth Law Center\n\nEndorse\n\nOperations Management\n\nChair of Board of Directors at Earth Law Center\n\nEndorse\nShow all\nInterests\nCompanies\nGroups\nNewsletters\nSchools\n\nProject Drawdown\n\n82,272 followers\n\nFollowing\n\nKore Infrastructure\n\n1,095 followers\n\nFollow\nShow all\n\nPeople also viewed\n\nPaul Powlesland \n\n· 2nd\n\nBarrister at Garden Court Chambers\n\nConnect\n\nCallie Veelenturf \n\n· 2nd\n\nMarine Conservation Biologist | Rights of Nature Advocate | Nat Geo Explorer | The Leatherback Project ED | Explorers Club Fellow, New Explorer '24 | UNHwNP Scientist | UNDP Ocean Innovator | FFN Awardee\n\nFollow\n\nBill Waytena\n\n· 2nd\n\nCEO of Cold Solar/Carrot Partners, CEO at Telesocial, Inc.\n\nConnect\n\nGrant Wilson \n\n· 1st\n\nExecutive Director at Earth Law Center. We give Nature a voice in the legal system.\n\nMessage\n\nShyla Raghav \n\n· 2nd\n\nChief Climate Officer at TIME\n\nFollow\nShow all\n\nExplore premium profiles\n\nJoshua Ferrazzano \n\n· 3rd\n\nCo-Founder / Managing Partner at World War Seven\n\nMessage\n\nMarta Pernas \n\n· 3rd\n\nEntrepreneur, UX/UI designer, and mother of an autistic child. CEO of Marcos Language Apps LLC—on a mission to make a difference for children with language learning challenges.\n\nMessage\n\nYooRi Kim \n\n· 3rd\n\nNonprofit Entrepreneur & Philanthropy Advisor\n\nMessage\n\nPeople you may know\n\nFrom Missy's school\n\nLarry Norris, PhD\n\n· 2nd\n\nCo-founder, Board Member, National Director Decriminalize Nature\n\nConnect\n\nLiz Flores Farrell, LCSW \n\n· 2nd\n\nTrauma Focused Ketamine Assisted Psychotherapy | Psychedelic Integration | Clinical Supervision\n\nConnect\n\nDoug Seckinger \n\n· 2nd\n\nMission-driven marketing, communications, brand, and partnerships and team builder | Mental Health & Wellness\n\nConnect\n\nEdie Farwell \n\n· 2nd\n\nExecutive Director, Climate Solutions Coach, Sustainability Leaders Network\n\nConnect\n\nGiovanna de Oliveira Andreotti \n\n· 2nd\n\nNavigating Complexity with Care and Accountability\n\nConnect\nShow all\n\nYou might like\n\nNewsletters for you\n\nbiometrio. insights\n\nExpert perspectives on biodiversity monitoring, nature-based solutions, nature tech and more. \n\nPublished monthly\n\nbiometrio.earth\n\nSubscribe\n\nTHRIVE\n\nTransform your relationship with practical advice and expert guidance from Coaches Taf and Victoria.\n\nPublished monthly\n\nTafazal Mohammed - Muslim Men’s Coach, MA, PG Dip\n\nSubscribe\nShow all\n\nAbout\n\nAccessibility\n\nTalent Solutions\n\nCommunity Guidelines\n\nCareers\n\nMarketing Solutions \n\nPrivacy & Terms\n\nAd Choices\n\nAdvertising\n\nSales Solutions\n\nMobile\n\nSmall Business\n\nSafety Center\n\nLinkedIn Corporation © 2025\n\nQuestions?\n\nVisit our Help Center.\n\nManage your account and privacy\n\nGo to your Settings.\n\nRecommendation transparency\n\nLearn more about Recommended Content.\n\nSelect language\n\nالعربية (Arabic)\nবাংলা (Bangla)\nČeština (Czech)\nDansk (Danish)\nDeutsch (German)\nΕλληνικά (Greek)\nEnglish (English)\nEspañol (Spanish)\nفارسی (Persian)\nSuomi (Finnish)\nFrançais (French)\nहिंदी (Hindi)\nMagyar (Hungarian)\nBahasa Indonesia (Indonesian)\nItaliano (Italian)\nעברית (Hebrew)\n日本語 (Japanese)\n한국어 (Korean)\nमराठी (Marathi)\nBahasa Malaysia (Malay)\nNederlands (Dutch)\nNorsk (Norwegian)\nਪੰਜਾਬੀ (Punjabi)\nPolski (Polish)\nPortuguês (Portuguese)\nRomână (Romanian)\nРусский (Russian)\nSvenska (Swedish)\nతెలుగు (Telugu)\nภาษาไทย (Thai)\nTagalog (Tagalog)\nTürkçe (Turkish)\nУкраїнська (Ukrainian)\nTiếng Việt (Vietnamese)\n简体中文 (Chinese (Simplified))\n正體中文 (Chinese (Traditional))"
  }
}