{
  "url": "https://www.linkedin.com/in/nadaitgebremedhen/",
  "scraped_at": "2025-10-30T12:23:18.842651",
  "extracted": {
    "name": "Nadait Gebremedhen, MD",
    "headline": "New York, New York, United States",
    "full_text": "Nadait Gebremedhen, MD\n\nShe/Her\n\n· 1st\n\nSocial Entrepreneur & Physician | CEO @Hagush —building cost-effective, sustainable, and scalable development solutions | Civic & Social Innovation\n\nNew York, New York, United States\n\n·\n\nContact info\n\nHagush\n\nUniversity of Pittsburgh\n\n1,816 followers\n\n·\n\n500+ connections\n\nPhilip, Gregory and 21 other mutual connections\n\nMessage\nHighlights\n\n1 mutual group\n\nYou and Nadait are both in Philanthropy Network\n\nAbout\n\nA question I often get is why I stepped away from medicine. Here’s why:\n\n1. As a natural systems thinker, I excel at creative problem-solving, a skill that doesn’t get much play in clinical medicine, where protocols and guidelines largely govern practice. \n\n2. I’m not convinced that the way we’ve organized our world—where prosperity is available to only a small fraction of humanity—is at all inevitable, and I’m deeply invested in working towards change on that front.  It’s a focus area that, admittedly, lies outside the scope of medicine.\n\n3. I don’t believe the solution to many challenges in my part of the world, Africa, lies in creating low-cost versions of sleek Global North technologies or deploying clever ad hoc fixes. While those approaches have their place, lasting change requires tackling the complex systems that create and perpetuate poverty. We must re-think the laws and institutions that reinforce global economic inequality——a task that, again, goes well beyond the scope of clinical medicine.\n\nMy work now is in global development and is anchored in creating a world where everyone can—and will—do well. At Hagush, we’re making digital technology access universal while also tackling the deeper structural issues that perpetuate global economic inequality.\n… more\n\nActivity\n\n1,816 followers\n\nPosts\nComments\nImages\nDocuments\n\nNadait Gebremedhen, MD \n • 1st\n\nSocial Entrepreneur & Physician | CEO @Hagush —building cost-effective, sustainable, and scalable development solutions | Civic & Social Innovation\n\n1d • Edited • \n\nExcited to join #CatalysingChangeWeek2025, orchestrated by Catalyst Now — where bold ideas meet collaborative action!\n\nThis year’s theme, Converging Forces: Where Innovation Meets Impact, brings together changemakers from every sector to drive real systems change.\n\nDon’t miss our session \"Rethinking How We Fund Social Impact: Doing More With Less\" — join the conversation shaping a better future!\n\nRegister here:  ➡️ https://lnkd.in/eHHiVXcM\n\nMichael Gilligan Gannon Gillespie Inês Caldeira Marques Maura Donlan Nadia Kist\n\n#CCW2025 #CatalysingChangeWeek #SocialInnovation\n… more\n\n9 reactions\n9\n\nLike\nComment\nRepost\nSend\n\nNadait Gebremedhen, MD \n • 1st\n\nSocial Entrepreneur & Physician | CEO @Hagush —building cost-effective, sustainable, and scalable development solutions | Civic & Social Innovation\n\n6d • \n\nVery much looking forward to this!\n\nAfrica Forward\n\n927 followers\n\n6d • Edited • \n\nAcross the continent, there are generations of social innovators who are rewriting Africa’s story, not through theory, but through action, courage, and creativity. \n\nFrom grassroots communities to national movements, these leaders are showing what’s possible when ideas meet purpose.\n\nIn this powerful session moderated by Luvuyo Rani ,\n\nWe’ll hear from GISELE M.YITAMBEN , Nadait Gebremedhen, MD , and Sipho Mwanza , as they share their personal journeys, what inspired their work, the challenges they’ve faced, and how they’re building solutions that drive meaningful change.\n\nTheir stories remind us why it’s vital to spotlight and celebrate the people leading Africa’s transformation, inspiring the current & next generation of innovators, dreamers, and doers who are shaping the continent’s future.\n\nAs we close Catalyzing Change Week 2025, we do so on an inspiring note, one that celebrates the power of African voices, community, and collaboration in shaping a brighter, more inclusive future.\n\nBe part of this conversation. \n\nRegister now to join us: https://lnkd.in/grazwH3T\n\nPearl Uzokwe Yogavelli Nambiar Adrianne Wabakwira Hagush OpenNet For All Zambia Catalyst Now\n… more\n\nNadait Gebremedhen, MD and 19 others reacted\nNadait Gebremedhen, MD and 19 others\n\n1 repost\n\nLike\nComment\nRepost\nSend\n\nNadait Gebremedhen, MD \n • 1st\n\nSocial Entrepreneur & Physician | CEO @Hagush —building cost-effective, sustainable, and scalable development solutions | Civic & Social Innovation\n\n6d • Edited • \n\nExpanding the pool of resources for impact and international development isn’t just about mobilizing more funding — it’s also about designing smarter, resource-efficient funding processes that reduce waste and ensure every dollar delivers maximum impact.\n\nLooking forward to sharing more on this with Michael Gilligan at Catalyst Now’s #CatalyzingChangeWeek2025 on Nov 3rd. \nRegistration here ➡️ https://lnkd.in/eHHiVXcM\n\nRead more on how the current funding paradigm might be costing the social sector more than it’s worth here ➡️ https://lnkd.in/eAR_NPyk\nRead more on the case for changing the current paradigm here ➡️ https://lnkd.in/en8J2FVN\n\nInês Caldeira Marques Gannon Gillespie Maura Donlan Nadia Kist\n… more\n\n22 reactions\n22\n\n3 comments\n\nLike\nComment\nRepost\nSend\n\nNadait Gebremedhen, MD \n • 1st\n\nSocial Entrepreneur & Physician | CEO @Hagush —building cost-effective, sustainable, and scalable development solutions | Civic & Social Innovation\n\n2w • \n\nI'm  in Washington, DC, this week for the Fall edition of The World Bank and International Monetary Fund meetings. If you’re around, give me a shout — I’d love to grab coffee and chat about all things global governance!\n\n1/4\n\n31 reactions\n31\n\n1 comment\n\n•\n\n2 reposts\n\nLike\nComment\nRepost\nSend\n\nNadait Gebremedhen, MD reposted this\n\nGannon Gillespie • 2nd\n\nAdvisor to Social Change Organizations\n\n3w • Edited • \n\nScroll, scroll - PAUSE.  Wait, what?  \n\nThe message below is worth real attention. In case it needs repeating, the second half of the opening sentence says:  \n\nhundreds of millions of dollars — that could go to our sector at this crucial moment. \n\nAnd as we dug deeper our take is that's a LOW estimate.  But we only have 3 weeks. If you can be a part of getting this funded please do. \n\nIf you are working in Philanthropy as an advisor or infrastructure org, and want to be a part of the call we are co-hosting next week including Catalyst Now, Propel Philanthropy and others to drive towards this goal, please register or reach out.  \n\nPlease share this with folks who would be interested in contributing or who might know those who would be. \n\nThe broader approach being used here is also powerful and in my opinion, under-used. Stay tuned on that.  ;) \n\nJoin the linkedin event, zoom sign-up will follow.\n\nhttps://lnkd.in/das_FkrX\n… more\n\nThe Urgent Immediate Action Group\n\nPeter Brach • 2nd\n\n3w • Edited • \n\nIf we can raise $200,000 by October 26, we have the potential to increase donations this GivingTuesday by tens to hundreds of millions of dollars. Failing to reach this goal means thousands of nonprofits will miss out on critical funding.\n\nAs an example, last year GivingTuesday invested $80,000 in a media campaign, which significantly contributed to raising $500 million in additional donations and engaging 2.1 million more people. With an extra $200,000 this year, we can exceed those results and drive even more giving.\n\nWe are a temporary action group formed to address an unprecedented crisis: nonprofits are facing severe budget cuts. Our mission is to mobilize a dedicated group of individuals to take immediate, actionable steps to support thousands of nonprofits in need.\n\nThis initiative is being led by Catalyst Now, Propel Philanthropy, the Systems Studio, and Robert Roth, PhD. We invite you to join us in this crucial effort.\n\nFor those with questions about our projections, we understand they may seem ambitious. The following resources provide deeper insights and data supporting our goals:\n\n- A prospectus by GivingTuesday: https://lnkd.in/gEgMFSEa\n- A comprehensive analytics report specific to this campaign: https://lnkd.in/gpM3zhZv\n- Propel Philanthropy’s public page about this campaign: https://lnkd.in/gbeXUbc8\n… more\n\nHelping Nonprofits in Crisis\n\npropelphilanthropy.org\n\n5 reactions\n5\n\n2 comments\n\n•\n\n1 repost\n\nLike\nComment\nRepost\nSend\n\nNadait Gebremedhen, MD reposted this\n\nMarco De Biasi \n • 2nd\n\nStartups Investor & Advisor /Accelerator Program Director at Founder Institute Brasil/Conselheiro Fiscal Italcam\n\n2w • Edited • \n\nIt was a pleasure to participate as speaker at the “Empowering the Next Generation of Social Entrepreneurs” panel at Horasis Global Meeting 2025, held at the USP - Universidade de São Paulo on October 8-9. 🇧🇷 Chaired by Rania Hoteit together with Nadait Gebremedhen, MD, Sara Hughes, Dr. Osama Bin Noor, Dr. Stacy L. Scott and Gisela Maria Bernardes Solymos.\nSocial entrepreneurship is transforming the way we address pressing global challenges, blending the principles of business with a mission to create lasting social change. By leveraging innovation and community-driven solutions, social enterprises are reshaping sectors such as education, healthcare, and sustainability.  Later, I participated to the following panels,  where I have proudly accompanied two startups accelerated by the Founder Institute Brazil: \"Innovation for a Poverty-Free Future\" with Sanderson Pajeú and Katrine Scomparin 🧡CEO e Co-founder of naPorta® and \"Fueling Science Through Openness and Cooperation\" Chaired by Deborah Simpson with Talita Moretti CEO of ZEST Health, Rushdy Ahmad, PhD and others fantastic panelists.\nThank you Frank-Jürgen Richter so much for having placed your trust in me and for the quality of my panellists and congrats for everyone I met at the Summit for sharing their insights and the incredible work they are doing.\n\n#leadership #entrepreneurship #business #innovation #technology\n#impactinvesting #socialentrepreneurship #socialimpact #paneldiscussion\n#brazil #horasis #founderinstitute\n… more\n\n1/7\n\nNadait Gebremedhen, MD and 62 others reacted\nNadait Gebremedhen, MD and 62 others\n\n2 comments\n\n•\n\n3 reposts\n\nLike\nComment\nRepost\nSend\n\nNadait Gebremedhen, MD \n • 1st\n\nSocial Entrepreneur & Physician | CEO @Hagush —building cost-effective, sustainable, and scalable development solutions | Civic & Social Innovation\n\n3w • Edited • \n\n2 hours to go!\nIf you're at #São Paulo for the Horasis Global Submit, join us for this discussion featuring Marco De Biasi, Dr.Stacy Scott, Gisela Maria Bernardes Solymos, Dr. Osama Bin Noor, Sara Hughes, moderated by Rania Hoteit.\nFrank-Jürgen Richter - thank you for the invite!\n\n24 reactions\n24\n\n1 comment\n\nLike\nComment\nRepost\nSend\n\nNadait Gebremedhen, MD reposted this\n\nDaniel Cash \n • 2nd\n\nAcademic and Advisor on Credit Ratings and Debt Reform | Reader in Law, Aston University | UN University Senior Fellow | AAT PRSC Board | Bridging Research and Global Policy\n\n3w • \n\nWhat does 'Beyond GDP' look like from a credit rating perspective?\n\nI’ve been following the UN’s #BeyondGDP work closely (https://lnkd.in/enzckj23) and this week I finally tried to bring it into the credit rating conversation.\n\nThe UN Secretary-General’s Expert Group is building a new global dashboard of indicators to measure well-being, sustainability, and resilience. It’s a fascinating and important shift, a chance to redefine how we think about progress itself.\nYet every time a government speaks to a credit rating agency or investor, the conversation still begins and ends with the same familiar figures: GDP growth, GDP per capita, debt-to-GDP. This is because it is the shared language that markets understand.\n\nMy new Substack essay - The Shared Language Problem - looks at what happens when these two measurement systems meet. Can we design metrics that are meaningful for people and the planet and legible to investors? Or will governments be forced to live between two incompatible scorecards - one that defines progress, and another that defines risk?\n\nYou can read it here: https://lnkd.in/eYNw7xrc\n\nThe Credit Rating Research Initiative #creditratings #UN #GDP #Economics #data #Planet #benefits #sustainability \n… more\n\n13 reactions\n13\n\n3 comments\n\n•\n\n2 reposts\n\nLike\nComment\nRepost\nSend\n\nNadait Gebremedhen, MD reposted this\n\nMariana Mazzucato \n • Following\n\nProfessor in the Economics of Innovation and Public Value, University College London, Founder & Director of IIPP at UCL\n\n1mo • \n\nIf any new global order is to be a success, long-term structural transformation is required. Pre-distributive innovation systems, where knowledge is created and shared, are crucial. Inspiring discussions yesterday with New America and Project Starling about new kinds of multilateralism – and the importance of a different approach to global governance and economic architecture to achieve structural equity, rather than a return to the status quo. \n\nOur Principles for an Inclusive and Sustainable Global Economy ➡️ https://lnkd.in/ejH86PS5\n\n1/2\n\n64 reactions\n64\n\n1 comment\n\n•\n\n1 repost\n\nLike\nComment\nRepost\nSend\n\nNadait Gebremedhen, MD reposted this\n\nSeth Cochran \n • 2nd\n\nThe Fistula Guy + I help drive innovation in philanthropy\n\n3w • \n\nLast week we held The Sidebar in NYC during Climate Week / UNGA.\n\nIt was the 4th one we ran - 2nd time in NYC. Participant-led programming needs input from people to get better. This is where we need your help!\n\nPlease spend a few minutes to share your thoughts. \n\nPositive feedback encourages us and constructive feedback helps us get better.  Whatever you have to share, we will certainly put it into direct action. \n\nPlease take a few moments to share your insights.\n\nhttps://lnkd.in/eVFdigYE\n\n… more\n\nJustus Wanjohi and 65 others reacted\nJustus Wanjohi and 65 others\n\n4 comments\n\n•\n\n8 reposts\n\nLike\nComment\nRepost\nSend\nShow all\n\nPeople also viewed\n\nChilande Kuloba-Warria \n\n· 2nd\n\nFounder and Managing Director at Warande Advisory Centre\n\nFollow\n\nLuigi Cavallito \n\n· 2nd\n\nImproving the state of the world with creativity, inspiration and practice. \n\nFollow\n\nCameryn Burnette\n\n· 3rd\n\nMaterial Science for Sustainable Development @ MIT | Schwarzman Scholars C8 | Howard University Alumna\n\nMessage\n\nMargretta Getaweh-Supuwood \n\n· 2nd\n\nDEI Consultant I Community Engagement Strategist \n\nConnect\n\nDr. Saida Désilets\n\n· 2nd\n\nFounder of The Désilets Method ✦ Women's Sexual Sovereignty ✦ Jade Egg Mastery ✦ Health & Wellness ✦ TEDx Speaker ✦ Author ✦ Embodied Love Lounge Podcast\n\nConnect\nShow all\n\nExplore premium profiles\n\nJoshua Ferrazzano \n\n· 3rd\n\nCo-Founder / Managing Partner at World War Seven\n\nMessage\n\nTed Christianson \n\n· 3rd\n\nEntrepreneur and CEO\n\nMessage\n\nDuke Pham \n\n· 3rd\n\nFounder at Phonomenal, Inc\n\nMessage\n\nPeople you may know\n\nFrom Nadait's school\n\nBeth Carle \n\n· 2nd\n\nAssociate Professor at Rochester Institute of Technology\n\nConnect\n\nDavid Motley \n\n· 2nd\n\nVenture Capitalist, Entrepreneur, Board Director\n\nConnect\n\nDionne Broadus, J.D. \n\n· 2nd\n\nAdvisor & Senior Strategist | Philanthropy, Nonprofits, \nImpact Investing, Family Offices\n\nConnect\n\nMeghan Edge \n\n· 2nd\n\nRegenerative Agriculture | Climate Comms | External Affairs\n\nConnect\n\nMichael S Ashford \n\n· 2nd\n\nLeadership and management in energy and water infrastructure, climate change mitigation and adaption, in private, non-profit and public sectors.  Expertise in clean energy finance and policy.\n\nConnect\nShow all\n\nYou might like\n\nNewsletters for you\n\nResources and Projects Updates\n\nStay up to date with Gaia Education’s latest projects, initiatives, and impact around the world.\n\nPublished monthly\n\nGaia Education\n\nSubscribe\n\nbiometrio. insights\n\nExpert perspectives on biodiversity monitoring, nature-based solutions, nature tech and more. \n\nPublished monthly\n\nbiometrio.earth\n\nSubscribe\nShow all\n\nAbout\n\nAccessibility\n\nTalent Solutions\n\nCommunity Guidelines\n\nCareers\n\nMarketing Solutions \n\nPrivacy & Terms\n\nAd Choices\n\nAdvertising\n\nSales Solutions\n\nMobile\n\nSmall Business\n\nSafety Center\n\nLinkedIn Corporation © 2025\n\nQuestions?\n\nVisit our Help Center.\n\nManage your account and privacy\n\nGo to your Settings.\n\nRecommendation transparency\n\nLearn more about Recommended Content.\n\nSelect language\n\nالعربية (Arabic)\nবাংলা (Bangla)\nČeština (Czech)\nDansk (Danish)\nDeutsch (German)\nΕλληνικά (Greek)\nEnglish (English)\nEspañol (Spanish)\nفارسی (Persian)\nSuomi (Finnish)\nFrançais (French)\nहिंदी (Hindi)\nMagyar (Hungarian)\nBahasa Indonesia (Indonesian)\nItaliano (Italian)\nעברית (Hebrew)\n日本語 (Japanese)\n한국어 (Korean)\nमराठी (Marathi)\nBahasa Malaysia (Malay)\nNederlands (Dutch)\nNorsk (Norwegian)\nਪੰਜਾਬੀ (Punjabi)\nPolski (Polish)\nPortuguês (Portuguese)\nRomână (Romanian)\nРусский (Russian)\nSvenska (Swedish)\nతెలుగు (Telugu)\nภาษาไทย (Thai)\nTagalog (Tagalog)\nTürkçe (Turkish)\nУкраїнська (Ukrainian)\nTiếng Việt (Vietnamese)\n简体中文 (Chinese (Simplified))\n正體中文 (Chinese (Traditional))"
  }
}