{
  "url": "https://www.linkedin.com/in/pennyheiple/",
  "scraped_at": "2025-10-30T11:45:37.231513",
  "extracted": {
    "name": "Penny L. Heiple",
    "headline": "Co-Founder Design School for Regenerating Earth",
    "full_text": "Penny L. Heiple\n\nShe/Her\n\n· 1st\n\nCo-Founder Design School for Regenerating Earth\n\nBarichara, Santander, Colombia\n\n·\n\nContact info\n\nDesign School for Regenerating Earth\n\nUniversity of Colorado at Boulder\n\n500+ connections\n\nRobert, Ali and 290 other mutual connections\n\nMessage\nHighlights\n\n2 mutual groups\n\nYou and Penny L. are both in systems thinking network and Regenerative Development Community\n\nAbout\n\nCurrently living in Barichara, Colombia, and a native of Boulder, Colorado, I have a passion for serving life and our beautiful planet Earth. I moved to Colombia to live out my dream of helping to regenerate the earth alongside my life partner, Joe Brewer. Together, we are doing ecosystem restoration work and helping to create a local regenerative economy in our bioregion in and around Barichara. We also co-founded the Design School for Regenerating Earth where we are helping to activate bioregional organizing and facilitating learning journeys and learning exchanges between bioregions across the planet. \n\nI'm passionate about integrating and applying unified science, integral philosophy, regenerative practices, and biodynamic healing and trauma resolution to everything I do. These passions combined with my comprehensive background in operations, project management, accounting, and administration means that I bring a unique combination of heart and organizational expertise to the various initiatives and organizations in which I'm involved. \n\nPlease visit this website to learn more about the Design School for Regenerating Earth:\nhttps://design-school-for-regenerating-earth.mn.co/\n\nPlease visit this website for more information on my healing practice:\nhttps://pennyheiple.com\n… more\n\nActivity\n\n1,909 followers\n\nPosts\nComments\n\nPenny L. Heiple reposted this\n\nJoe Brewer \n • 1st\n\nCo-Founder at Design School for Regenerating Earth\n\n5d • \n\nSo many of us are now living into the Design Pathway for Regenerating Earth through the Design School -- including how they are organizing in a place-based manner across our planetary network of bioregions.\n\nDesign School for Regenerating Earth\n\n3,969 followers\n\n5d • \n\nIt has been so inspiring to watch as the place-based hubs continue organizing themselves in different parts of the world. Design School members are learning how to regenerate the Earth in their own local landscapes and bioregions.\n\nMany of these place-based hubs are free to join and open to the public. The registry of the network is held within the Design School and is fully accessible to our members.\n\nJoin the Design School and find people who are organizing near you!\nhttps://lnkd.in/guvJkrgm\n… more\n\nPenny L. Heiple and 12 others reacted\nPenny L. Heiple and 12 others\n\n2 comments\n\n•\n\n1 repost\n\nLike\nComment\nRepost\nSend\n\nPenny L. Heiple reposted this\n\nDesign School for Regenerating Earth\n\n3,969 followers\n\n3d • \n\nThere are a lot of community activities now in the Design School -- including this one led by the StoryMoss Magazine team.\n\nThey will be hosting a narrative writing workshop that begins on November 4th to accompany the \"Speaker for the Earth\" series that began last month. Together our members are learning how to live into their own stories of deep connection with life on Earth.\n\nYou can join by becoming a member of the Design School today!\nhttps://lnkd.in/guvJkrgm\n… more\n\nPenny L. Heiple and 16 others reacted\nPenny L. Heiple and 16 others\n\n1 comment\n\n•\n\n3 reposts\n\nLike\nComment\nRepost\nSend\n\nPenny L. Heiple \n • 1st\n\nCo-Founder Design School for Regenerating Earth\n\n2d • \n\nA bioregional learning center born in the Rivers of the North Sea… 👏🙌🏼\n\nDesign School for Regenerating Earth\n\n3,969 followers\n\n2w • Edited • \n\nIt is so inspiring to see bioregional organizing as it emerges -- like what is happening in the Rivers of the North Sea through the leadership of Design School members Annelieke Verkerk, Sandra Barth-Oosting, and Mark Marijnissen.\n\nLast year, we hosted a learning journey about how to birth a bioregional learning center. This year we continued with a new one on how to organize your bioregion. These thematic areas are about practicing. Immersing ourselves in the process. Learning by doing. \n\nAnd this is exactly what the people living in the Rivers of the North Sea have been doing in earnest. Weaving with others who have similar aspirations -- like all of the different local teams who organize in collaboration with the Bioregional Weaving Labs Collective, Bioregioning South East Ireland, Korowód Bioregional Center, Bioregional Thames, théra, and more.\n\nMany parallel efforts to do their local part that helps regenerate the Earth. This is really happening.\n\nOnward, fellow humans.\n… more\n\nEmmanuelle Chiche and 4 others reacted\nEmmanuelle Chiche and 4 others\n\nLike\nComment\nRepost\nSend\n\nPenny L. Heiple \n • 1st\n\nCo-Founder Design School for Regenerating Earth\n\n5d • \n\nThe energy that's fueled ecological and cultural overshoot has come from pulling ancient carbon out of the Earth exponentially faster than it was sequestered over millions of years by the daily flows of the sun, soil, and plants.\n\nCarbon energy has also fueled the accumulation and power of fungible currency. Current financial capital is untethered from the biophysical constraints of Earth's capacity.\n\nSays regenerative economist John Fullerton, \"I know that the current economy is driven by finance and if the economic premise of our entire global economy is in conflict with the laws of physics, we have a serious problem.\"\n\nIt’s time for the Great (Re)Turning.\n… more\n\nBrian Puppa • 1st\n\nExecutive Director – Legacy Project\n\n6d • \n\nSo much is happening now that it can be very disorienting. People are trying to find their bearings, trying to find a story that makes some sense and can orient them. \n \nThe co-stewards of Bioregional Earth – myself and Legacy Project Founder Susan Bosak, along with Joe Brewer and Penny L. Heiple of the Design School for Regenerating Earth – have been thinking a lot about this, and have written an article together.\n\nWe won't find what we need in the noise. \n \nThere are so many \"theories of change\" and \"transformational ideas\" out there. Somehow we've come to believe that new is better, and abstraction is a higher form of thinking. But then we can't seem to figure out how to implement all the ideas people are generating. It's because we're starting in the wrong place.\n \nWe actually need to start with what's old, and has stood the test of time. And we need to start with what's real, on the ground, right under our feet.\n \nThat's why \"bioregional\" and \"regenerative\" work can't just be the trend of the moment, but has to be understood as living into the story of Bioregional Earth in the context of The Great (Re)Turning.\n \nWe draw on many voices in our latest collaborative article. To quote just one, John Fullerton, this is an \"unfolding, filled with mystery and even magic. It cannot be achieved, only facilitated and participated in.\"\n \nCheck out the whole article about The Great (Re)Turning:\nhttps://lnkd.in/g4puCp-E\n… more\n\n7 reactions\n7\n\n1 repost\n\nLike\nComment\nRepost\nSend\n\nPenny L. Heiple reposted this\n\nDr. Pete Jeffs 🐴 \n • 1st\n\nCultural Ecology / Regeneration & Land healing / Western European Atlantic Coastal BioRegion / Healing Circles & Wildings with Horses / BioRegional educator / StoryMoss\n\n1w • Edited • \n\nA really beautiful article about the #BirdNations, and particularly about three – the amazing journeys of Pterodroma deserta, the #DesertasPetrel; Luscinia megarhynchos, the #Nightingale, and Cygnus columbianus bewickii, #BewicksSwan. This article recounts their extraordinary journeys. It is a delight. \n\nNext Thursday, 23rd October, 4pm GMT, in the Design School for Regenerating Earth, Elyes Mkacher and myself with the Western European Atlantic Coastal BioRegion will be holding a 1-hour celebration of the #BirdNations as BioRegional Ambassadors.\n\nThe #BirdNations connect our #BioRegions, and whilst we can often spend time \"defining\" those regions, it is important to remember that a BioRegion is never isolated – there may be a watershed or a specific ecozone, but, for example, the Western European Atlantic Coastal BioRegion is deeply connected to the region of the #GulfOfMexico, the warm saline waters that will then speed across the Atlantic and warm our region... Many of our #BirdNations – as this article beautifully illustrates – migrate from one BioRegion to another, as they overwinter in one region, and oversummer elsewhere. Watching animations of bird migrations enables us to visualise the to-and-fro movements that contribute to our planetary home. \n\nPlease join us in the Design School for Regenerating Earth next Thursday, for this Inter-BioRegional Event. If you would like to join us please use this link. Membership of the school is $5 a month – a truly great $5 for all the amazingness that the School brings together. Your subscription also helps to fund regenerative projects in the School. \n\nDesign School for Regenerating Earth: https://lnkd.in/eWjtzB84\n\nGuardian article: https://lnkd.in/dwJB2wZC\n… more\n\nPenny L. Heiple and 16 others reacted\nPenny L. Heiple and 16 others\n\n2 comments\n\n•\n\n4 reposts\n\nLike\nComment\nRepost\nSend\n\nPenny L. Heiple reposted this\n\nFrances Pimentel Nevares \n • 2nd\n\nRegenerative Practitioner CoEvolving @Mother 🌎/ Founder, Weaver, Regenerative Real Estate & Sustainability Strategist @CoreHavens Network / Global Investments Advisor @ONECRE / International Correspondent @TheECOChannel\n\n3w • Edited • \n\nQuerida comunidad regenerativa,\n\nLes invitamos con mucha alegría a nuestra próxima llamada del Grupo de Hispanohablantes de la Escuela de Diseño para Regenerar la Tierra (Design School for Regenerating Earth), que se realizará mañana, jueves 9 de octubre.\n\nEsta serie de llamadas, que realizamos cada tres semanas, ha venido creciendo como un espacio de encuentro, inspiración y coaprendizaje para hispanohablantes de distintas regiones del mundo que están comprometidos con la regeneración de sus territorios.💫 \n\nEn estas sesiones compartimos experiencias, aprendizajes y procesos de regeneración territorial desde nuestras distintas biorregiones, mientras fortalecemos vínculos y colaboraciones que tejen la red viva de la Escuela, una red global de comunidades que se organizan como un micelio planetario — conectando corazones, saberes y acciones que restauran los sistemas de vida en la Tierra. 🌏 \n\nLa Escuela de Diseño para Regenerar la Tierra es una plataforma educativa y colaborativa creada por Joe Brewer y Penny L. Heiple, que busca activar una red planetaria de nodos biorregionales en proceso de regeneración ecológica, económica y cultural. A través de cursos, llamadas y espacios abiertos, personas de todo el mundo aprenden juntas a diseñar y co-crear desde los patrones vivos de la Tierra, generando impacto real en sus comunidades. 🌱\n\nNovedad importante✨ \nLa Escuela acaba de implementar cambios estructurales que permiten abrir este espacio al público en general, de manera gratuita, fomentando que más personas puedan participar, aprender y comenzar a organizarse localmente. En esta llamada hablaremos sobre estos cambios y cómo apoyan la creación de más nodos biorregionales en los países de habla hispana y más allá. \n\nHorario:\n10:30 a.m. (EST) / 9:30 a.m. (CST) / 2:30 p.m. (UTC)\n\n💻 Enlace para unirse a la llamada: https://lnkd.in/gpJ8pEbx\n\n🌐 Para unirte a la Escuela y acceder a sus demás clases, recursos y comunidad global: https://lnkd.in/gddmBvJJ\n\nEste es un espacio inclusivo, transparente y colaborativo, donde cada voz cuenta.💚 \n\nAgradecemos profundamente a Joe y Penny por su labor y esfuerzo, a Elyes Mkacher por su apoyo como community tender, y a todos los líderes biorregionales que comparten abiertamente sus procesos, catalizando la regeneración planetaria desde lo local.\n\n¡Te esperamos para seguir aprendiendo, compartiendo y tejiendo juntos este micelio regenerativo de esperanza y acción viva!\n\n📷 Pexels & Akil Mazumder\n\nThe BioFi Project Regenerators Academy en Español Regenerators Salvador Perez Magdalena Urioste Alianza DerechosdelaNaturaleza Juan Sebastián Acosta Estrada Pablo Benavides Paco Briseño Mara Castañon Gílmer Andrés Arroyo Sánchez Felipe Leall Patricia Espinosa Ruiz Consejo de Asentamientos Sustentables de América Latina -CASA Latina-\n… more\n\nShow translation\n\nPenny L. Heiple and 17 others reacted\nPenny L. Heiple and 17 others\n\n4 comments\n\n•\n\n6 reposts\n\nLike\nComment\nRepost\nSend\n\nPenny L. Heiple reposted this\n\nStoryMoss Magazine\n\n73 followers\n\n3w • \n\nStoryMoss was honoured to speak recently with Dr. Pete Jeffs 🐴 for our In Conversation Series! A multi-talented cultural ecologist, designer and artist living on a houseboat in Devizes, UK, Pete hosts the Western European Atlantic Coastal BioRegion in the Design School for Regenerating Earth, and brings his vast depth of cultural and ecological knowledge to the healing and regenerative work of his new initiative, #RootToReef.\n\nPete's work is imbued with the values of Earthcare and respect for people, animals, ecosystems and the planet. His approach is rooted in ecological restoration and human connection.\n\nIn our wide-ranging conversation, Pete shared a taste of his storytelling artistry. As bioregional efforts are often focused on rivers and watersheds, Pete saw the need to complement this with a stronger awareness of coastal perspectives. His bi-weekly seminars in the Design School weave fascinating, thoughtful and deeply researched perspectives on the lifeways and social ecological dynamics of sea grasses, wild horses, oysters, saltmarshes, coastal ancestors, ancient folklore and more. \n\nStoryMoss loved collaborating with Pete in our recent coverage of the r3.0 conference, where he wrote thoughtful and thought-provoking reflections on the Seeqanamâhsak game of the herring, or \"Spring Fish\": https://lnkd.in/dgaDe3nW\n\nAnd on Dr. Lyla June Johnston's keynote presentation on Indigenous, Regenerative BioRegional Design: https://lnkd.in/dQk_rWBu\n\nPete even designed our StoryMoss logo!!\n\nDr. Pete Jeffs 🐴 also recently authored the beautiful, soulful and inspiring #BirdsOfSpirit e-book, a celebration of the Bird Nations with original drawings and indigenous lore, inspired by the wisdom of each species: https://lnkd.in/dGXsERRY\n\nIn a few days, we're excited to share Pete's latest writing reflecting on \"A Murder of Crows\" - birds and language!\n\nVanessa Farr Emmanuelle Chiche Manda Scott Joe Brewer Penny L. Heiple Salvador Perez Marie-Angel Chevrier de Rien Bill Baue Ralph Thurm Dr Karen Lemke, PDC Elyes MkacherIna Päßler-Setzepfandt Maria-Elena Daynes\nhttps://lnkd.in/dBVm6CcJ\n… more\n\nStoryMoss 14 Aug 2025 In Conversation with Pete Jeffs\n\nyoutube.com\n\nPenny L. Heiple and 18 others reacted\nPenny L. Heiple and 18 others\n\n10 reposts\n\nLike\nComment\nRepost\nSend\n\nPenny L. Heiple reposted this\n\nStoryMoss Magazine\n\n73 followers\n\n1mo • Edited • \n\nFor our In Conversation series, StoryMoss explores European indigeneity and the French cultural roots of bioregioning, speaking with Maria-Elena Daynes and Marie-Angel Chevrier de Rien, from the Bioregional Learning Centre of Théra, in the south-west of France. \n\nThe 12th International r3.0 conference held in September 2025 focused on bioregioning, offering a powerful catalyst for hundreds of people around the world to gather in local \"confluences\" held in their bioregions, deepening and exploring how these ideas, imaginings and practices could apply in their local contexts. \n\nA French language confluence held at Théra brought together a bioregioning \"sisterhood\" to deepen into their own bioregional context, exploring new insights about the rural exodus from the region, the terroir and people's cultural identity with the land, the opportunity of addressing traumas to bring inner / outer transformation, and much more. As Maria-Elena and Marie-Angel surface in this beautiful conversation, French bioregionalism has its own distinct cultural root, and offers a powerful opportunity to revisit history and ancestry, and co-envision thriving rural futures grounded in deep connection to the land.\n\nAs Media Partner for the @r3.0 conference, StoryMoss will continue to share stories of bioregional learning and activation in the coming weeks and months!\n\nThera website: https://thera.earth/\n\nEnjoy the conversation!\n\nThanks to the StoryMoss team: Emmanuelle Chiche Dr. Pete Jeffs 🐴Dr Karen Lemke, PDC Salvador Perez David Burman\n\nBill Baue Ralph Thurm Design School for Regenerating Earth Penny L. Heiple Joe Brewer #storymoss\n\nhttps://lnkd.in/dD4WP_55\n… more\n\nStoryMoss In Conversation: Episode 4 Maria-Elena Daynes and Marie-Angel Chevrier de Rien at Thera\n\nyoutube.com\n\nPenny L. Heiple and 10 others reacted\nPenny L. Heiple and 10 others\n\n3 comments\n\n•\n\n6 reposts\n\nLike\nComment\nRepost\nSend\n\nPenny L. Heiple reposted this\n\nElyes Mkacher • 1st\n\nA Collapse acceptant excited about the possibility of regenerating the earth 🙌 🌍 | Regenerative Farmer | Permaculture Designer & Educator | Community Tender | Story Teller | Liberation Thinker | Earth Regenerator\n\n4w • \n\nOnly one week left to start the second Permaculture Design Course Cohort at the Design School for Regenerating Earth . Join Us Now! 🙌 🌱 🌟\n\n#Permaculture #RegenerativeDesign #OnlinePDC #GlobalCommunityofPractice \n\nJoin our Global Community of Regenerative Designers. 🌍✨\n\nElyes Mkacher\n\nPenny L. Heiple and 21 others reacted\nPenny L. Heiple and 21 others\n\n4 comments\n\n•\n\n6 reposts\n\nLike\nComment\nRepost\nSend\n\nPenny L. Heiple reposted this\n\nDesign School for Regenerating Earth\n\n3,969 followers\n\n3w • \n\nWe are excited to have another new series called \"Earth Regeneration in Practice\" that begins in the Design School on October 14th. It will be a gathering place for real-world examples of regeneration at landscape and bioregional scales.\n\nThis series is hosted by Joe Brewer and will incorporate the work he supports in Latin America and throughout the world. Topics that will be explored include the science of Earth Systems, applied cultural evolution, bioregional learning centers, and regenerative finance for bioregional funding ecosystems.\n\nBecome a member of the Design School and join us!\nhttps://lnkd.in/guvJkrgm\n… more\n\nPenny L. Heiple and 32 others reacted\nPenny L. Heiple and 32 others\n\n9 reposts\n\nLike\nComment\nRepost\nSend\nShow all\nExperience\n\nCo-Founder\n\nDesign School for Regenerating Earth · Self-employed\n\nMar 2023 - Present · 2 yrs 8 mos\n\nIn the Design School for Regenerating Earth, we host online courses on organizational development, landscape restoration, and cooperation. One of our main focuses in the school is facilitating learning exchanges between bioregions  doing ecosystem restoration and working to create local living economies in their landscapes. We help to weave dialogues within and between bioregions, and we provide shared language, shared tools, and resources for organizing for regeneration at the landscape scale. \n\nMy work as co-founder includes managing operational activities, finances, administration, technical support, and customer service for the school. In addition, I bring to the school my expertise in project management, community development, prosocial facilitation, biodynamic healing and trauma resolution, unified science, integral philosophy, and regenerative practice. With my comprehensive background in business, finance and project management, I bring a unique combination of heart and organizational expertise to the school.\n… more\n\n Accounting, Integrative Thinking and +7 skills\n\nBiodynamic Healing & Trauma Resolution Practitioner\n\nPenny L. Heiple, BS, RCST®, LMT · Self-employed\n\nJan 2002 - Present · 23 yrs 10 mos\n\nBarichara, Santander, Colombia · On-site\n\nBiodynamic Healing Practitioner. Autonomic Nervous System Regulation and Biodynamic Bodywork, integrating modalities such as Biodynamic Craniosacral Therapy, Polarity Therapy, Quantum-Touch®, Zen Shiatsu, and Integrative Massage, as well as the application of relevant aspects of unified science and integral philosophy.\n\nPlease visit this website for more information on my healing practice:  \n\nhttps://pennyheiple.com\n… more\n\n Polarity Therapy, Energy Healing and +5 skills\n\nCo-Owner\n\nLive It Now Productions, LLC · Contract\n\nMay 2020 - Jan 2023 · 2 yrs 9 mos\n\nUnited States\n\nOnline production, community-building and consulting company working in the evolutionary consciousness & regenerative arenas. Operational direction & coordination, project management, accounting & business services, with an interest in developing decentralized governance models based on regenerative principles & practices. Decades of experience in trauma resolution & biodynamic healing are also applied into the spaces I engage in.\n\nLive It Now Productions, LLC, is currently co-creating and/or consulting with the following initiatives:\n\nhttps://globalcoherencepulse.org/\nhttps://islandsofcoherence.net/\nhttps://www.thriveon.com/\nhttps://higherstatusglobal.com\n… more\n\n Accounting, Integrative Thinking and +6 skills\n\nProject Manager / Community Support / Accountant\n\nResonance Science Foundation · Self-employed\n\nApr 2018 - Aug 2020 · 2 yrs 5 mos\n\nUnited States\n\nProject management, community support, event production and bookkeeping support for the Resonance Academy, an educational community exploring unified science based on the Unified Physics Theory of Nassim Haramein.\n… more\n\n Accounting, Technical Support and +4 skills\n\nBusiness Operations Manager\n\nSchool of Inner Health\n\nMay 2017 - Oct 2018 · 1 yr 6 mos\n\nGreater Colorado Springs Area\n\nBusiness Operations Manger for the School of Inner Health, a holistic educational organization based in the Biodynamic Paradigm offering trainings and courses in Biodynamic Craniosacral Therapy and Neurodynamics (Nervous System Dynamics).\n… more\n\n Accounting, Operations Management and +3 skills\n\nShow all\nEducation\n\nUniversity of Colorado at Boulder\n\nBachelor of Arts (B.A.), Philosophy\n\n2006 – 2008\n\nColorado School of Energy Studies\n\nCertified Biodynamic Craniosacral & Polarity Therapist\n\n2010 – 2012\n\n700-hour biodynamic craniosacral therapy certification training.\n110-hour polarity therapy associate practitioner training.\n\nShow all\nLicenses & certifications\n\nCertified Quantum-Touch Practitioner\n\nQuantum-Touch, Inc.\n\nIssued Nov 2013\n\nAssociate Polarity Therapy Practitioner\n\nColorado School of Energy Studies\n\nIssued Nov 2012\n\nShow all\nVolunteering\n\nHeart Circle Facilitation, Finance, Technical Operations, Volunteer Coordination\n\nHUMANITY'S TEAM\n\nMar 2015 - Present · 10 yrs 8 mos\n\nCivil Rights and Social Action\n\nI volunteered in several areas within Humanity's Team, including IT/Technical support, finance, and volunteer coordinating. Currently, I facilitate Heart Circles for the members of Community Circle.\n\nVolunteer\n\nKauai Hospice\n\nMar 2012 - Sep 2014 · 2 yrs 7 mos\n\nSocial Services\n\nProvided emotional and holistic healing support to patients & caregivers.\n\nShow all\nSkills\n\nSocial Media Marketing\n\nBusiness Operations Manager at School of Inner Health \n\nEndorse\n\nReceptionist Duties\n\nEndorse\nShow all\nRecommendations\nRecommend Penny L.\nReceived\nGiven\n\nGrace (Rebecca) Rachmany\n\n· 1st\n\nBioregional Systems Orchestration, DAO and governance expert, entrepreneur, mentor\n\nMarch 28, 2025, Grace (Rebecca) worked with Penny L. on the same team\n\nPenny's tireless work at the Design School is the foundation that keeps the system running. She is a master of maintaining a positive community vibe, facilitating deep conversations, and taking care of all the little details that keep the system running seamlessly. Penny regularly achieves impossible project outcomes with joy and calm. The best part of working with Penny is that she magically maintains an environment where everyone feels cared for and appreciated for their individual talents and contributions, and everyone feels heard and acknowledged when  they experience limitations.\n\nInterests\nTop Voices\nCompanies\nGroups\nNewsletters\nSchools\n\nIoana Hardy - Marketing for Sustainability \n\n· 2nd\n\n🌍 Value-Based Marketing that fuels impact & growth for impact & sustainability founders I Productise your service & build systems to attract clients consistently I B Corp I LinkedIn Top Voice\n\n16,208 followers\n\nConnect\n\nKees Klomp \n\n· 2nd\n\nActivist Researcher & Developer, Uneconomist, Economic System Change, Existential Economics, Reinventing Business Education \n\n62,304 followers\n\nMessage\nShow all\nCauses\n\nAnimal Welfare • Arts and Culture • Civil Rights and Social Action • Economic Empowerment • Education • Environment • Health • Human Rights • Disaster and Humanitarian Relief • Politics • Poverty Alleviation • Science and Technology • Social Services\n\nPeople also viewed\n\nSamantha Power \n\n· 1st\n\nRegenerative Economist, Futurist, Bioregionalist, Co-Founder & Director of the BioFi Project\n\nMessage\n\nDr. Lyla June Johnston\n\n· 3rd\n\nOrator, musician, scientist\n\nMessage\n\nNate Hagens \n\n· 2nd\n\nEducator, systems thinker, partner and alliance builder for the future of a living Earth and human culture\n\nMessage\n\nTobias Luthe \n\n· 2nd\n\nPhD. Program director and group leader, ETH Zurich. Founding director, MonViso Institute.\n\nConnect\n\nRalph Thurm \n\n· 1st\n\nFounder A|HEAD|ahead, Co-Founder r3.0 & Managing Director OnCommons gGmbH\n\nMessage\nShow all\n\nExplore premium profiles\n\nYooRi Kim \n\n· 3rd\n\nNonprofit Entrepreneur & Philanthropy Advisor\n\nMessage\n\nSusan Kelly \n\n· 3rd\n\nDriving Innovation in Document Search & Access | President @ MicroSearch | JD, Boston College\n\nMessage\n\nTheresa Persico \n\n· 2nd\n\nFounder/CEO at Veebit\n\nConnect\n\nPeople you may know\n\nFrom Penny L.'s industry\n\nHinge Neighbors\n\n· 2nd\n\nCo-Founder\n\nConnect\n\nWilliam     A. Johnson,   Jr.\n\n· 2nd\n\nFounder and CEO, Strategic Community Intervention LLC\n\nConnect\n\nJanelle Orsi\n\n· 2nd\n\nCo-Founder and Staff Attorney, Sustainable Economies Law Center\n\nConnect\n\nHannah Apricot Eckberg \n\n· 2nd\n\nCo-Founder, Executive Director, Etc.  at Abundant Earth Foundation\n\nConnect\n\nStephen DeAngelis \n\n· 2nd\n\nFounder, President and CEO at Enterra Solutions\n\nFollow\nShow all\n\nYou might like\n\nPages for you\n\nTrees for the Future\n\nEnvironmental Services\n\n30,989 followers\n\nEnwangu works here\n\nFollow\n\nForest Carbon and Climate Program\n\nEducation\n\n4,727 followers\n\nYerdieou & 72 other connections follow this page\n\nFollow\nShow all\n\nAbout\n\nAccessibility\n\nTalent Solutions\n\nCommunity Guidelines\n\nCareers\n\nMarketing Solutions \n\nPrivacy & Terms\n\nAd Choices\n\nAdvertising\n\nSales Solutions\n\nMobile\n\nSmall Business\n\nSafety Center\n\nLinkedIn Corporation © 2025\n\nQuestions?\n\nVisit our Help Center.\n\nManage your account and privacy\n\nGo to your Settings.\n\nRecommendation transparency\n\nLearn more about Recommended Content.\n\nSelect language\n\nالعربية (Arabic)\nবাংলা (Bangla)\nČeština (Czech)\nDansk (Danish)\nDeutsch (German)\nΕλληνικά (Greek)\nEnglish (English)\nEspañol (Spanish)\nفارسی (Persian)\nSuomi (Finnish)\nFrançais (French)\nहिंदी (Hindi)\nMagyar (Hungarian)\nBahasa Indonesia (Indonesian)\nItaliano (Italian)\nעברית (Hebrew)\n日本語 (Japanese)\n한국어 (Korean)\nमराठी (Marathi)\nBahasa Malaysia (Malay)\nNederlands (Dutch)\nNorsk (Norwegian)\nਪੰਜਾਬੀ (Punjabi)\nPolski (Polish)\nPortuguês (Portuguese)\nRomână (Romanian)\nРусский (Russian)\nSvenska (Swedish)\nతెలుగు (Telugu)\nภาษาไทย (Thai)\nTagalog (Tagalog)\nTürkçe (Turkish)\nУкраїнська (Ukrainian)\nTiếng Việt (Vietnamese)\n简体中文 (Chinese (Simplified))\n正體中文 (Chinese (Traditional))"
  }
}