{
  "url": "https://www.linkedin.com/in/roberto-forte-ph-d-ba2b2121/",
  "scraped_at": "2025-10-30T11:46:03.993130",
  "extracted": {
    "name": "Roberto Forte Ph.D.",
    "headline": "Montreal, Quebec, Canada",
    "full_text": "Roberto Forte Ph.D.\n\n· 1st\n\nThought leader and Ph.D.; ready to employ expertise as ESG & Sustainability Director, Climate Change and Decarbonization Manager\n\nMontreal, Quebec, Canada\n\n·\n\nContact info\n\nCITEC Panama (Centro de Innovación, Investigación y Tecnología Hidroambiental)\n\nMcGill University\n\n500+ connections\n\nRobert, Ana and 4 other mutual connections\n\nMessage\nAbout\n\nHello, I am Roberto!\nWith a track record as a passionate and influential minded professional, I possess expertise in leading sustainability, ESG, and climate change initiatives, while assessing and measuring decarbonization opportunities.\nI have expansive expertise in leading sustainability integration within core business operations, ensuring alignment with ESG objectives, and driving meaningful change throughout the value chain.\nCollaboration is at the heart of my approach, and I excel at fostering robust partnerships for collective action and create shared value. By leveraging my expertise, I strive to create sustainable business that generate long-term profitability while preserving climate change and risk management. \nMy technical skills are Stella Architect, Microsoft Project, GIS, ATLAS TI, Real-time landscaping Architecture, AutoCAD, Microsoft Office Suite\nPoised for the next level of career success my greatest value to any organization is my ability to work independently, freeing up a leader's time to focus on the needs of the business.\nTo find out more, please connect with me or send me an email at rcfortet@gmail.com. \nFollowing are my key skills:\n•\tClimate Risk Strategy\n•\tSustainability Programs\n•\tEnvironment/Social Impact Analysis\t\n•\tESG & Risk Reporting\n•\tChange Management Plans\n•\tESG Regulations/Legislation Compliance\n•\tEnvironment & Sustainability Practices\n•\tBusiness Solutions & Decisions\n•\tTeamwork & Leadership\n… more\n\nActivity\n\n1,143 followers\n\nPosts\nComments\nImages\n\nRoberto Forte Ph.D. reposted this\n\nCITEC Panama (Centro de Innovación, Investigación y Tecnología Hidroambiental)\n\n590 followers\n\n2w • Edited • \n\n𝐃𝐞𝐥 𝐜𝐨𝐧𝐨𝐜𝐢𝐦𝐢𝐞𝐧𝐭𝐨 𝐥𝐨𝐜𝐚𝐥 𝐚 𝐥𝐚 𝐜𝐢𝐞𝐧𝐜𝐢𝐚: 𝐢𝐧𝐢𝐜𝐢𝐚 𝐞𝐥 𝐦𝐨𝐝𝐞𝐥𝐨 𝐩𝐚𝐫𝐭𝐢𝐜𝐢𝐩𝐚𝐭𝐢𝐯𝐨 𝐬𝐨𝐛𝐫𝐞 𝐥𝐚 𝐞𝐬𝐜𝐚𝐬𝐞𝐳 𝐡𝐢́𝐝𝐫𝐢𝐜𝐚 𝐞𝐧 𝐥𝐚 𝐂𝐮𝐞𝐧𝐜𝐚 𝐝𝐞𝐥 𝐂𝐚𝐧𝐚𝐥\n\nDurante la semana del 6 de octubre de 2025, el Centro de Innovación, Investigación y Tecnología Hidroambiental (CITEC) dio inicio al proceso participativo del proyecto “Desarrollo participativo de un modelo socioeconómico para el análisis de la escasez hídrica en la Cuenca Hidrográfica del Canal de Panamá”.\n\nEste proceso comenzó tras un riguroso análisis de actores clave, en el que se identificaron roles como tomadores de decisiones, usuarios e implementadores, evaluando además sus atributos de poder, legitimidad y urgencia. Este paso permitió establecer un marco inclusivo y representativo de las diversas dinámicas sociales que influyen en la gestión del agua.\n\nYa se encuentran en marcha las entrevistas individuales en campo, lideradas por el Dr. Roberto Forte Ph.D. , Director Ejecutivo de CITEC, y la Mgtr. Alessandra Torrente, con el apoyo de Dabney Gerald Sánchez Ramos, representante del PNUD Panamá, y Gloria Trejos por el Canal de Panamá. A través de estas sesiones se están elaborando diagramas causales de bucle (CLD) junto a los participantes, identificando causas e impactos de primer, segundo y tercer orden, así como las relaciones de retroalimentación que explican las dinámicas de escasez hídrica en la región.\n\nEste esfuerzo colaborativo tiene como objetivo codiseñar un modelo participativo que integre conocimiento local y enfoques sistémicos, contribuyendo al análisis de escenarios y a la toma de decisiones informadas en políticas públicas relacionadas con la gestión hídrica.\nCITEC reafirma su compromiso con la ciencia aplicada, la participación ciudadana y la sostenibilidad de los recursos hídricos del país.\n\n#GestiónHídrica #CuencaDelCanal #EscasezHídrica #ModeladoParticipativo #DinámicaDeSistemas #CienciaAplicada\n… more\n\nShow translation\n\n1/9\n\n17 reactions\n17\n\n1 comment\n\n•\n\n1 repost\n\nLike\nComment\nRepost\nSend\n\nRoberto Forte Ph.D. \n • 1st\n\nThought leader and Ph.D.; ready to employ expertise as ESG & Sustainability Director, Climate Change and Decarbonization Manager\n\n4w • \n\n¡Los invitamos a acompañarnos en APANAC 2025!\n\nhttps://lnkd.in/eQgqCpNS\n\nShow translation\n\nCITEC Panama (Centro de Innovación, Investigación y Tecnología Hidroambiental)\n\n590 followers\n\n4w • \n\n📢 Nuestro Director Ejecutivo, Dr. Roberto Forte, representará a CITEC en el XX Congreso Nacional de Ciencia y Tecnología – APANAC 2025.\n\n💡 Ponencia: Agua en tensión: un modelo participativo para anticipar escenarios en la Cuenca del Canal de Panamá\n📅 Fecha: 2 de octubre\n🕞 Hora: 3:30 p.m. – 4:00 p.m.\n📍 Lugar: Marriott Panamá Hotel, Salón Contadora IV\n\n👉 Un espacio para compartir conocimiento y fortalecer la ciencia al servicio del desarrollo sostenible de Panamá.\n… more\n\nShow translation\n\n23 reactions\n23\n\n1 comment\n\nLike\nComment\nRepost\nSend\n\nRoberto Forte Ph.D. \n • 1st\n\nThought leader and Ph.D.; ready to employ expertise as ESG & Sustainability Director, Climate Change and Decarbonization Manager\n\n1mo • \n\nMe siento sumamente honrado de haber sido considerado para aportar en la Conferencia de Usuarios ESRI Panamá (CUE 2025) — “SIG: Integrando todo, en todas partes”.\nTuve el privilegio de participar en el Conversatorio Científico, un espacio que permitió reflexionar sobre cómo la ciencia y la tecnología geoespacial se integran en la investigación aplicada en Panamá.\nAgradezco esta oportunidad de compartir y seguir construyendo, junto a colegas y aliados, un camino donde el conocimiento científico y las herramientas tecnológicas contribuyan al desarrollo sostenible de nuestro país.\n\n\nhttps://lnkd.in/ej5GkDUK\n… more\n\nShow translation\n\nCITEC Panama (Centro de Innovación, Investigación y Tecnología Hidroambiental)\n\n590 followers\n\n2mo • \n\nEn la Conferencia de Usuarios Esri Panamá Esri Panamá (CUE 2025) — “SIG: Integrando todo, en todas partes” — nuestro director ejecutivo, Dr. Roberto Forte, participó en el Conversatorio Científico, un espacio para reflexionar sobre cómo la ciencia y la tecnología se integran en la investigación aplicada en Panamá.\n\nEn su intervención destacó:\n🔹 En nuestros estudios de investigación, la ciencia geoespacial conecta la escala local con la regional y permite traducir datos complejos en narrativas visuales accesibles que facilitan la comunicación y la gestión de decisiones.\n🔹 Cómo el universo ArcGIS facilita el uso combinado de imágenes satelitales, drones, sensores, modelos digitales y aplicaciones de campo como Survey123, QuickCapture, Dashboards y StoryMaps, creando análisis multiescalares de alto valor y mejorando la divulgación de resultados a diferentes audiencias.\n🔹 En cuanto a oportunidades para fortalecer esta integración: 1) que los investigadores establezcan diálogos tempranos con los expertos de ESRI Panamá desde las fases iniciales de sus proyectos, para aprovechar al máximo las capacidades de estas herramientas; 2) que las instituciones custodias de datos prioricen un levantamiento de información de la mayor calidad posible; y 3) que dichas instituciones promuevan alianzas con centros de investigación como CITEC, que puedan apoyar en la depuración y corrección de los datos, además de garantizar su acceso abierto. Todo esto, de manera que la ciencia pueda realmente ayudar a la sociedad a superar los complejos desafíos que enfrentamos.\n\nEn CITEC creemos firmemente que la ciencia debe convertirse en acción y decisión, y este conversatorio reafirmó el valor de los SIG como catalizadores de ese propósito.\n\n#SIG #ArcGIS #CienciaGeoespacial #CITEC #CUE2025 #Innovación\n… more\n\nShow translation\n\n1/3\n\nAna Calderon and 20 others reacted\nAna Calderon and 20 others\n\n1 comment\n\nLike\nComment\nRepost\nSend\n\nRoberto Forte Ph.D. \n • 1st\n\nThought leader and Ph.D.; ready to employ expertise as ESG & Sustainability Director, Climate Change and Decarbonization Manager\n\n2mo • \n\nAgradecido por la invitación del SIP en su celebración de 80 años de Fundación.\n\nhttps://lnkd.in/eq-zQDnD\n\nShow translation\n\nCITEC Panama (Centro de Innovación, Investigación y Tecnología Hidroambiental)\n\n590 followers\n\n2mo • Edited • \n\nEn el marco del 80.º aniversario del Sindicato de Industriales de Panamá se desarrolló el foro Cambio Climático: Consecuencias Ambientales y Desafíos Naturales.\n\nEl panel reunió a Berta Alicia Olmedo (Instituto de Meteorología e Hidrología de Panamá), Iris Barrios (ANCON (Asociación Nacional para la Conservación de la Naturaleza), Roberto Forte (CITEC Panamá) y Juan Monterrey (MINISTERIO DE AMBIENTE), quienes analizaron los retos del país frente a los fenómenos climáticos extremos, la necesidad de sistemas de alerta temprana, la cooperación interinstitucional y el rol de la innovación tecnológica.\n\nDurante su intervención, nuestro Director Ejecutivo, Roberto Forte, destacó que el concepto de sostenibilidad debe evolucionar hacia una ecología profunda, pasando de la simple optimización de lo existente a una verdadera transformación sistémica, con impactos tangibles y duraderos para Panamá.\n… more\n\nShow translation\n\n1/7\n\n12 reactions\n12\n\nLike\nComment\nRepost\nSend\n\nRoberto Forte Ph.D. \n • 1st\n\nThought leader and Ph.D.; ready to employ expertise as ESG & Sustainability Director, Climate Change and Decarbonization Manager\n\n4mo • \n\nCITEC Panama (Centro de Innovación, Investigación y Tecnología Hidroambiental)\n\n590 followers\n\n4mo • \n\nReflexiones desde el Foro “Agua 4.0, Vida en Desarrollo” – CONEP\n\nHoy, en el segundo día de este importante foro, nuestro Director Ejecutivo, el Dr. Roberto Forte, nos representó como panelista en la sesión “Ecosistema científico para la I+D+i”, compartiendo reflexiones clave sobre el rol de la ciencia aplicada, colaborativa y conectada a la realidad panameña.\n\nAbordar los retos hídricos y climáticos del país requiere integrar innovación tecnológica, participación ciudadana activa y una gobernanza hídrica capaz de adaptarse. Panamá cuenta con ventajas naturales —como su balance de carbono negativo y una de las mayores precipitaciones del mundo—, así como capacidades comunitarias, institucionales y científicas que pueden y deben ser potenciadas.\n\nLos desafíos están claros; el verdadero reto es ejecutarlos con visión estratégica y sentido de urgencia. La sostenibilidad hídrica no depende únicamente de infraestructura o financiamiento, sino de nuestra capacidad colectiva de anticipar, transformar y colaborar.\n\nLa política pública debe apoyarse en evidencia científica, y la ciencia a su vez comprometerse a generar soluciones prácticas que mejoren la vida de las personas. \n\n💧 Desde CITEC reafirmamos nuestro compromiso de impulsar conocimiento que proteja los recursos hídricos, transforme los territorios y contribuya a un futuro sostenible para todos.\n\n#Agua4 #GestiónHídrica #Sostenibilidad #I+D+i #CONEP #Panamá #CITEC\n\n… more\n\nShow translation\n\n1/6\n\n14 reactions\n14\n\n3 comments\n\nLike\nComment\nRepost\nSend\n\nRoberto Forte Ph.D. \n • 1st\n\nThought leader and Ph.D.; ready to employ expertise as ESG & Sustainability Director, Climate Change and Decarbonization Manager\n\n4mo • \n\nLa sostenibilidad del sector ganadero requiere más que buenas intenciones: necesita ciencia, datos y herramientas que permitan medir, comparar y mejorar su desempeño.\n\nhttps://lnkd.in/e-PWrZtS\n\nShow translation\n\nCITEC Panama (Centro de Innovación, Investigación y Tecnología Hidroambiental)\n\n590 followers\n\n4mo • \n\nNos sumamos a la conversación sobre ciencia, tecnología y sostenibilidad en Panamá.\n\nEste martes, 17 de junio, nuestro Director Ejecutivo, Dr. Roberto Forte, participará como vocero en el programa Cyber Break por TVN Radio 96.5, gracias a la invitación de SENACYT Panamá.\n\nTema: Midiendo el Desempeño Ecológico de Fincas Ganaderas: Una Herramienta Geoespacial Aplicada en Coclé\n\nHora: 11:15 a. m.\nSintoniza por: TVN radio 96.5\n\nDesde el Centro de Innovación, Investigación y Tecnología Hidroambiental (CITEC), reafirmamos nuestro compromiso con el desarrollo de soluciones científicas aplicadas al territorio, que impulsen prácticas sostenibles en el sector agropecuario.\n\n#CITEC #InnovaciónHidroambiental #Geotecnología #GanaderíaSostenible #CienciaPanamá #CyberBreak #TVNRadio #SENACYT #DesempeñoEcológico #TransformaciónRural\n… more\n\nShow translation\n\n20 reactions\n20\n\nLike\nComment\nRepost\nSend\n\nRoberto Forte Ph.D. \n • 1st\n\nThought leader and Ph.D.; ready to employ expertise as ESG & Sustainability Director, Climate Change and Decarbonization Manager\n\n4mo • \n\nGracias al Dr. Ricaurte Vasquez , a la Ingeniera Ilya Espino de Marotta , a los miembros de la Junta Directiva de la ACP, y a la Licenciada Gloria Trejos, por darme la oportunidad de aportar desde la perspectiva de ciencia en un día tan emblemático como el día del medio ambiente.\n\nhttps://lnkd.in/eETQZsw8\n\nShow translation\n\nCITEC Panama (Centro de Innovación, Investigación y Tecnología Hidroambiental)\n\n590 followers\n\n4mo • \n\nEn el Día Internacional del Medio Ambiente, nos quedamos con las palabras de nuestro Director Ejecutivo, Roberto Forte Ph.D. , durante el Foro de Gobernanza y Sostenibilidad Hídrica: Equilibrio para el Futuro, organizado por la Autoridad del Canal de Panamá :\n\n“Hoy más que nunca, Panamá necesita una ciencia aplicada, colaborativa y conectada con la realidad del país. Enfrentar los desafíos hídricos y climáticos no será posible sin articular innovación tecnológica, participación ciudadana y una gobernanza del agua que aprenda y se adapte.\n\nPanamá cuenta con fortalezas naturales únicas —como su balance de carbono negativo y una de las mayores precipitaciones del mundo— así como capacidades comunitarias, institucionales y científicas que pueden escalarse.\n\nLos retos están claramente identificados; el verdadero desafío es ejecutar con visión estratégica y urgencia. La sostenibilidad hídrica no depende solo de infraestructura o financiamiento, sino de nuestra capacidad colectiva de colaborar, anticipar y transformar. Y eso requiere que la política pública se fundamente en evidencia científica, y que la ciencia, a su vez, incida en soluciones concretas que mejoren la vida de las personas.\nEl momento es ahora.”\n\n💧 En CITEC seguimos comprometidos con impulsar conocimiento que transforme territorios, proteja los recursos hídricos y contribuya a un futuro sostenible para todos.\n\n#DíaDelMedioAmbiente #SostenibilidadHídrica #CienciaAplicada #CambioClimático #Innovación #GobernanzaDelAgua #CITEC #PanamáSostenible\n… more\n\nShow translation\n\n1/5\n\n13 reactions\n13\n\nLike\nComment\nRepost\nSend\n\nRoberto Forte Ph.D. \n • 1st\n\nThought leader and Ph.D.; ready to employ expertise as ESG & Sustainability Director, Climate Change and Decarbonization Manager\n\n5mo • \n\nhttps://lnkd.in/gnd5wNNJ\n\nCITEC Panama (Centro de Innovación, Investigación y Tecnología Hidroambiental)\n\n590 followers\n\n5mo • \n\n🌍 Desde CITEC, nos unimos al #NatureSummit2025. Nuestro Director, el Dr. Roberto Forte, nos representa con orgullo en el Día 1 de este importante evento global, llevando consigo las voces, los desafíos y el compromiso de nuestra región.\n\n🌊 El tema de hoy: Inversión en los Océanos e Innovación Marítima, pilares clave para un futuro sostenible.\n\n📸 Entre los momentos destacados: la llegada de Robert Mærsk Uggla, Presidente de la Junta Directiva de A.P. Moller - Maersk, y las palabras de apertura del Ministro de Ambiente de Panamá, Juan Carlos Navarro.\n\nPanamá es el punto de encuentro para acelerar la acción climática colectiva. ¡Vamos con todo! 💪🌱\n\n\n#NatureSummit2025 #EnvironmentalAction\n#BlueEconomy #GreenEconomy #ClimateChange #ClimateAction #HeadingToNatureSummit2025\n… more\n\nShow translation\n\n1/5\n\n4 reactions\n4\n\nLike\nComment\nRepost\nSend\n\nRoberto Forte Ph.D. \n • 1st\n\nThought leader and Ph.D.; ready to employ expertise as ESG & Sustainability Director, Climate Change and Decarbonization Manager\n\n5mo • \n\nhttps://lnkd.in/gmYD8y_x\n\nCITEC Panama (Centro de Innovación, Investigación y Tecnología Hidroambiental)\n\n590 followers\n\n5mo • Edited • \n\n🌍🤝 Nuestro Director Ejecutivo Roberto Forte Ph.D. ha iniciado las primeras conversaciones con el Embajador de Dinamarca, Jens Godtfredsen, con el objetivo de explorar oportunidades de colaboración para el desarrollo de proyectos científicos en la Cuenca Hidrográfica del Canal de Panamá.\n\nEstas posibles alianzas buscan impulsar iniciativas enfocadas en la adaptación al cambio climático y en la gestión sostenible del recurso hídrico, áreas clave para el futuro ambiental y social de la región.\n\nAgradecemos la disposición de la Embajada de Dinamarca para avanzar en una agenda conjunta basada en la innovación, la ciencia y la cooperación internacional. 🌱🌐\n\n#CambioClimático #CienciaYTecnología #CooperaciónInternacional #GestiónHídrica #Panamá #Dinamarca #InnovaciónSostenible #CanalDePanama\n#NatureSummit2025 #EnvironmentalAction #BlueEconomy #GreenEconomy #ClimateChange #ClimateAction\n… more\n\nShow translation\n\n30 reactions\n30\n\nLike\nComment\nRepost\nSend\n\nRoberto Forte Ph.D. \n • 1st\n\nThought leader and Ph.D.; ready to employ expertise as ESG & Sustainability Director, Climate Change and Decarbonization Manager\n\n5mo • \n\nhttps://lnkd.in/gnZVc85p\n\nCITEC Panama (Centro de Innovación, Investigación y Tecnología Hidroambiental)\n\n590 followers\n\n5mo • \n\nEn CITEC transformamos los datos en conocimiento. Conoce como gracias a nuestra alianza estratégica con @esripanama , aplicamos los Sistemas de Información Geográfica (SIG) para potenciar nuestras investigaciones y generar soluciones innovadoras con impacto real. 🌱🌎\n\n \n\nShow translation\n\n29 reactions\n29\n\nLike\nComment\nRepost\nSend\nShow all\nExperience\n\nPrincipal Researcher\n\nCITEC Panama (Centro de Innovación, Investigación y Tecnología Hidroambiental) · Permanent Full-time\n\nApr 2024 - Present · 1 yr 7 mos\n\nPanama · Remote\n\nResponsible for leading the Program for Strengthening the Western Biological Corridor of the Panama Canal Watershed. Organize and conduct research in the fields of regenerative agriculture, adaptation to climate change, phytosanitary risk, and promotion of crops suitable for the production of biofuels based on green hydrogen. Managing research funds and programs. Prepare and publish scientific articles in internationally recognized journals.\n… more\n\nMcGill University\n\n7 yrs 2 mos\n\nAssociate Researcher\n\nContract Part-time\n\nJun 2023 - Present · 2 yrs 5 mos\n\nMontreal · Remote\n\nOrganize and conduct research related to small- and large-scale regenerative agriculture systems, as well as climate change adaptation. \nCollaborates with McGill University's Ecological Engineering Laboratory on proposals for research funding.\n\nDevelopment of three scientific publications covering the following topics:\n\n1) Systematic Literature Review of Permaculture as a concept.\n\n2) Incorporating system dynamic modeling and stakeholder analysis into participatory stakeholder processes.\n\n3) Comparing the sustainability of small-scale farming systems through the integration of process models and system dynamics models.\n… more\n\nResearcher & Intern\n\nFull-time\n\nSep 2018 - Jun 2023 · 4 yrs 10 mos\n\nMontreal, Quebec, Canada · On-site\n\nDuring this time period, I developed 55 ha mixed rotational grazing system in Penonome, Panama according to permaculture, organic agriculture, renewable energy, and ecological principles. I was engaged in creating agro-ecological system for Mariato, Panama aimed at cultivation of 5 ha site depending on bio-intensive and permaculture principles within Punta Chame, Panama. Another contribution of mine was as Teaching Assistant for sustained tropical agriculture course during 2020, 2022, and 2023.\nMy key attainments in this role were as follow: \n• Ensured effective engagement in McGill-Dalhousie Agricultural Greenhouse Gases Project as well as Climate Awareness and Action Project.\n• Devised technique for critical components' representation of small farming system and assisted stakeholders in comprehending agricultural system complexities, resulting in obtaining insights and supporting tropical regions with sustainable/progressive agricultural systems adoption.\n• Attained USD 300,000.00+ bank loan for state-of-the-art rotational grazing operation on Panama 55 ha via tactical business plan development.\n… more\n\n Easily Adaptable, Strategic Planning and +10 skills\n\nCEO\n\nPanama Green Building Council · Contract Full-time\n\nAug 2012 - Jul 2018 · 6 yrs\n\nPanamá, Panama · On-site\n\nI was Founder of international forum on sustainable cities, garnering 1000+ participants from 12 countries and 75+ firms within four years' tenure. I led LEED technical meetings for Latin America region and arranged workshops for coaching 300+ LEED experts, while attracting 15+ interns from local/global universities in Germany and Mexico. I established events/seminars portfolio with 40+ activities on yearly basis via PGBC's Education Committee leadership. I played key role in public consultation of National Energy Plan Vision 2015 - 2050.\nHere were my significant contributions to this role: \n• Secured $500 annually in energy bills and raised $25,000+ assets by executing \"Make Us Greener Project\", developing sustainable office case study based on PGBC offices and funded by member's products/systems.\n• Led 35% increase in corporate memberships and fostered sustainability across national/central American level.\n• Minimized staff turnover and generated positive, inclusive workplace.\n• Created PGBC's Business Plan in 2016 - 2018, earning established status in World Green Building Council and accelerating PGBC's income.\n… more\n\n+2\n\n Easily Adaptable, Strategy and +12 skills\n\nProgram Director\n\nSummerhill Group · Contract Full-time\n\nJun 2011 - Jul 2012 · 1 yr 2 mos\n\nNova Scotia, Canada · On-site\n\nDuring this tenure, I led execution of energy efficiency programs for multi-residential properties across Halifax, Antigonish, and Cape Breton. I designed and created training programs for event staff/store associates.\nBelow were my accomplishments in this role: \n• Formulated progress reports and presented to program/business stakeholders, while reporting on program outcomes. \n• Generated engaging program-related marketing and communication materials.\n\nMy additional experience include\nField Engineer / Researcher, Eco-Efficiency Center: Halifax, Canada / Eco petrol: Bucaramanga, Canada\nEnvironmental Manager, ANAM (Environmental Ministry): Panama\nNational Environmental Manager, CEMEX: Panama\n… more\n\n Environmental Consulting, Easily Adaptable and +8 skills\n\nEducation\n\nMcGill University\n\nPhD (Candidate), Bioresource Engineering\n\n2018 – 2023\n\nGrade: A\n\n Attention to details, Executive Management and +14 skills\n\nDalhousie University\n\nMREM, Environmental  Management\n\n2009 – 2010\n\n Attention to details, Business Planning and +14 skills\n\nShow all\nLicenses & certifications\n\nESG Reporting Masterclass\n\nEarth Academy \n\nIssued Apr 2023\n\nShow credential\n\n Executive Management and TCBD\n\nESG Risk Management Masterclass\n\nEarth Academy \n\nIssued Apr 2023\n\nShow credential\n\n Sustainability Reporting, Sustainability Accounting Standards and +4 skills\n\nShow all\nVolunteering\n\nLike for a Better World Magazine\n\nWriter / Columnist\n\nApr 2014 - Apr 2018 · 4 yrs 1 mo\n\nEnvironment\n\nSkills\n\nWork-ethics\n\n3 experiences at McGill University and 2 other companies\n\n5 educational experiences at McGill University and 4 other schools\n\nEndorse\n\nAttention to details\n\n3 experiences at McGill University and 2 other companies\n\n2 educational experiences at McGill University and 1 other school\n\nEnvironmental Professional (EP)\n\nEndorse\nShow all\nRecommendations\nRecommend Roberto\nReceived\nGiven\n\nShivani Rajpal\n\n· 2nd\n\nChief Executive Officer @ Earth Academy\n\nJuly 19, 2023, Shivani was Roberto’s teacher\n\nI have had the pleasure of having Roberto as my student in the ESG Reporting Masterclass this year. I was impressed by the strategic questions that Roberto asked during the session, as it clearly shows the background knowledge he has, as well as curiosity, together with the right mindset to learn the technicalities of the various ESG topics to be able to apply them practically.\nHe has shown that he has the appetite to learn by taking other courses like ESG Risk Management and the prep course for Fundamentals in Sustainability Accounting credential through Earth Academy. In all his engagements, he has always been a keen learner with a positive attitude and mindset for learning. In this dynamic time, Roberto has made sure to stay up to date with the recent developments and technicalities. He would be an asset to any project or organization with his knowledge and skills.\n… more\n\nGrant Clark \n\n· 2nd\n\nAssociate Professor, Department of Bioresource Engineering, Macdonald Campus of McGill University; Ecological engineering; Circular economy; Management of organic materials\n\nMarch 25, 2023, Grant managed Roberto directly\n\nRoberto is pursuing his PhD studies with the Ecological Engineering Research Group at McGill University. He is one of the most organized and hardworking people that I've had the pleasure to work with. He has his eye on his goal and does everything that he can to achieve it. It is inspirational that the motivation behind his studies is to help make agricultural practices more sustainable in Panama and elsewhere in Latin America.\n\nHonors & awards\n\nECO Canada's Environmental Foreign Talent Development Program (2023)\n\nIssued by Eco Canada · Apr 2023\n\nIFARHU-SENACYT Grant: Professional Excellence (2018)\n\nIssued by IFARHU-SENACYT · Aug 2018\n\nAssociated with McGill University\n\nLanguages\n\nEnglish\n\nNative or bilingual proficiency\n\nSpanish\n\nNative or bilingual proficiency\n\nInterests\nCompanies\nGroups\nNewsletters\nSchools\n\nSK Latam\n\n149 followers\n\nFollow\n\nUniversity of Calgary\n\n317,539 followers\n\nFollow\nShow all\n\nPeople also viewed\n\nJavier Sanchez Galan \n\n· 2nd\n\nArtificial Intelligence and Bioinformatic Data Analysis (AI-Bio)\n\nConnect\n\nHernan Avrutin Suarez\n\n· 3rd\n\nCoach Ontológico de Newfield Network\n- Founder \"Office-Fruit\" \n- Founder \"The Healthy Box\"\n- Co-Founder \"Deville Art Studios\" \n\nMessage\n\nJuan José Pimento Emiliani \n\n· 1st\n\nInnovation Leader | Expert in Digital Transformation and Space Technologies | Executive Director at CITEC\n\nMessage\n\nDelaney Adames\n\n· 2nd\n\nIngeniera en Energía y Ambiente | Especialista en GIS y Gestión Ambiental\n\nConnect\n\nAlessandra Ramírez \n\n· 2nd\n\nGIS | Remote Sensing | Geology \n\nConnect\nShow all\n\nExplore premium profiles\n\nMarta Pernas \n\n· 3rd\n\nEntrepreneur, UX/UI designer, and mother of an autistic child. CEO of Marcos Language Apps LLC—on a mission to make a difference for children with language learning challenges.\n\nMessage\n\nTed Christianson \n\n· 3rd\n\nEntrepreneur and CEO\n\nMessage\n\nSusan Kelly \n\n· 3rd\n\nDriving Innovation in Document Search & Access | President @ MicroSearch | JD, Boston College\n\nMessage\n\nYooRi Kim \n\n· 3rd\n\nNonprofit Entrepreneur & Philanthropy Advisor\n\nMessage\n\nYou might like\n\nPages for you\n\nNature Investment Hub\n\nNon-profit Organizations\n\n2,328 followers\n\nNadia & 53 other connections follow this page\n\nFollow\n\nEcological Restoration Alliance\n\nEnvironmental Services\n\n3,834 followers\n\nArjun works here\n\nFollow\nShow all\n\nAbout\n\nAccessibility\n\nTalent Solutions\n\nCommunity Guidelines\n\nCareers\n\nMarketing Solutions \n\nPrivacy & Terms\n\nAd Choices\n\nAdvertising\n\nSales Solutions\n\nMobile\n\nSmall Business\n\nSafety Center\n\nLinkedIn Corporation © 2025\n\nQuestions?\n\nVisit our Help Center.\n\nManage your account and privacy\n\nGo to your Settings.\n\nRecommendation transparency\n\nLearn more about Recommended Content.\n\nSelect language\n\nالعربية (Arabic)\nবাংলা (Bangla)\nČeština (Czech)\nDansk (Danish)\nDeutsch (German)\nΕλληνικά (Greek)\nEnglish (English)\nEspañol (Spanish)\nفارسی (Persian)\nSuomi (Finnish)\nFrançais (French)\nहिंदी (Hindi)\nMagyar (Hungarian)\nBahasa Indonesia (Indonesian)\nItaliano (Italian)\nעברית (Hebrew)\n日本語 (Japanese)\n한국어 (Korean)\nमराठी (Marathi)\nBahasa Malaysia (Malay)\nNederlands (Dutch)\nNorsk (Norwegian)\nਪੰਜਾਬੀ (Punjabi)\nPolski (Polish)\nPortuguês (Portuguese)\nRomână (Romanian)\nРусский (Russian)\nSvenska (Swedish)\nతెలుగు (Telugu)\nภาษาไทย (Thai)\nTagalog (Tagalog)\nTürkçe (Turkish)\nУкраїнська (Ukrainian)\nTiếng Việt (Vietnamese)\n简体中文 (Chinese (Simplified))\n正體中文 (Chinese (Traditional))"
  }
}