{
  "url": "https://www.linkedin.com/in/scotbryson/",
  "scraped_at": "2025-10-30T12:24:11.966343",
  "extracted": {
    "name": "Scot Bryson",
    "headline": "Toronto, Ontario, Canada",
    "full_text": "Scot Bryson\n\nHe/Him\n\n· 1st\n\nSustainable Infrastructure Architect | GP Impactful Capital | Ambassador Top Tier Impact | Space Farmer\n\nToronto, Ontario, Canada\n\n·\n\nContact info\n\nImpactful Capital\n\nhttp://impactful.capital\n\n500+ connections\n\nVincent John, Ron and 119 other mutual connections\n\nMessage\nHighlights\n\n9 mutual groups\n\nYou and Scot are both in Climate Change Professionals, Sustainable Agriculture & Rural Development, and 7 others\n\nAbout\n\nI've dedicated my life and career to solving problems, starting from humble beginnings like picking stones and baling hay in farm fields to mastering the art of transforming rotary engine cars in garages. At the age of 22, I ventured into entrepreneurship, building a multi-million dollar advertising agency over a decade. After successfully selling the business to a New York holding company, my trajectory shifted as I joined the M&A team, contributing to the acquisition of 19 companies within three years.\n\nWhile continuing to build and advise various ventures, I recognized that there are monumental global challenges demanding attention, such as Climate Change, World Hunger, and the imperative for a healthier planet. Motivated by a desire to make a substantial impact, I took part in commercializing and scaling a groundbreaking biotechnology company.\n\nThis journey unveiled a crucial realization—the necessity for a circular project development company capable of rapidly constructing large-scale, impactful technology projects worldwide. Fueled by a sense of urgency, given the staggering number of people facing starvation daily and the alarming pace of climate change, I founded Orbital Farm in 2018.\n\nToday, Orbital Farm is actively engaged in building closed-loop systems with the potential to produce vaccines, medicines, hydrogen energy, and food on a global scale, using water, CO2, and electricity as primary resources. Our vision extends to establishing 200 circular mega projects across the planet, aiming to support and nourish billions of people on Earth while dedicating the next two decades to prototyping and developing technology for future space exploration.\n\nFor me, Orbital Farm isn't just a business; it's my life's work, my dream, and my purpose—a commitment to creating a sustainable and transformative future.\n… more\n\nFeatured\n\nPost\n\nGrateful for another year & energized by the impact ahead!\n\nAs I mark my birthday today, I'm taking a moment to reflect on a year of incredible growth, learning, and, most importantly, impact. It's been a privilege to see visions turn into tangible progress, particularly in areas I'm deeply passionate about.\n\nThis past year has been rich with opportunities to drive change:\n- My speaking engagements, including at the World Summit AI last month, have been invaluable for sharing insights and fostering dialogue on critical industry advancements as we transition to a new AI world driving energy, water and systems changes globally.\n- Collaborating with the forward-thinking team at ESSA Technologies Ltd continues to be a rewarding experience and learning from brilliant scientists who deeply understand and value our natural world. \n- My involvement in Climate Week NYC, through talks and leading sessions, reinforced the urgency and opportunity in sustainable industrial development and finance to step up.\n- Spearheading initiatives in Sustainable AI datacenters has been a key focus, exploring how technology can scale responsibly – a core tenet of the work we are driving at Impactful Capital.\n- Our progress with Green Bonds, in partnership with the Climate Bonds Initiative, and the positive traction we're seeing, underscore the power of innovative finance in achieving climate goals. This strategic approach is central to how I view long-term value creation and change at global scales.\n- It's been immensely fulfilling to connect with hundreds of brilliant founders and groundbreaking technologies, and world changing projects helping them navigate the path to funding and growth. This exposure to cutting-edge innovation constantly refines my perspective. It gives me unbelievable hope and reaffirms my understanding of how solvable the challenges we are facing are today.\n- Exploring the frontiers of space technology with NASA - National Aeronautics and Space Administration and NIAC remains one of my favorite activities and has also been a fascinating reminder of the boundless potential of human ingenuity.\n\nThese experiences affirm my belief that strategic, informed capital can be a powerful force for good. My mission is to identify and support these transformative opportunities, and I'm incredibly proud of the strides we're making in the work, the projects and the world.\n\nThank you to my Wife and Daughter, my team members, network of colleagues, mentors, and friends who have been part of this journey. I truly value the connections with fellow leaders, investors, and innovators who share a commitment to building a more sustainable and prosperous future.\n\nI’m more energized than ever for what’s next and always welcome conversations with those who are passionate about shaping a truly impactful tomorrow.\n#BirthdayReflection #ImpactInvesting #SustainableFinance #Innovation #ThoughtLeadership #FamilyOffices #LimitedPartners #OrbitalFarm #ImpactfulCapital\n\n86 · 25 comments\n\nPost\n\nI am honored today to have been invited to the United Nations General Assembly #SummitoftheFuture to contribute and discuss strategies for #climateaction\n\nTogether the world is stronger, our voices have meaning and power. \n\nWe live in a world of unbelievable capabilities and potential, but we must take action towards building the future we want to live in today, and for a brighter tomorrow.\n\n178 · 17 comments\n\nPost\n\nIt was a pleasure to speak together with Kimberly Schmitke from Autum Goose Coaching (autumngoose.ca) If you're curious about learning more about Orbital Farm my perspective, and the change that we all need to drive to survive and thrive, please take a listen. Kim's other episodes are wonderful and engaging. Listen to her podcasts here: autumngoose.ca/podcast-1 #podcast #change #climatecrisis #climateaction #netzerocarbon\n\n16 · 3 comments\n\nLink\n\nFood From Thin Air: The Forgotten Space Tech That Could Feed Planet Earth\n\nForbes\n\nForgotten for half a decade, a microbial recipe for sustaining astronauts on long space missions might not only feed hundreds of millions of hungry people on Earth, but also hold the key to a truly carbon neutral, circular economy.\n\nActivity\n\n0 followers\n\nPosts\nComments\nImages\n\nScot Bryson \n • 1st\n\nSustainable Infrastructure Architect | GP Impactful Capital | Ambassador Top Tier Impact | Space Farmer\n\n1w • \n\nFrom Moon missions to Earth’s recycling bins, NASA - National Aeronautics and Space Administration's LunaRecycle Challenge is searching for the next wave of sustainability innovators.\n\nAfter awarding $850,000 in Phase 1, the challenge now enters Phase 2: a hands-on, $2M phase focused on prototyping #recycling technologies and developing digital twins for long-term #lunar missions.\n\nYour ideas could help #NASA astronauts thrive on the #Moon and help communities on Earth reduce #waste in new ways. \n\nSubmit your solution by Jan. 22, 2026 >>\nhttps://lnkd.in/gH-UMHWE\n\n#competition #Space #Prize\n… more\n\n10 reactions\n10\n\nLike\nComment\nRepost\nSend\n\nScot Bryson reposted this\n\nLindsey Chapman \n • 2nd\n\nNVIDIA | AI | HPC | ML | Robotics | Manufacturing | Retail | Aerospace\n\n2w • Edited • \n\n🚀 Toronto registration is OPEN! \n \n For all my #Aerospace and #Satellite enthusiasts, I am hosting in partnership with Space Happy Hour, Roberta's night - honoring our first Canadian astronaut, Roberta Bondar. \n \n Mark your calendars for November 13, 2025, as we gather WORLDWIDE to connect, celebrate, and support the future of aerospace. We are proud to partner with Women in Aerospace Canada, SSPI-WISE and the EXPLR + National STEM Festival in this mission to strengthen women's presence in aerospace and champion #STEM education. We will be raising money to send students to the 2026 festival on our website and through mission patch sales at our events.\n\nTo register for Toronto SHH event, visit this link: https://lnkd.in/gbFNHB_i\n\n👩‍🚀 Honor the Women who went First!\n🚀 Give to the next generation!\n🥂 Celebrate Women across the world and receive a custom mission patch!\n\nFor all my global contacts, you can participate too! \n\n • USA: Sally's Night \n • Canada: Roberta's Night\n • UK: Helen's Night\n • France: Claudie's Night\n • Germany: Rabea's Night\n • Japan: Chiaki's Night\n \n Questions, reach out to me and hope to see you there!\n\nSarah Freese ☁️🚀 | Craig Baerwaldt 🚀 🤖 ⚙️ | Women in Aerospace Canada\n… more\n\nScot Bryson and 65 others reacted\nScot Bryson and 65 others\n\n8 comments\n\n•\n\n11 reposts\n\nLike\nComment\nRepost\nSend\n\nScot Bryson reposted this\n\nMarcia Toledo Sotillo \n • 1st\n\nDirector Adaptation & Resilience @ Climate High-Level Champions|\n\nScaling adaptation solutions and finance that benefits people, nature and the economy\n\n2w • \n\nThis is the job of the future!\n\nRachel Hemingway • 2nd\n\nClimate Bonds Initiative - Head of Strategic Programme Design\n\n2w • Edited • \n\nCalling all adaptation and resilience experts - we're hiring a global resilience lead to drive forward and provide expert leadership for our new resilience programme. This programme is intended to provide the tools and policy frameworks needed to ensure all investments can be future-proofed against projected climate impacts whilst avoiding harm to other objectives such as mitigation, biodiversity protection and environmental justice. \n\nThis is not a position that will involve structuring financial instruments or managing funds - Climate Bonds is an NGO that develops tools to define climate credibility. We are looking for strategic thinkers with practitioner experience of adaptation and resilience who are able to drive internal and external alignment and support for our mission. \n  \nInterviews will be held on a rolling basis and we are looking to fill the position quickly. \n\nFlexible, home-based working - globally remote but with a preference for +/- 4 hours from GMT.  \n\nWe will be hiring a number of resilience experts to fill upcoming senior to junior roles so watch this space  \n\nClick on the link below to apply. \n\nPls share across networks Marjorie Ménard Emilie Beauchamp Mark Kowal Mirey Atallah Ina Hoxha (Zaloshnja) Catherine Desiree Gamper Celsa Monros Hector Maletta Anna Taylor Patrick Pringle Richard Smithers Kit England Marcia Toledo Sotillo Jessica Troni Katharine Vincent Leon Kapetas Lis Mullin Bernhardt Catherine Pettengell Nanki Kaur Sudeshna Raychaudhuri Fiona Percy Sandie-Gene Muir Sushila Pandit Shairoz Nathoo Ph.D Maheen Arshad Christine Roehrer Colin McQuistan Samantha Burgess, PhD\n\n#hiring #remote #job #homebased #climate #resilience #adaptation\nhttps://lnkd.in/dvV9k8SH\n… more\n\nGlobal Head of Resilience Finance - Climate Bonds Initiative\n\napply.workable.com\n\nMarcia Toledo Sotillo and 43 others reacted\nMarcia Toledo Sotillo and 43 others\n\n4 comments\n\n•\n\n6 reposts\n\nLike\nComment\nRepost\nSend\n\nScot Bryson \n • 1st\n\nSustainable Infrastructure Architect | GP Impactful Capital | Ambassador Top Tier Impact | Space Farmer\n\n2w • \n\nA great position to drive great impact!\n\nColin Deacon 🇨🇦🇺🇦 \n • 2nd\n\nIndependent Senator, Senate of Canada\n\n2w • Edited • \n\nI’m looking for a great new team member! \n\nThe passion that motivates our work everyday is that “an innovative economy needs an innovative government.” To this end, we work to identify and advance important legislative and policy options that will accelerate the creation of globally competitive opportunities, jobs and prosperity in Canada, and create a more inclusive, resilient, and sustainable future.\n\nSpecifically, we’re hiring a new Parliamentary Research Assistant to help us to identify important initiatives that will drive competition, innovation, the discovery and application of important technologies, and modernize procurement and regulation.\n\nThis position offers the opportunity to support our office’s work through research, analysis and strategic communication. You will contribute directly to:\n\n👉 Shaping legislation and policy, \n👉 Engaging with stakeholders and other legislators,\n👉 Deciding how we engage on a given issue, and\n👉 Supporting the smooth functioning of a very busy office.\n\nOur hope is that this role will help you to launch a highly engaging, exciting and rewarding career at the Senate and beyond.\n\nPlease have a look! For more details and to apply, follow the link below. Additionally, you can learn more about what we do on my LinkedIn page and at colindeacon.ca:\n… more\n\nSenate of Canada\n\nsencanada.hiringplatform.ca\n\n2 reactions\n2\n\n1 repost\n\nLike\nComment\nRepost\nSend\n\nScot Bryson \n • 1st\n\nSustainable Infrastructure Architect | GP Impactful Capital | Ambassador Top Tier Impact | Space Farmer\n\n2w • \n\nArticle 6.4 is the mechanism that will unlock significant potential for low cost carbon sequestration to happen at scale. When we can unburden the geographical limitations of countries abilities to sequester carbon the lower cost, permanent sequestration places will become highly valuable, and more critically, abundantly used.\n\nBeatriz Granziera • 2nd\n\nSenior Climate Policy Advisor at The Nature Conservancy\n\n2w • Edited • \n\n💥 We have a decision! 🌍 The #Article6.4 Supervisory Body has just adopted the rules on #permanence, after an intense week of negotiations\n\nHere’s a quick summary of where things landed.\n\n💡 Main takeaway 💡 : This is a much better text than what we had at the start of the week. It was #encouraging to see several countries raising their voices to keep nature in the process and to ensure that the overwhelming reaction from so many stakeholders was taken into account. There is still work to be done and challenges ahead for the participation of Nature in this mechanism, but these will be dealt with within the specific context of each activity.\n\nHere are the four main “buckets” of the decision:\n\n🌏 Post-crediting monitoring\nThe idea of #“indefinite” post-crediting monitoring has been #rejected by the SBM. Instead, in the future, each #methodology (not the “standard”) will determine how many years of monitoring are required — reflecting that different sectors have different monitoring needs. The Supervisory Body will still have to approve it, as it would have been the case anyway. A notable new clarification is the separation of responsibilities and liabilities after the crediting period: one for monitoring, and another for addressing reversals. This could allow a host country or third party to assume monitoring responsibilities, while the liability for remediating reversals remains with the activity participants until they can provide alternative measures to remediate reversals, such as insurance, guarantees or financial products.\n\n🌏 Negligible risk of reversals\nFixed numerical rates for “negligible risk” were removed. Instead, the percentage defining a negligible risk will be established within each methodology and reflected in the risk assessment tool — This ensures that you define how to assess risk, BEFORE defining risk rates, which is crucial. This will be presented as a #“package” which was the original mandate and requested by many stakeholders.\n\n🌏 Remediation actions to address reversals\nThis section now clarifies possible “exit” options for projects if they fully remediate the risk of reversals: Cancelling an equivalent number of credits, or transferring risk through insurance or third-party guarantees. The Supervisory Body will provide further guidance, but it’s essential that flexibility and #innovation remain central — including options like buffer pools, insurance products, and transfer of liability to third parties.\n\n🌏 ”Help, host countries!”\nA more technical but important point: when (or whether) a corresponding adjustment should be applied to units held in the buffer pool. There’s a general consensus that neither the SBM nor the MEP has the authority to decide on the point of the first transfer (which triggers the corresponding adjustment). The SBM will consider the accounting implications and the application of corresponding adjustments, opening a call for inputs from host countries to gather practical guidance.\n… more\n\nScot Bryson and 3 others reacted\nScot Bryson and 3 others\n\nLike\nComment\nRepost\nSend\n\nScot Bryson \n • 1st\n\nSustainable Infrastructure Architect | GP Impactful Capital | Ambassador Top Tier Impact | Space Farmer\n\n3w • \n\nThe latest EAT Lancet report of out! A moment to take stock and understand the wider systems of our food and the growing sector of emissions and the most exposed to a volatile world. We are very unprepared for the coming decades and we are not even walking at the pace needed. We should be sprinting towards a transition!\n\nWith the clear goals to make adjustments towards, I'm most excited about the increase in vegetable and legumes production! The water savings and reducing the nitrogen & phosphorus I think we'll do a great job at with the deployment of already existing better technology, monitoring and capture. \n\nI do have a deep concern with achieving our red meat & GHG emissions reductions though. This is going to be very difficult.\n\nLooking forward to hearing others perspective on this and where you see some of the near term opportunities for big wins? Who are the large firms that are the willing to make big changes in 2026? \n\nPlease tag specificly who I should connect with to help finance their transition or supply chains to enable the changes we need to achieve?\n\n#investment #greenbonds #climate #climatebonds #agriculture #food\n… more\n\nReyes Tirado • 2nd\n\nGlobal Lead for Agrifood | Climate Finance & Sustainable Agriculture Expertise | Strategic Leadership in Managing Global Initiatives\n\n3w • \n\nEAT Lancet report is out today (with lots of brilliant materials for a long digestion). \n\nA quick tip. For all of us working on #transition, Figure 17 is a gem to answer this fundamental question: \n\nWhat are the rates of change needed in the agrifood system to keep our planet safe for humans?\n\n⬇️ Annual reductions needed in agrifood: \n-5% in emissions GHG \n-5% in red meat\n-3% in irrigation water \n-2-3% in N and P overuse\n-1% in land use\n\nOugh, those are very large rates needed! With lots of transition costs associated to them. #Greenfinance need to come to the rescue there (as also pointed out in their conclusions). Climate Bonds Initiative focuses on guidance and taxonomies for how to do it! \n\n⬆️ Bright side: increases (i.e. growth opportunities) are essential in: \n+5% legume production\n+2% vegetable production\n+0.5% wages\n\nOur technical guidance for agrifood transitions is here to help. What is your main question or doubt? Let me know! 💬\n\n#AgrifoodCriteria #GreenFinance #AgrifoodTaxonomy\nIndia Langley Shaoxin Li Leonardo Gava Mataram Leandro Waquil Rachel Hemingway\n\nLink to report in comment. \n… more\n\n5 reactions\n5\n\nLike\nComment\nRepost\nSend\n\nScot Bryson reposted this\n\nAnkur Nagpal 💰 \n • 2nd\n\nFounder @ Carry, Silly Money, Teachable | Build durable wealth with proven tax, finance, & business tactics\n\n4w • Edited • \n\nI raised $5M for my startup without a pitch deck \n\nHere is exactly what I did to close the round in weeks\n\n(and be oversubscribed for two trenches of early financing)\n\nInstead of obsessing over slides, I focused on conversations\n\nBecause the truth is early-stage investors don’t fund your deck\n\nThey fund you!\n\nWhat worked for me:\n\n- I had a clear thesis that tax optimization for founders & high earners was broken and that we could fix it\n\n- I spoke directly to investors I knew aligned with that thesis (typically the longest time is spent just finding these people!)\n\n - I wrote a Notion doc that laid out the problem, solution, and why it should be built now (always critical to highlight tipping points!)\n\nWe didn’t have a 20-slide deck\n\nJust a clear story and conviction\n\nIronically, our “deckless” raise was oversubscribed\n\nAnd it went against all the conventional wisdom I’d been told for the last decade\n\nIf you’re a founder or aspiring entrepreneur, I’ve worked with the Notion for Startups Team (#sponsored) to put together a comprehensive system to replicate this process for your next raise\n\n(based on my experience raising with Notion docs!) \n\nIt includes: \n\n- The exact doc I used to raise the seed round for Carry (+50 more examples from the likes of Eleven Labs, Artisan AI, Series, and more)\n\n- A list of 10,000+ angels, accelerators, and VCs you can reach out to today (can’t even imagine how long it would take to do this manually!)\n\n- And a fundraising agent workflow built right into Notion with step-by-step instructions on how to use the prompts (no GPT or Claude required)\n\nI didn’t have these kinds of resources when I was getting started but this genuinely would have been soooo useful (and probably save me months of my life lol)\n\nTo receive your copy, all you have to do is:\n\n- Like this post\n- Share this post\n- Comment “RAISE”\n\n---\n\nEDIT: We've surpassed our ability to reply to all comments on a daily basis. For quick access, you can enter your enter here for the guide: https://ntn.so/silly-money\n… more\n\nAbigail ‘Abi’ Brody and 2,057 others reacted\nAbigail ‘Abi’ Brody and 2,057 others\n\n3,071 comments\n\n•\n\n227 reposts\n\nLike\nComment\nRepost\nSend\n\nScot Bryson \n • 1st\n\nSustainable Infrastructure Architect | GP Impactful Capital | Ambassador Top Tier Impact | Space Farmer\n\n1mo • Edited • \n\nLast week, I had the privilege of attending the 2025 Energy Storage Canada Conference in Toronto—a gathering of innovators, entrepreneurs, developers, and policymakers all shaping the future of energy.\n\nI was especially honored to join The Hon. Stephen Lecce, Minister of Energy and Mines, in a discussion on how we can unlock the full potential of Ontario’s mid-sized development firms—the backbone of renewable energy in our province, and a key driver of Canada’s leadership on the global stage.\n\nAs AI adoption accelerates and energy security becomes a top priority worldwide, the role of SME project developers has never been more critical. These are the risk-takers who transform a concept into a bankable, operating solar farm, battery storage project, or long-duration energy storage asset. They lay the groundwork for billions of dollars in infrastructure that secures our grid, powers our industries, and drives sustainable growth.\n\nYet, too often, these firms lack the financial support they need at the earliest—and riskiest—stages of development. Institutional investors have a vital opportunity to step up: to provide risk-aligned capital that helps projects reach bankable status and ensures Canada’s track record in mining and infrastructure translates into the clean energy future.\n\nAt Impactful Capital, I am focused on championing this model here in Ontario—and scaling it across North America and globally. Canadians have an outsized role to play in advancing sustainable finance, infrastructure, and AI, and it begins with empowering the developers who build the foundation.\n\n👉 If you’re an investor, policymaker, or industry leader passionate about accelerating sustainable infrastructure, I’d love to connect and continue the conversation.\n#EnergyStorage #SustainableFinance #ImpactInvesting #CleanEnergy #OntarioLeadership #FutureOfEnergy #CanadianInnovation\n… more\n\nScot Bryson and 42 others reacted\nScot Bryson and 42 others\n\n5 comments\n\nLike\nComment\nRepost\nSend\n\nScot Bryson reposted this\n\nToronto Climate Week | TOCW\n\n2,683 followers\n\n1mo • \n\nBig media win 🚨 ESG News sat down with our founder & Executive Director, Becky Park-Romanovsky, to talk about building Toronto Climate Week and Canada’s role in shaping the global climate future.\n\nFrom highlighting Toronto’s innovation ecosystem to Canada’s leadership opportunity, this feature reinforces why October 1–3 matters—and how TOCW is set to become a launchpad for lasting climate solutions.\n\nRead the full conversation here ➡️ https://lnkd.in/grmC67dr\n\n#TorontoClimateWeek #ClimateAction #Toronto\n\n… more\n\nScot Bryson and 21 others reacted\nScot Bryson and 21 others\n\n4 reposts\n\nLike\nComment\nRepost\nSend\n\nScot Bryson reposted this\n\nRandy Tyrrell • 2nd\n\nEnvironmental Sustainability - Advisory Boards - Event Production - Public Speaking - Networking - Promotional Marketing\n\n1mo • \n\nSOLD OUT!!!\n\nA couple Toronto Climate Week | TOCW sessions are already full to capacity and others are close to full / sold out. \n\nClimate Creatives Hangout and Rebooting Green Business are now waitlist only.\n\nBeer & Batts and True North Rising (Opening Ceremonies) are near capacity.\nhttps://luma.com/kpztgj3l\nhttps://luma.com/t9etfsgo\n\nAll TOCW events have limited capacity. Many will sell out/fill up.\nEvent organizers may batch approve registrations.\n\nDon't miss out! Sign up for your first choices today.\n\nhttps://www.tocw.ca/events\n\n#Toronto #Environment #Sustainability #ClimateChange #Events #Leadership #Canada\n… more\n\nScot Bryson and 45 others reacted\nScot Bryson and 45 others\n\n6 comments\n\n•\n\n8 reposts\n\nLike\nComment\nRepost\nSend\nShow all\n\nPeople also viewed\n\nMurat Aktihanoglu \n\n· 2nd\n\nVC in tech and climate since 2011 with 375+ investments, Co-Founder and Managing Partner at ERA, Remarkable Ventures and Remarkable Ventures Climate\n\nFollow\n\nAlessa Berg \n\n· 2nd\n\nFounder and CEO, Top Tier Impact\n\nFollow\n\nMike Schatzman \n\n· 2nd\n\nVC | Helping AI-driven founders build companies from the ground up | Founder: Venture Forward Capital | Advisor | Emerging fund manager | 3x exited entrepreneur | Board director | Restaurateur\n\nConnect\n\nMonica Talbert \n\n· 2nd\n\nCo-Founder and CEO @ The Plant Based Seafood Co. | Sustainability\n\nFollow\n\nNelson Switzer \n\n· 2nd\n\nThe Gigacorn Hunter | Turning Climate Solutions into Billion-Dollar Returns | VC Investor | Bestselling Author | TEDx Speaker\n\nFollow\nShow all\n\nExplore premium profiles\n\nDuke Pham \n\n· 3rd\n\nFounder at Phonomenal, Inc\n\nMessage\n\nMarta Pernas \n\n· 3rd\n\nEntrepreneur, UX/UI designer, and mother of an autistic child. CEO of Marcos Language Apps LLC—on a mission to make a difference for children with language learning challenges.\n\nMessage\n\nJoshua Ferrazzano \n\n· 3rd\n\nCo-Founder / Managing Partner at World War Seven\n\nMessage\n\nYooRi Kim \n\n· 3rd\n\nNonprofit Entrepreneur & Philanthropy Advisor\n\nMessage\n\nYou might like\n\nPages for you\n\nTrees for the Future\n\nEnvironmental Services\n\n30,990 followers\n\nEnwangu works here\n\nFollow\n\nForest Carbon and Climate Program\n\nEducation\n\n4,727 followers\n\nYerdieou & 72 other connections follow this page\n\nFollow\nShow all\n\nAbout\n\nAccessibility\n\nTalent Solutions\n\nCommunity Guidelines\n\nCareers\n\nMarketing Solutions \n\nPrivacy & Terms\n\nAd Choices\n\nAdvertising\n\nSales Solutions\n\nMobile\n\nSmall Business\n\nSafety Center\n\nLinkedIn Corporation © 2025\n\nQuestions?\n\nVisit our Help Center.\n\nManage your account and privacy\n\nGo to your Settings.\n\nRecommendation transparency\n\nLearn more about Recommended Content.\n\nSelect language\n\nالعربية (Arabic)\nবাংলা (Bangla)\nČeština (Czech)\nDansk (Danish)\nDeutsch (German)\nΕλληνικά (Greek)\nEnglish (English)\nEspañol (Spanish)\nفارسی (Persian)\nSuomi (Finnish)\nFrançais (French)\nहिंदी (Hindi)\nMagyar (Hungarian)\nBahasa Indonesia (Indonesian)\nItaliano (Italian)\nעברית (Hebrew)\n日本語 (Japanese)\n한국어 (Korean)\nमराठी (Marathi)\nBahasa Malaysia (Malay)\nNederlands (Dutch)\nNorsk (Norwegian)\nਪੰਜਾਬੀ (Punjabi)\nPolski (Polish)\nPortuguês (Portuguese)\nRomână (Romanian)\nРусский (Russian)\nSvenska (Swedish)\nతెలుగు (Telugu)\nภาษาไทย (Thai)\nTagalog (Tagalog)\nTürkçe (Turkish)\nУкраїнська (Ukrainian)\nTiếng Việt (Vietnamese)\n简体中文 (Chinese (Simplified))\n正體中文 (Chinese (Traditional))"
  }
}