{
  "url": "https://www.linkedin.com/in/scott-schulte-6a75a97/",
  "scraped_at": "2025-10-30T11:46:55.899160",
  "extracted": {
    "name": "Scott Schulte",
    "headline": "Associate Professor of the Practice, KU Edwards Campus",
    "full_text": "Scott Schulte\n\nHe/Him\n\n· 2nd\n\nAssociate Professor of the Practice, KU Edwards Campus\n\nOverland Park, Kansas, United States\n\n·\n\nContact info\n\nThe University of Kansas\n\nUniversity of Kansas\n\n500+\n\nconnections\n\nBrian and Alan are mutual connections\n\nMessage\nPending\nActivity\n\n1,408 followers\n\nFollow\nPosts\nComments\nImages\n\nScott Schulte reposted this\n\nStephanie Hall \n • 3rd+\n\nSeasoned Executive Administrator | Community Advocate | Coffee-Fueled Wanderer | Aspiring Lifelong Athenian | Proud Dog & Kid Mom\n\n2mo • \n\nThe 3rd annual Rock Chalk Run is Sunday, Oct. 5 at the KU Edwards Campus! 🏃‍♂️ Choose from a 10K, 5K, or 1K Fun Run and enjoy music, food, and family fun — all supporting scholarships for KUEC students.\nRegister here 👉 https://hubs.la/Q03FGww10\n(prices rise after Labor Day).\n\nKU Edwards Campus\n\n3,141 followers\n\n2mo • \n\nGet ready to run for a good cause!Join us for the 3rd annual Rock Chalk Run, Sunday Oct. 5, at the KU Edwards Campus. Choose your challenge: 10K, 5K, or 1K Fun Run. Enjoy live music, food trucks, and family fun – all while supporting scholarships for KUEC students. Register today at https://hubs.la/Q03FGww10. (Prices increase after Labor Day.) Thanks to our many great sponosors including John Olander, #SportsRadio810, #TheDeBruceFoundation, #Garmin, and #Pepsi. \n\n2 reactions\n2\n\n2 reposts\n\nLike\nComment\nRepost\nSend\n\nScott Schulte reposted this\n\nErin Ollig, AICP • 3rd+\n\nManager, Strategic Planning Division at City of Overland Park\n\n2mo • \n\nEngineer colleagues! We have a great job opportunity in the Planning Department!\n\nCity of Overland Park\n\n7,128 followers\n\n2mo • \n\nPrivate development. Public impact.\n\nWe’re hiring a Supervisory Civil Engineer to lead a team that reviews private development plans and inspects infrastructure projects across the city.\n\nFrom floodplain management to final plats, you’ll play a key role in ensuring our community grows responsibly and sustainably. This leadership role works closely with developers, residents, staff and elected officials to support safe, efficient development.\n\nLearn more and apply now at http://bit.ly/4ffsml3.\n\n… more\n\n8 reactions\n8\n\n2 reposts\n\nLike\nComment\nRepost\nSend\n\nScott Schulte reposted this\n\nBonnie J. Johnson, FAICP, PhD \n • 3rd+\n\nAssistant Director, School of Public Affairs & Administration at University of Kansas \n\n3mo • \n\n#jayhawkplanners spread the word! Job opp working with us!\n\nCari Ann Kreienhop \n • 3rd+\n\nAccreditation - Curriculum - Public Sector Career & Job Search Coaching\n\n3mo • \n\nI am an integral and valued member of two fantastic teams at the University of Kansas - The College Office of Graduate Affairs and The School of Public Affairs & Administration - and am hiring a Graduate Program Coordinator. Join me in supporting the graduate education goals of future leaders in public administration and urban planning!\n\nhttps://lnkd.in/gCC2hJya\n\n#hiring #university #graduateschool #programcoordinator\n#publicsector #highereducation\n\n… more\n\nJob Posting\n\nemployment.ku.edu\n\n6 reactions\n6\n\n1 repost\n\nLike\nComment\nRepost\nSend\n\nScott Schulte reposted this\n\nStuart Day \n • 3rd+\n\nDean, School of Professional Studies | Vice Provost | University of Kansas | Kansas City Metro | Professor of Spanish | Managing Editor, LATR | Performance Studies | ICF / CEC Certified Higher Education Executive Coach\n\n4mo • Edited • \n\nI’d like to invite you to an in-person executive coaching certification seminar at KU Edwards July 23-25. Andrew Neitlich, Center for Executive Coaching (CEC) founder and director will lead (with a little help from me). It’s a great opportunity to level up your coaching skills and earn a dual executive coaching certificate from the University of Kansas and CEC. You’ll also connect with a new network of like-mined community of professionals. Last summer’s seminar included attendees from 17 states and Canada who found the event invaluable and enjoyable!\nLearn more about how the in-person Executive Coaching Certificate Seminar can take your career to new heights. https://lnkd.in/g6d7zpyh\n\nCEC & KU In-Person Seminar\n\ncenterforexecutivecoaching.com\n\n22 reactions\n22\n\n3 comments\n\n•\n\n9 reposts\n\nLike\nComment\nRepost\nSend\n\nScott Schulte \n • 2nd\n\nAssociate Professor of the Practice, KU Edwards Campus\n\n4mo • \n\nThis guy, Bill Maasen, is a big part of why Johnson County has world class parks, greenways and trails, natural resources conservation, and educational programs. It's been wonderful collaborating in many ways since meeting in Site Planning class at the KU Regents Center (now Edwards Campus) 25 years ago. Congratulations on your 39-year legacy, Bill, and enjoy your retirement!\n\n1/3\n\n57 reactions\n57\n\nLike\nComment\nRepost\nSend\n\nScott Schulte reposted this\n\nMark Jakubauskas \n • 3rd+\n\nProgram Director at The University of Kansas\n\n5mo • \n\nFrom KU Environmental Studies:\n\nIn Memoriam: Sarah Milgrim\n\nIt is with profound sadness that we share the news of the passing of Sarah Milgrim, a beloved alumna of the KU Environmental Studies program. Sarah was one of the victims of the tragic shooting at a Jewish Museum in Washington DC.\nSarah graduated with a BS in Environmental Studies from KU. She was a remarkable individual, deeply committed to fostering peace and cooperation. Her honors thesis focused on peace efforts between Israeli and Palestinian organizations, and she continued her studies at American University, including time at the University of Peace in Costa Rica.\nSarah's dedication to making the world a better place was evident in all she did. She was a wonderful person and employee, and her influence extended far beyond her time at KU. Her passion for environmental studies and peace efforts inspired many, and her loss is deeply felt by all who knew her.\nWe extend our heartfelt condolences to Sarah's family, friends, and all who were touched by her kindness and commitment to positive change. Her legacy will continue to inspire us.\n… more\n\n232 reactions\n232\n\n5 comments\n\n•\n\n4 reposts\n\nLike\nComment\nRepost\nSend\n\nScott Schulte \n • 2nd\n\nAssociate Professor of the Practice, KU Edwards Campus\n\n5mo • \n\nIt's a wrap! Congratulations to our outstanding graduates from the Environmental Assessment Professional Science Masters program at the KU Edwards Campus and the KU Environmental Studies Program. The world needs you more than ever! #RCJH #KUINKC\n\n1/5\n\n86 reactions\n86\n\n1 comment\n\n•\n\n1 repost\n\nLike\nComment\nRepost\nSend\n\nScott Schulte \n • 2nd\n\nAssociate Professor of the Practice, KU Edwards Campus\n\n6mo • \n\nA great Earth Day at the The University of Kansas Field Station teaching KU Environmental Studies students from Lawrence and the KU Edwards Campus about lake ecology and monitoring. Universities provide critical services through research on how the natural world works, it's health, and the impact of changes on our own health and wellbeing. I'm privileged to help Robert Hagen pass on this know-how to the next Greatest Generation. \n\n1/7\n\n81 reactions\n81\n\n1 repost\n\nLike\nComment\nRepost\nSend\n\nScott Schulte \n • 2nd\n\nAssociate Professor of the Practice, KU Edwards Campus\n\n7mo • \n\nI'm glad our professional community is uniting to support these critical water protections and  investments. Much of my career has involved water resources planning, design, and project implementation that make our  communities safer and more resilient and restore our natural resources. \n\nAndy Sauer \n • 2nd\n\nCreating Smart Stormwater Solutions at Burns & McDonnell\n\n7mo • \n\nLast Wednesday, WEF and nine other national water professional organizations sent a letter to Lee Zeldin, Administrator of the EPA, regarding the impacts of reducing funding to the EPA and more importantly to state funding programs that are the backbone of water infrastructure improvements. Without clean safe drinking water, proper wastewater systems, and effective stormwater management controls we will not be a prosperous country where we can feel safe to drink the water, flush a toilet, or drive across a stream. Water is the foundation of cultures, and we are eroding our ability to just maintain what water infrastructure we have not to mention trying to make it more modern and cost effective for the next generation. Cutting funding to basic water infrastructure is not how we make America Great. \n\nLetter to EPA March 12 2025\n\n2 pages\n\n1 / 2\n\n0\n\n16 reactions\n16\n\nLike\nComment\nRepost\nSend\n\nScott Schulte \n • 2nd\n\nAssociate Professor of the Practice, KU Edwards Campus\n\n7mo • Edited • \n\nAnother very good day to be out of the office/classroom/lab with Dr. Robert Hagen and KU Edwards Campus and Lawrence KU Environmental Studies Field Ecology students, setting up wildlife cameras at the Overland Park Arboretum. #KUINKC #EVRN \n\n1/3\n\n79 reactions\n79\n\n1 repost\n\nLike\nComment\nRepost\nSend\nShow all\nExperience\n\nThe University of Kansas\n\n10 yrs 3 mos\n\nAssociate Professor of the Practice\n\nFull-time\n\nJul 2022 - Present · 3 yrs 4 mos\n\nOverland Park, Kansas, United States\n\nI am a Professor of the Practice in the Environmental Assessment Professional Science Masters and the undergraduate Environmental Studies degree completion programs where I teach undergraduate and graduate students and mentor students in capstone projects. I also conduct applied research and outreach in community and climate resilience, environmental conservation and policy.\n… more\n\nLecturer\n\nAug 2015 - Aug 2022 · 7 yrs 1 mo\n\nProfessional Science Masters (PSM) in Environmental Assessment - Edwards Campus\n\nInstruct undergraduate and graduate students in Environmental Impact Assessment, regulatory permitting and National Environmental Policy Act compliance.\n\nSenior Environmental Planner\n\nVireo\n\nJul 2005 - Present · 20 yrs 4 mos\n\nKansas City Metropolitan Area\n\nVireo is a planning and design firm where being fresh, healthy, and vigorous is more than an ideology; it's how we do business every day.\n\nBoard Member\n\nHeartland Conservation Alliance\n\nJan 2012 - Present · 13 yrs 10 mos\n\nKansas City Metropolitan Area\n\nFounding President of Heartland Conservation Alliance, served in this capacity until March 2016. During this period HCA grew from an all-volunteer organization to an established conservation alliance serving and collaborating with numerous federal, state, local, and not-for-profit organizations; with an annual operating budget of over $300,000, three full-time and part-time staff, and an AmeriCorps VISTA. Currently serving on the Board of Directors supporting the Conservation Work Group and Policy Work Group, the Urban Waters Federal Partnership, and ecosystem restoration at the Kansas City, Missouri Municipal Farm near the confluence of Brush Creek and the Blue River.\n… more\n\nLecturer\n\nThe University of Kansas\n\nJan 2010 - May 2015 · 5 yrs 5 mos\n\nLawrence, Kansas, United States\n\nInstruct undergraduate and graduate students in environmental planning methods, environmental permitting and National Environmental Policy Act compliance.\n\nEnvironmental and Land Use Planner\n\nTetra Tech EM Inc.\n\nOct 1994 - Jul 2005 · 10 yrs 10 mos\n\nKansas City Metropolitan Area\n\nPerformed environmental site investigations, assisted with regulatory compliance oversight, prepared watershed management plans and designed stormwater best management practices.  Team Leader and watershed team manager.\n… more\n\nShow all\nEducation\n\nUniversity of Kansas\n\nMaster of Urban Planning, Environmental and Land Use Planning\n\n1997 – 2002\n\nUniversity of Kansas\n\nB.A., Political Science/French\n\n1987 – 1992\n\nProjects\n\nLake Lenexa\n\nApr 2001 – Aug 2008\n\nShow project\n\nLake Lenexa is a (~30 acre) man-made lake in western Lenexa KS.  The dam and spillway feature unique design elements, including a contoured ogee spillway and 360 degree accessibility via a bridge spanning the spillway stilling basin.  Black Hoof park is adjacent to the lake, and features multiple wetland areas, including an educational boardwalk.\n… more\n\nOther contributors\n\n+5\nView all contributors\n\nHeartland 2050\n\nShow project\n\nBy 2050 the population in the Omaha/Council Bluffs region is projected to nearly double. When it’s compared to regions across the country, it's in an enviable position because its quality of life is high and backed by strong neighborhoods, a solid economy, and low cost of living. Still, the region faces serious socio-economic disparities (areas of concentrated poverty and housing segregation) and challenges (projected major demographic shifts) that will test the region’s resiliency. Community leaders in the public, private, and nonprofit sectors are already taking steps through Heartland 2050, the Omaha/Council Bluff’s region’s first regional vision plan, to connect its more vulnerable communities to educational and economic opportunities. Residents want to ensure that the region continues to thrive and becomes a place where people of all walks of life have the opportunity to live, work, play and contribute. \n… more\n\nOther contributors\n\nView all contributors\nSkills\n\nEnvironmental Awareness\n\n69 endorsements\n\nEndorsed by Jennifer Ronk and 2 others who are highly skilled at this\n\nSustainability\n\n27 endorsements\n\nEndorsed by Otavio Silva who is highly skilled at this\n\nShow all\nRecommendations\nReceived\nGiven\n\nNothing to see for now\n\nRecommendations that Scott receives will appear here.\n\nInterests\nTop Voices\nCompanies\nGroups\nNewsletters\nSchools\n\nMohamed El-Erian \n\n· 3rd\n\nFinance, Economics Expert\n\n2,612,886 followers\n\nFollow\n\nRichard Branson \n\n· 3rd\n\nFounder at Virgin Group\n\n18,674,191 followers\n\nFollow\nShow all\n\nPeople also viewed\n\nTom Jacobs \n\n· 2nd\n\nChief Resilience Officer at Mid-America Regional Council\n\nConnect\n\nAshley Z. Hand \n\n· 2nd\n\nExercising the power of convening.\n\nConnect\n\nEric Kirkendall\n\n· 2nd\n\nBusiness and IT consultant, founder and director of the Lawrence Creates Makerspace and CleanAirNow clean air coalition.\n\nConnect\n\nShannon O'Lear \n\n· 3rd\n\nProfessor of Geography at the University of Kansas\n\nFollow\n\nEd Hubert \n\n· 2nd\n\nDeputy Regional Environmental Officer at FEMA\n\nConnect\nShow all\n\nExplore premium profiles\n\nSusan Kelly \n\n· 3rd\n\nDriving Innovation in Document Search & Access | President @ MicroSearch | JD, Boston College\n\nMessage\n\nDuke Pham \n\n· 3rd\n\nFounder at Phonomenal, Inc\n\nMessage\n\nTed Christianson \n\n· 3rd\n\nEntrepreneur and CEO\n\nMessage\n\nPeople you may know\n\nFrom Scott's industry\n\nChristopher Egert \n\n· 2nd\n\nProfessor, School of Interactive Games and Media at Rochester Institute of Technology\n\nConnect\n\nJim Leone \n\n· 2nd\n\nProfessor Emeritus at Rochester Institute of Technology\n\nConnect\n\nSteve Zilora \n\n· 2nd\n\nProfessor in the iSchool at Rochester Institute of Technology\n\nConnect\n\nMichael Radin\n\n· 3rd\n\nAssociate Professor of Mathematics at RIT\n\nConnect\n\nLisa Hermsen\n\n· 2nd\n\n--\n\nConnect\nShow all\n\nYou might like\n\nPages for you\n\nThe Lumisphere Experience\n\nThink Tanks\n\n53 followers\n\nBugge & 1 other connection follow this page\n\nFollow\n\nEcological Restoration Alliance\n\nEnvironmental Services\n\n3,834 followers\n\nArjun works here\n\nFollow\nShow all\n\nAbout\n\nAccessibility\n\nTalent Solutions\n\nCommunity Guidelines\n\nCareers\n\nMarketing Solutions \n\nPrivacy & Terms\n\nAd Choices\n\nAdvertising\n\nSales Solutions\n\nMobile\n\nSmall Business\n\nSafety Center\n\nLinkedIn Corporation © 2025\n\nQuestions?\n\nVisit our Help Center.\n\nManage your account and privacy\n\nGo to your Settings.\n\nRecommendation transparency\n\nLearn more about Recommended Content.\n\nSelect language\n\nالعربية (Arabic)\nবাংলা (Bangla)\nČeština (Czech)\nDansk (Danish)\nDeutsch (German)\nΕλληνικά (Greek)\nEnglish (English)\nEspañol (Spanish)\nفارسی (Persian)\nSuomi (Finnish)\nFrançais (French)\nहिंदी (Hindi)\nMagyar (Hungarian)\nBahasa Indonesia (Indonesian)\nItaliano (Italian)\nעברית (Hebrew)\n日本語 (Japanese)\n한국어 (Korean)\nमराठी (Marathi)\nBahasa Malaysia (Malay)\nNederlands (Dutch)\nNorsk (Norwegian)\nਪੰਜਾਬੀ (Punjabi)\nPolski (Polish)\nPortuguês (Portuguese)\nRomână (Romanian)\nРусский (Russian)\nSvenska (Swedish)\nతెలుగు (Telugu)\nภาษาไทย (Thai)\nTagalog (Tagalog)\nTürkçe (Turkish)\nУкраїнська (Ukrainian)\nTiếng Việt (Vietnamese)\n简体中文 (Chinese (Simplified))\n正體中文 (Chinese (Traditional))"
  }
}