{
  "url": "https://www.linkedin.com/in/theopistaabalo35/",
  "scraped_at": "2025-10-30T11:47:48.001526",
  "extracted": {
    "name": "Theopista Abalo",
    "headline": "FAO Young Forest Champion| Passionate about Sustainable Forest Resource Utilization",
    "full_text": "Theopista Abalo\n\n· 1st\n\nFAO Young Forest Champion| Passionate about Sustainable Forest Resource Utilization\n\nKampala, Central Region, Uganda\n\n·\n\nContact info\n\nInternational Forestry Students'​ Association (IFSA)\n\nMakerere University\n\n500+ connections\n\nJoshua, Diana and 25 other mutual connections\n\nMessage\nHighlights\n\n2 mutual groups\n\nYou and Theopista are both in Sustainable Agriculture & Rural Development and Climate Change / ESG Professionals Group\n\nAbout\n\nI am Abalo Theopista, a final year forestry student at Makerere University. I served  as the regional representative of Southern Africa with the International Forestry Students Association, and currently an FAO Young Forest Champion 2025.\n\nI am passionate about  research  in  areas of sustainable forest resource management and utilization. I am always eager to contribute to a more sustainable world for a better mother nature and the life it houses. \n\nI'm a skilled communicator and collaborative team leader, with a strong ability to learn and adapt quickly. I'm passionate about continuous growth and seeking opportunities to challenge myself, particularly in initiatives and organizations that prioritize sustainable natural resource management and environmental protection. I believe in working towards a future where our natural resources are preserved and utilized responsibly, without compromising the environment's integrity.\n… more\n\nTop skills\n\nSocial Media • Community Outreach • Communication • Analytical Skills • Project Management\n\nActivity\n\n2,551 followers\n\nPosts\nComments\nVideos\nImages\n\nTheopista Abalo reposted this\n\nGad Okodi • 2nd\n\nForester ||Young Forest Champion ||\n\n6d • Edited • \n\nI’m happy to share that I’m starting a new position as GLF/YiL Focal Point person at International Forestry Students'​ Association (IFSA).\n\nIn this role, I’ll be working closely with the External Councilor and Head of Partner Commission Theopista Abalo to strengthen IFSA’s collaboration with the Global Landscapes Forum (GLF) and Youth in Landscape Initiative (YIL). \n\nI will empower young forestry voices, fostering partnerships, and amplifying youth-led actions for sustainable landscapes.\n\nI look forward to contributing to a more connected and impactful global forestry community who are acting locally but impacting globally🌳\n… more\n\nStarting a new position\n\nTheopista Abalo and 62 others reacted\nTheopista Abalo and 62 others\n\n17 comments\n\n•\n\n1 repost\n\nLike\nComment\nRepost\nSend\n\nTheopista Abalo • 1st\n\nFAO Young Forest Champion| Passionate about Sustainable Forest Resource Utilization\n\n1mo • \n\nI’m happy to share that I’m starting a new position as Head of Partners Commission at International Forestry Students' Association (IFSA)!\n\nStarting a new position\n\nRichard Tusabe and 67 others reacted\nRichard Tusabe and 67 others\n\n36 comments\n\nLike\nComment\nRepost\nSend\n\nTheopista Abalo reposted this\n\nDavis Ssemanda • 2nd\n\nForester. Ecologist. Research. Environmental Consultant.\n\n1mo • \n\nHonoured to be featured by the Food and Agriculture Organization FAO for my work on forest health in Uganda. \n👉https://lnkd.in/dXmBAaPq 👈\n\nThis recognition is a reminder of the importance of innovation, collaboration, and empowering early-career professionals in addressing global environmental challenges.\n\nThe feature followed my participation in the Youth Action in Forest Health Competition, where I shared research on paper mulberry invasion in Mabira forest, subsequently winning a scholarship at BFU. \n\nThank you to everyone who continues to support and inspire this journey. Onwards!\n\nNatalia Paola Cano Marimon Amaitum Joshua Elukut Green Africa Youth Organization (GAYO)-Uganda Michael Ssekaayi Mbogga ENOCK SSEKUUBWA International Forestry Students'​ Association (IFSA) Wycliff Talemwa Stella Ndagire\n\n\nCurious about the research? Read it here\nhttps://lnkd.in/d65-Gytx \n… more\n\ndetail\n\nfao.org\n\nTheopista Abalo and 27 others reacted\nTheopista Abalo and 27 others\n\n3 comments\n\n•\n\n5 reposts\n\nLike\nComment\nRepost\nSend\n\nTheopista Abalo reposted this\n\nEcoFreak\n\n130 followers\n\n2mo • \n\n🎍Did you know some bamboos run🏃‍♀️? \nLets catch them today🫷\n\nThe famous Phyllostachys species are  the most notorious running bamboo species. Their rhizomes  spread aggressively over the entire area in which one single shoot was planted with the underground rhizomes allowing for new shoots and culms to emerge. Depending on the situation,it could be a disadvantage due to high costs of maintenance or perhaps an advantage interms of high yields associated with it.\n\n🌳At EcoFreak, we are raising the alternative choice. The Oxytenanthera abyssinica famously know as the African bamboo and the ever green bamboo.🍃\nIt is mostly a clumping bamboo that grows in dense cluster of culms in a contained area making it non invasive and easy to manage. It's rhizomes spread but not as much as the Phyllostachys.\n\nIt's is one of the most versitile bamboo in terms of application and growing conditions. It grows in the  East and Central Africa.🌍\n \nUnlike most bamboo species which are hollow and light weight, the African Bamboo has solid or semi solid culms that gives it a superior tensile strength making it one of the top choices for construction🏗 and furniture🚪.With this, It's a natural alternative to timber, reducing pressure on forests🌳🌳.\n\nBecause of its drought resistance, its able to grow in dry areas and with an extensive root system  its suitable for erosion control. Its can therefore be grown along river banks . All these make it one of the Climate solutions we need🍁\n\n🌳As we protect out forests we have to think of other feasible alternatives to ensure sustainability in our efforts👣\n\nThe interesting things about value addition in Bamboo  as we saw at Amabanda Uganda Limited is the true definition of a zero waste and  circular economy that we so much need right now.\n\nAnd for the african bamboo every part of the plant has a purpose. The leaves serve as valuable animal fodder, the young shoots are a source of food, and the stems can be processed into biofuel and more.\n\n📌Which bamboo fact did you just find out? Share with your thoughts with us in the comments.\n\nSpecial Thanks to Dr Charles Koojo Amooti from #KontikibambooWorks for his presentation on Common Bamboo species in Uganda during the Amabanda Uganda Limited Bamboo processing Masterclass.\n\n#sustainability #bioeconomy #africanbamboo #innovation #sustainablesolutions\n#climateaction\n\n… more\n\n1/2\n\nInnocent Ociti and 27 others reacted\nInnocent Ociti and 27 others\n\n4 comments\n\n•\n\n3 reposts\n\nLike\nComment\nRepost\nSend\n\nTheopista Abalo reposted this\n\nEcoFreak\n\n130 followers\n\n2mo • \n\n🎋The more the sustainable solutions the better for our forests!!🎋\n\nWe recently attended a highly informative Masterclass on the Commercial Processing of bamboo, hosted by Bamboo Uganda and its partners, like Bijimu Bamboo Farming Services Amabanda Uganda Limited and EKiBBO Farming Services Ltd.\n\n It was inspiring to see so many architects👲 in attendance, a clear sign that sustainable solutions are becoming mainstream and a significant part of our daily choices ✅️ \n\n🎍Bamboo is more than just a material it's one of the carbon storing Gurus. By transforming it into beautiful crafts and durable buildings, we're locking away carbon and building a more sustainable future.\n\n 🎍The session provided a deep dive into the entire process, from treating the raw material to converting it into a wide range of finished products. Every piece of beautiful craft or strong building contributes to this effort.\n\n🎍However, despite all these innovations, a critical question remains, why is the number of bamboo farmers still so low? \n\nInstitutions like Amabanda Uganda Limited are at the forefront of this solution. They empower 🧑‍🧑‍🧒‍🧒 communities by teaching them to grow bamboo,they purchase their harvests, and also train them to create various products. \n\n🍃For a forest community, this not only sustains their livelihoods but also provides a viable alternative to forest dependency.\n\n🎋Considering that it takes up to six years for bamboo to reach maturity, it feels like we are six years behind in our efforts to protect more forests.\n\nIn the coming days, we will be sharing more of our takeaways from this incredible session, including a look at the different types of bamboo species right here in Uganda and beyond, their treatment methods, and their immense benefits to the environment.🌏\n\nStay tuned to learn more!\n\n\n#sustainability\n#bamboorevolution\n#sustainablealternatives\n\n… more\n\n1/4\n\nSunday Geofrey and 123 others reacted\nSunday Geofrey and 123 others\n\n14 comments\n\n•\n\n8 reposts\n\nLike\nComment\nRepost\nSend\n\nTheopista Abalo reposted this\n\nEva Ntara • 2nd\n\nArtsy Environmentalist\n\n3mo • \n\nFrom 14–16 July, I facilitated the #AIM4Forests Young #ForestChampions workshop in Kampala, Uganda – an inspiring gathering of 10 passionate young leaders from across the country.\n\nOrganized by FAO Uganda, the Ministry of Water and Environment, the National Forestry Authority, and Youth Go Green, the workshop focused on equipping Uganda’s next generation of forest leaders to support the country’s goal of reaching 24% forest cover by 2040.\n\nWe planted 200 indigenous seedlings at Mpanga Forest Reserve and used FAO’s Open Foris Ground to geolocate each tree gaining hands-on experience in digital forest monitoring.\n\nRead more here: https://lnkd.in/dPhvvJb4\n\nWhat stood out to me most? I left this workshop feeling incredibly hopeful. Young people are not just passionate, they’re prepared. With the right tools, skills, and networks, they’re ready to lead forest restoration efforts from the ground up.\n\n#ForestChampions #AIM4Forests #YouthInForestry #ClimateAction #ForestMonitoring #UgandaForests #GenerationRestoration #OpenForis #GlobalYouthAction #Forestry\n\nJulian Fox,Till Neeff, Nadir Carolina Pallqui Camacho, Vanessa Vertiz, Billy Rwothungeyo, Pilar Valbuena Perez, Enock Kaluuba, Edwin Muhumuza, Theopista Abalo, LANDO IVAN, Gad Okodi, Samuel Tahinduka, LOVIC BWAMBALE, Pius Turinawe, Ekel Fiona, Patricia Arinaitwe, Margret Nabagereka, Bako Patience, Elizabeth Kabakoyo, Racheal Katushabe, Katalikawe William, Bob Kazungu\n… more\n\nKhalil Walji and 85 others reacted\nKhalil Walji and 85 others\n\n13 comments\n\n•\n\n9 reposts\n\nLike\nComment\nRepost\nSend\n\nTheopista Abalo reposted this\n\nAmabanda Uganda Limited\n\n1,615 followers\n\n3mo • \n\nWhat an incredible day we had at the Bamboo Uganda Masterclass last Saturday the 26th of July 2025! 🌱✨ \n\nWe were thrilled to host a diverse group of enthusiasts, entrepreneurs, and industry experts at Amabanda Uganda Limited (the bamboo processing facility) in Kiyoola, Mukono. This event was not just about learning; it was about building a community passionate about the potential of bamboo in Uganda.\n\nHere are some highlights from the day:\n\n1. Factory Tour: \nOur General Manager, Collin Muhumuza, led an insightful tour of our state-of-the-art bamboo processing facility. Attendees were able to see firsthand how we transform bamboo into valuable products, showcasing the innovation and potential within this industry.\n\n2. Best Bamboo Species for Processing:\nDr Koojo Charles Amooti, GM of Kontiki Bamboo Works Ltd, shared his expertise on the best bamboo species for commercial processing. His insights were invaluable for those looking to optimize their bamboo production.\n\n3. The Dos & Don’ts of Bamboo Treatment: Herwig Van Geenhoven, a co-founder of Amabanda Uganda Limited, provided practical tips on bamboo treatment. His session was filled with essential knowledge that will help our participants avoid common pitfalls.\n\n4. Common Business Mistakes:\nRobert Ssemakula, Bcom, LLM., GM of Bamboo Uganda, discussed critical business mistakes to avoid to ensure profitability in the bamboo sector. His experience and advice resonated with many aspiring entrepreneurs.\n\n5. Alternative Income Streams for Bamboo Farmers: Sophie Arcedeckne-Butler, Managing Director of EKiBBO Farming Services Ltd, enlightened us on alternative income streams for bamboo farmers. Her innovative ideas opened new avenues for income generation, emphasizing the versatility of bamboo.\n\n6. Certificate of Training: \nWe concluded the day by awarding Certificates of Training in Commercial Processing of Bamboo: The Dos & Don’ts of Bamboo Treatment Series 1. It was a proud moment to recognize the commitment of participants to advancing their knowledge and skills in this field.\n\nWe are grateful to everyone who joined us and contributed to the success of this event. Your enthusiasm and commitment to the bamboo industry inspire us to continue our mission of promoting sustainable bamboo value addition in Uganda.\n\nSwipe through the photos to relive the moments from this enriching experience! 📸\n\nTogether, let’s harness the power of bamboo to create a sustainable future and unlock new opportunities for our communities.\n\nBamboo Uganda + Bijimu Bamboo Farming Services + EKiBBO Farming Services Ltd + Amabanda Uganda Limited + Studio Akeka\n\n#BambooUganda #Sustainability #ValueAddition #Innovation #CommunityBuilding #AmabandaUganda \n… more\n\n1/13\n\nOwor Fredrick william and 60 others reacted\nOwor Fredrick william and 60 others\n\n9 comments\n\n•\n\n10 reposts\n\nLike\nComment\nRepost\nSend\n\nTheopista Abalo • 1st\n\nFAO Young Forest Champion| Passionate about Sustainable Forest Resource Utilization\n\n3mo • \n\nA voice 4forests!!\nI recently participated in a 3days workshop and training for the FAO #YoungForestChampions under the #AIM4Forests program.  \n\nThe event was launched by Mr. Stuart Maniraguha, the Executive Director of the #NationalForestryAuthority(NFA), who shared extensive insights about the history of the forestry department, tracing its roots from the 1940s to the present day. In the same room, we were honoured to have knowledgeable foresters like Ndyabandiho saul and Derrick Rukundo from the #MinistryofWaterandEnvironment,  who inspired budding foresters like me with their stories of how they progressed from their early studies to their current positions.\n\nWe learnt about the FAO's forest monitoring tools and their practical applications in the field. One tool, called #Ground, is user-friendly and can operate offline with a pre-created data collection survey. On the last day, while at the #MpangaCFR, we practically used it to map the trees we planted. This will help us trace and monitor their growth.\n 💃I highly recommend trying #Ground for tree growers and restoration initiatives.\n\nThe #NFAteam at #MpangaCFR provided us with a wealth of information about the forest, describing it as one of the ecosystems that hosts a diverse range of butterflies and bird species. As such, it's a great destination for recreational activities like bird watching and research. However, despite all these positive aspects, #MpangaCR, like many others in Uganda, is one of the most threatened areas. Its location within the Mpigi District Town Council leads to uncontrolled access, particularly from illegal loggers.\n\nThis forest was significantly impacted about ten years ago by a windstorm that uprooted trees over 100 years old, affecting half of the 400 hectares of the reserve. The reasons for this event remain unknown; thus, further research is needed. Following this loss and ongoing threats, the forest canopy is heavily gapped, and it will take over 30 years or more for it to regain its usual state. 🤷‍♀️How best can we assist in its recovery?\n👉 I encourage #NGOs and other organisations looking to make an impact through tree planting to consider the #MpangaCFR as a key site for their initiatives.\n\n🧏‍♀️Effective communication is one of the essential aspects of sustainable forest management. Access to information enables us to make informed decisions and agree on the best solutions with various stakeholders and partners.\n🦻 I plan to share forest stories with the community, translating scientific and technical jargon into simple, easy to understand language. This influence starts from the inside(hearts) to the outside (hands).\n\nThank you, Eva Ntara, Rocío Dánica Cóndor-Golec, Julian Fox, the FAO Country team, #YouthGoGreenteam, Muhumuza Edwin, #NFA and #MOWE for providing this platform. This is a launchpad for many of us.\n\nThank you to all my fellow #youngforestchampions, this experience couldn't have been better without you all.\nPius Turinawe Ekel Fiona\n\n\n… more\n\n1/5\n\nAnna Akpe and 110 others reacted\nAnna Akpe and 110 others\n\n23 comments\n\n•\n\n3 reposts\n\nLike\nComment\nRepost\nSend\n\nTheopista Abalo reposted this\n\nSamuel Tahinduka • 2nd\n\nAn Autodidact | Research Assistant @ Catholic Relief Services | Geographical Sciences  | Young Forest Champion Uganda 2025  | Global Forests Spokesperson\n\n3mo • Edited • \n\nFrom 14th to 16th July 2025, I had the incredible opportunity to take part in the #AIM4Forests Young Forest Champions Workshop in Uganda, an initiative by FAO , in collaboration with the National Forestry Authority Uganda, Ministry of Water and Environment, Youth Go Green and World Food Forum Uganda Chapter.\n\nThis workshop brought together passionate young champions from across Uganda carrying stories, dreams, and commitment to sustainable forest management and climate action. Through intense capacity-building sessions, we explored themes such as:\n\n🔹 Participatory forest monitoring and conservation \n🔹 Indigenous knowledge and biodiversity\n🔹 Climate resilience through forest landscape restoration\n🔹 Opportunities for youth in sustainable forest enterprises etc\n\nWe later had a field visit to Mpanga Forest Central Reserve, a biodiversity-rich ecosystem in Mpigi District. During this visit, we translated our learning into action by planting indigenous tree species critical for restoration and local livelihoods. We also practically used FAO's Open Foris Ground mobile application to collect data on the planted species for smooth monitoring purposes.\n\nI personally planted three different tree species with significant ecological and cultural value:\n1.Warburgia ugandensis; known for its medicinal properties\n2.Prunus africana; valued for both its medicinal bark and conservation status\n3.Markhamia lutea; an important species for both shade and soil protection\nThis symbolises hope, commitment, and youth-driven action toward reversing forest loss and land degradation.\n\nI am deeply grateful to FAO and all facilitators and fellow participants who made this experience so meaningful. This workshop did not only deepen my technical knowledge, but also reaffirmed my vision for youth-led forest monitoring and environmental stewardship.\nEva Ntara Gad Okodi Theopista Abalo Bwambale Lovic Bako Patience LANDO IVAN Rocío Dánica Cóndor-Golec Julian Fox\n#AIM4Forests\n#YoungForestChampions\n… more\n\n1/15\n\n68 reactions\n68\n\n6 comments\n\n•\n\n4 reposts\n\nLike\nComment\nRepost\nSend\n\nTheopista Abalo reposted this\n\nGad Okodi • 2nd\n\nForester ||Young Forest Champion ||\n\n3mo • Edited • \n\n#FieldDay in #MpangaCentralForest Reserve as part of the Young Forest Champions workshop in Kampala!\n\nToday, we had a field visit to Mpanga Forest, a 400-hectare gazetted central forest reserve having 29 reserves since 1932, supports an impressive and amazing biodiversity for such a small forest. It has 500 species of trees and shrubs including Celtis Spp, 300 species of birds, 97 butterflies, and 112 moths but facing significant challenges. A recent windthrow disaster of 2015 affected 200 hectares of the forest, prompting restoration efforts by the Grow partner. Recent research has revealed that the forest's soil is sandy, which could be the cause of the disturbance, however, research is needed to understand the underlying causes of these natural disasters and  ensure the forest's future sustainability. The forest's unique characteristics, with bigger trees and limited undergrowth, raise concerns about its resilience.\n\nDespite being surrounded by a human-dominated landscape and facing pressure from firewood collection and illegal tree cutting by the drum makers, Mpanga Forest remains a vital haven for biodiversity. It's renowned for its exceptional butterfly and birding opportunities and when visited at night, you can have a chance of spotting the #bushbabies . \n\nIn the field,  we also had a chance of participation in the restoration of the forest through strip planting and tree species planted include: Cordia milleni(Drum tree), Cynometra alexandria(Iron wood),  khaya anthotheca(Mahogany), Maesopsis eminii(Umbrella tree), Prunus africana(African cherry), Werbugia ugandensis(Mukuzanume,Covidex), among others. \n\nAbove all,  all these tree seedlings  planted were mapped using the skills we obtained from the training by Eva Ntara on #OpenForisGround to map trees planted by automatically taking coordinates,  tree species name,  time,  and any other relevant information after making a polygon in the app for a given restoration site for effective restoration reporting and monitoring. \n\nBesides I'm thrilled to be awarded a certificate of completion of the 3 day workshop for Young Forest Champions in Kampala Uganda and I'm grateful to the organizers like Eva Ntara Julian Fox Nadir Carolina Pallqui Camacho Rocío Dánica Cóndor-Golec and partners like national forestry authority nfa FAO World Food Forum Ndyabandiho saul Derrick Rukundo @Youth Go Green Uganda @Ministry of water and environment Uganda. \n\nWith restoration underway, it's crucial to balance conservation efforts with community needs and address the underlying causes of threats to ensure the long-term survival of this precious ecosystem.\n\nTo my fellow champions Theopista Abalo Bwambale Lovic Samuel Tahinduka Ekel Fiona Patricia Arinaitwe Margret Nabagereka Bako Patience LANDO IVAN Pius Turinawe I'm grateful to have you all. \n\n\"When we rise for forests, forests rise for us all\" Gad 2025😃\n\n#AIM4Forests\n#YoungForestChampions\n… more\n\n1/10\n\n61 reactions\n61\n\n11 comments\n\n•\n\n6 reposts\n\nLike\nComment\nRepost\nSend\nShow all\nExperience\n\nHead of Partners Commission \n\nInternational Forestry Students'​ Association (IFSA) · Part-time\n\nSep 2025 - Present · 2 mos\n\nGermany · Remote\n\nAs the Head of the Partners Commission (HoPAC),I serve as a liaison between IFSA and its external partner organizations, overseeing the Partners Commission's activities and ensuring coordination between the eight Heads of Sub-Commission and the IFSA Board. \n\nI also  manage sub-commission activities, assist with workshop and delegation preparations, ensuring timely submission of reports, and acting as the primary point of contact for these external partners.\n… more\n\nYoung Forest Champion \n\nFAO · Apprenticeship\n\nJun 2025 - Present · 5 mos\n\nHybrid · Hybrid\n\nOut of 1500 applications worldwide and 256 frol Uganda, I was selected as one of the 10 Young Forest Champions.\nThis role provides me with necessary mentorship and training with skills and knowledge essential for Forest Monitoring and research.\n… more\n\nUndergraduate Research Assistant\n\nMakerere University · Part-time\n\nFeb 2025 - Present · 9 mos\n\nKampala, Central Region, Uganda · Hybrid\n\nResearch Project:  Improving durability of Wooden utility poles_ Electricity Regulatory Authority Project 3\nResearch supervisor_ Associate Professor Paul Mugabi \n\nRoles.\nField data collection \nFollow up report writing\nData management and analysis\n… more\n\n Research Skills, Research Writing and +6 skills\n\nForestry Consultant\n\nThe Kenneth Kakuru Tree Planting Initiative · Seasonal\n\nJul 2024 - Present · 1 yr 4 mos\n\nKampala, Central Region, Uganda · On-site\n\nWork together with the team to avail knowledge on forest protection,  forest ecosystem and landscape restoration while engaging and educating members of the community, schools on things to do with tree planting, sensitization significance of environmental protection.\n… more\n\nSite visit at a wetland restoration site of Kyambura, Volcanoes Safaris \n\n Nature Conservation, Forest Management and +2 skills\n\nLead Project Coordinator\n\nForestry Association Makerere University (FAMU IFSA LC) · Full-time\n\nApr 2024 - Apr 2025 · 1 yr 1 mo\n\nKampala, Central Region, Uganda · On-site\n\nCertificate of Appreciation\n\n Community Outreach, Communication and +1 skill\n\nShow all\nEducation\n\nMakerere University\n\nBachelor's degree of science in Forestry , Forestry\n\nJan 2022 – Jan 2026\n\n Project Management, Social Media and +4 skills\n\nSkills\n\nResearch Skills\n\nUndergraduate Research Assistant at Makerere University\n\nEndorse\n\nResearch Writing\n\nUndergraduate Research Assistant at Makerere University\n\nEndorse\nShow all\nInterests\nTop Voices\nCompanies\nGroups\nNewsletters\nSchools\n\nJordy Leiser \n\n· 2nd\n\nCo-Founder and CEO at Jump\n\n188,219 followers\n\nFollow\n\nAdrian Garcia-Aranyos \n\n· 2nd\n\nPresident - Thune Eureka\n\n41,528 followers\n\nFollow\nShow all\n\nPeople also viewed\n\nSamuel Kusasira\n\n· 2nd\n\nRenewable energy and Climate change Researcher\n\nFollow\n\nPatricia Arinaitwe \n\n· 2nd\n\n | Agriprenuer  | Agricultural Extensionist  | writer | sustainable Agriculture Advocate| Research|FAO  Young Forest Champion |WFF Youth  representative 25’|Founder @Agritalk Connect\n\nConnect\n\nNadir Carolina Pallqui Camacho\n\n· 2nd\n\nForest MRV specialist at FAO-Rome\n\nConnect\n\nLILIAN NANCY ACIRO\n\n· 2nd\n\nLivelihoods and Market Systems Development Specialist\n\nConnect\n\nAkinyede Salvation \n\n· 2nd\n\nForestry Advocate | Climate Change Activist | Conservationist | Nature based solutions | Agroforestry | Growing Passion for Nature & Tech | Researcher\n\nFollow\nShow all\n\nExplore premium profiles\n\nYooRi Kim \n\n· 3rd\n\nNonprofit Entrepreneur & Philanthropy Advisor\n\nMessage\n\nJoshua Ferrazzano \n\n· 3rd\n\nCo-Founder / Managing Partner at World War Seven\n\nMessage\n\nXavier Delacour \n\n· 3rd\n\nFounder at Occam Vision Group\n\nMessage\n\nPeople you may know\n\nFrom Theopista's school\n\nPaul Hatanga\n\n· 2nd\n\nLarge Landscape Conservation\n\nConnect\n\nLilly Ajarova\n\n· 2nd\n\nSenior Presidential Advisor on Tourism | Sustainable Tourism & Conservation Expert | Global Speaker | Author | Board Member\n\nConnect\n\nAndy Kristian Agaba \n\n· 2nd\n\nFounder & CEO: Hiinga, Inc.\n\nFollow\n\nGodfrey Oluka\n\n· 2nd\n\nCatalysing integrated solutions to environmental, climate and biodiversity risks and challenges\n\nConnect\n\nGeoffrey Omoding \n\n· 2nd\n\nBusiness Development | Sales Strategy & Scaling Ventures in Emerging Markets| Social Impact Leader | Entrepreneur | Advisor & Former CEO\n\nConnect\nShow all\n\nYou might like\n\nPages for you\n\nThe Female Quotient\n\nAdvertising Services\n\n775,477 followers\n\nShelley works here\n\nFollow\n\nLockheed Martin\n\nDefense and Space Manufacturing\n\n2,934,806 followers\n\nHarvick & 5 other connections work here\n\nFollow\nShow all\n\nAbout\n\nAccessibility\n\nTalent Solutions\n\nCommunity Guidelines\n\nCareers\n\nMarketing Solutions \n\nPrivacy & Terms\n\nAd Choices\n\nAdvertising\n\nSales Solutions\n\nMobile\n\nSmall Business\n\nSafety Center\n\nLinkedIn Corporation © 2025\n\nQuestions?\n\nVisit our Help Center.\n\nManage your account and privacy\n\nGo to your Settings.\n\nRecommendation transparency\n\nLearn more about Recommended Content.\n\nSelect language\n\nالعربية (Arabic)\nবাংলা (Bangla)\nČeština (Czech)\nDansk (Danish)\nDeutsch (German)\nΕλληνικά (Greek)\nEnglish (English)\nEspañol (Spanish)\nفارسی (Persian)\nSuomi (Finnish)\nFrançais (French)\nहिंदी (Hindi)\nMagyar (Hungarian)\nBahasa Indonesia (Indonesian)\nItaliano (Italian)\nעברית (Hebrew)\n日本語 (Japanese)\n한국어 (Korean)\nमराठी (Marathi)\nBahasa Malaysia (Malay)\nNederlands (Dutch)\nNorsk (Norwegian)\nਪੰਜਾਬੀ (Punjabi)\nPolski (Polish)\nPortuguês (Portuguese)\nRomână (Romanian)\nРусский (Russian)\nSvenska (Swedish)\nతెలుగు (Telugu)\nภาษาไทย (Thai)\nTagalog (Tagalog)\nTürkçe (Turkish)\nУкраїнська (Ukrainian)\nTiếng Việt (Vietnamese)\n简体中文 (Chinese (Simplified))\n正體中文 (Chinese (Traditional))"
  }
}